const regions =[
  {
    "cities" : [
      {
        "id" : "33",
        "areas" : [
          {
            "id" : "378",
            "name" : "东城区",
            "zip_code" : "110101"
          },
          {
            "id" : "379",
            "name" : "西城区",
            "zip_code" : "110102"
          },
          {
            "id" : "382",
            "name" : "朝阳区",
            "zip_code" : "110105"
          },
          {
            "id" : "383",
            "name" : "丰台区",
            "zip_code" : "110106"
          },
          {
            "id" : "384",
            "name" : "石景山区",
            "zip_code" : "110107"
          },
          {
            "id" : "385",
            "name" : "海淀区",
            "zip_code" : "110108"
          },
          {
            "id" : "386",
            "name" : "门头沟区",
            "zip_code" : "110109"
          },
          {
            "id" : "387",
            "name" : "房山区",
            "zip_code" : "110111"
          },
          {
            "id" : "388",
            "name" : "通州区",
            "zip_code" : "110112"
          },
          {
            "id" : "389",
            "name" : "顺义区",
            "zip_code" : "110113"
          },
          {
            "id" : "390",
            "name" : "昌平区",
            "zip_code" : "110114"
          },
          {
            "id" : "391",
            "name" : "大兴区",
            "zip_code" : "110115"
          },
          {
            "id" : "392",
            "name" : "怀柔区",
            "zip_code" : "110116"
          },
          {
            "id" : "393",
            "name" : "平谷区",
            "zip_code" : "110117"
          },
          {
            "id" : "394",
            "name" : "密云县",
            "zip_code" : "110228"
          },
          {
            "id" : "395",
            "name" : "延庆县",
            "zip_code" : "110229"
          }
        ],
        "name" : "北京",
        "zip_code" : "110100"
      }
    ],
    "id" : "2",
    "name" : "北京",
    "zip_code" : "110000"
  },
  {
    "cities" : [
      {
        "id" : "35",
        "areas" : [
          {
            "id" : "396",
            "name" : "和平区",
            "zip_code" : "120101"
          },
          {
            "id" : "397",
            "name" : "河东区",
            "zip_code" : "120102"
          },
          {
            "id" : "398",
            "name" : "河西区",
            "zip_code" : "120103"
          },
          {
            "id" : "399",
            "name" : "南开区",
            "zip_code" : "120104"
          },
          {
            "id" : "400",
            "name" : "河北区",
            "zip_code" : "120105"
          },
          {
            "id" : "401",
            "name" : "红桥区",
            "zip_code" : "120106"
          },
          {
            "id" : "404",
            "name" : "滨海新区",
            "zip_code" : "120116"
          },
          {
            "id" : "405",
            "name" : "东丽区",
            "zip_code" : "120110"
          },
          {
            "id" : "406",
            "name" : "西青区",
            "zip_code" : "120111"
          },
          {
            "id" : "407",
            "name" : "津南区",
            "zip_code" : "120112"
          },
          {
            "id" : "408",
            "name" : "北辰区",
            "zip_code" : "120113"
          },
          {
            "id" : "409",
            "name" : "武清区",
            "zip_code" : "120114"
          },
          {
            "id" : "410",
            "name" : "宝坻区",
            "zip_code" : "120115"
          },
          {
            "id" : "411",
            "name" : "宁河县",
            "zip_code" : "120221"
          },
          {
            "id" : "412",
            "name" : "静海县",
            "zip_code" : "120223"
          },
          {
            "id" : "413",
            "name" : "蓟县",
            "zip_code" : "120225"
          }
        ],
        "name" : "天津",
        "zip_code" : "120100"
      }
    ],
    "id" : "3",
    "name" : "天津",
    "zip_code" : "120000"
  },
  {
    "cities" : [
      {
        "id" : "37",
        "areas" : [
          {
            "id" : "414",
            "name" : "市辖区",
            "zip_code" : "130101"
          },
          {
            "id" : "415",
            "name" : "长安区",
            "zip_code" : "130102"
          },
          {
            "id" : "416",
            "name" : "桥东区",
            "zip_code" : "130103"
          },
          {
            "id" : "417",
            "name" : "桥西区",
            "zip_code" : "130104"
          },
          {
            "id" : "418",
            "name" : "新华区",
            "zip_code" : "130105"
          },
          {
            "id" : "419",
            "name" : "井陉矿区",
            "zip_code" : "130107"
          },
          {
            "id" : "420",
            "name" : "裕华区",
            "zip_code" : "130108"
          },
          {
            "id" : "421",
            "name" : "井陉县",
            "zip_code" : "130121"
          },
          {
            "id" : "422",
            "name" : "正定县",
            "zip_code" : "130123"
          },
          {
            "id" : "423",
            "name" : "栾城县",
            "zip_code" : "130124"
          },
          {
            "id" : "424",
            "name" : "行唐县",
            "zip_code" : "130125"
          },
          {
            "id" : "425",
            "name" : "灵寿县",
            "zip_code" : "130126"
          },
          {
            "id" : "426",
            "name" : "高邑县",
            "zip_code" : "130127"
          },
          {
            "id" : "427",
            "name" : "深泽县",
            "zip_code" : "130128"
          },
          {
            "id" : "428",
            "name" : "赞皇县",
            "zip_code" : "130129"
          },
          {
            "id" : "429",
            "name" : "无极县",
            "zip_code" : "130130"
          },
          {
            "id" : "430",
            "name" : "平山县",
            "zip_code" : "130131"
          },
          {
            "id" : "431",
            "name" : "元氏县",
            "zip_code" : "130132"
          },
          {
            "id" : "432",
            "name" : "赵县",
            "zip_code" : "130133"
          },
          {
            "id" : "433",
            "name" : "辛集市",
            "zip_code" : "130181"
          },
          {
            "id" : "434",
            "name" : "藁城市",
            "zip_code" : "130182"
          },
          {
            "id" : "435",
            "name" : "晋州市",
            "zip_code" : "130183"
          },
          {
            "id" : "436",
            "name" : "新乐市",
            "zip_code" : "130184"
          },
          {
            "id" : "437",
            "name" : "鹿泉市",
            "zip_code" : "130185"
          }
        ],
        "name" : "石家庄",
        "zip_code" : "130100"
      },
      {
        "id" : "38",
        "areas" : [
          {
            "id" : "438",
            "name" : "市辖区",
            "zip_code" : "130201"
          },
          {
            "id" : "439",
            "name" : "路南区",
            "zip_code" : "130202"
          },
          {
            "id" : "440",
            "name" : "路北区",
            "zip_code" : "130203"
          },
          {
            "id" : "441",
            "name" : "古冶区",
            "zip_code" : "130204"
          },
          {
            "id" : "442",
            "name" : "开平区",
            "zip_code" : "130205"
          },
          {
            "id" : "443",
            "name" : "丰南区",
            "zip_code" : "130207"
          },
          {
            "id" : "444",
            "name" : "丰润区",
            "zip_code" : "130208"
          },
          {
            "id" : "445",
            "name" : "滦县",
            "zip_code" : "130223"
          },
          {
            "id" : "446",
            "name" : "滦南县",
            "zip_code" : "130224"
          },
          {
            "id" : "447",
            "name" : "乐亭县",
            "zip_code" : "130225"
          },
          {
            "id" : "448",
            "name" : "迁西县",
            "zip_code" : "130227"
          },
          {
            "id" : "449",
            "name" : "玉田县",
            "zip_code" : "130229"
          },
          {
            "id" : "450",
            "name" : "唐海县",
            "zip_code" : "130230"
          },
          {
            "id" : "451",
            "name" : "遵化市",
            "zip_code" : "130281"
          },
          {
            "id" : "452",
            "name" : "迁安市",
            "zip_code" : "130283"
          }
        ],
        "name" : "唐山",
        "zip_code" : "130200"
      },
      {
        "id" : "39",
        "areas" : [
          {
            "id" : "453",
            "name" : "市辖区",
            "zip_code" : "130301"
          },
          {
            "id" : "454",
            "name" : "海港区",
            "zip_code" : "130302"
          },
          {
            "id" : "455",
            "name" : "山海关区",
            "zip_code" : "130303"
          },
          {
            "id" : "456",
            "name" : "北戴河区",
            "zip_code" : "130304"
          },
          {
            "id" : "457",
            "name" : "青龙满族自治县",
            "zip_code" : "130321"
          },
          {
            "id" : "458",
            "name" : "昌黎县",
            "zip_code" : "130322"
          },
          {
            "id" : "459",
            "name" : "抚宁县",
            "zip_code" : "130323"
          },
          {
            "id" : "460",
            "name" : "卢龙县",
            "zip_code" : "130324"
          }
        ],
        "name" : "秦皇岛",
        "zip_code" : "130300"
      },
      {
        "id" : "40",
        "areas" : [
          {
            "id" : "461",
            "name" : "市辖区",
            "zip_code" : "130401"
          },
          {
            "id" : "462",
            "name" : "邯山区",
            "zip_code" : "130402"
          },
          {
            "id" : "463",
            "name" : "丛台区",
            "zip_code" : "130403"
          },
          {
            "id" : "464",
            "name" : "复兴区",
            "zip_code" : "130404"
          },
          {
            "id" : "465",
            "name" : "峰峰矿区",
            "zip_code" : "130406"
          },
          {
            "id" : "466",
            "name" : "邯郸县",
            "zip_code" : "130421"
          },
          {
            "id" : "467",
            "name" : "临漳县",
            "zip_code" : "130423"
          },
          {
            "id" : "468",
            "name" : "成安县",
            "zip_code" : "130424"
          },
          {
            "id" : "469",
            "name" : "大名县",
            "zip_code" : "130425"
          },
          {
            "id" : "470",
            "name" : "涉县",
            "zip_code" : "130426"
          },
          {
            "id" : "471",
            "name" : "磁县",
            "zip_code" : "130427"
          },
          {
            "id" : "472",
            "name" : "肥乡县",
            "zip_code" : "130428"
          },
          {
            "id" : "473",
            "name" : "永年县",
            "zip_code" : "130429"
          },
          {
            "id" : "474",
            "name" : "邱县",
            "zip_code" : "130430"
          },
          {
            "id" : "475",
            "name" : "鸡泽县",
            "zip_code" : "130431"
          },
          {
            "id" : "476",
            "name" : "广平县",
            "zip_code" : "130432"
          },
          {
            "id" : "477",
            "name" : "馆陶县",
            "zip_code" : "130433"
          },
          {
            "id" : "478",
            "name" : "魏县",
            "zip_code" : "130434"
          },
          {
            "id" : "479",
            "name" : "曲周县",
            "zip_code" : "130435"
          },
          {
            "id" : "480",
            "name" : "武安市",
            "zip_code" : "130481"
          }
        ],
        "name" : "邯郸",
        "zip_code" : "130400"
      },
      {
        "id" : "41",
        "areas" : [
          {
            "id" : "481",
            "name" : "市辖区",
            "zip_code" : "130501"
          },
          {
            "id" : "482",
            "name" : "桥东区",
            "zip_code" : "130502"
          },
          {
            "id" : "483",
            "name" : "桥西区",
            "zip_code" : "130503"
          },
          {
            "id" : "484",
            "name" : "邢台县",
            "zip_code" : "130521"
          },
          {
            "id" : "485",
            "name" : "临城县",
            "zip_code" : "130522"
          },
          {
            "id" : "486",
            "name" : "内丘县",
            "zip_code" : "130523"
          },
          {
            "id" : "487",
            "name" : "柏乡县",
            "zip_code" : "130524"
          },
          {
            "id" : "488",
            "name" : "隆尧县",
            "zip_code" : "130525"
          },
          {
            "id" : "489",
            "name" : "任县",
            "zip_code" : "130526"
          },
          {
            "id" : "490",
            "name" : "南和县",
            "zip_code" : "130527"
          },
          {
            "id" : "491",
            "name" : "宁晋县",
            "zip_code" : "130528"
          },
          {
            "id" : "492",
            "name" : "巨鹿县",
            "zip_code" : "130529"
          },
          {
            "id" : "493",
            "name" : "新河县",
            "zip_code" : "130530"
          },
          {
            "id" : "494",
            "name" : "广宗县",
            "zip_code" : "130531"
          },
          {
            "id" : "495",
            "name" : "平乡县",
            "zip_code" : "130532"
          },
          {
            "id" : "496",
            "name" : "威县",
            "zip_code" : "130533"
          },
          {
            "id" : "497",
            "name" : "清河县",
            "zip_code" : "130534"
          },
          {
            "id" : "498",
            "name" : "临西县",
            "zip_code" : "130535"
          },
          {
            "id" : "499",
            "name" : "南宫市",
            "zip_code" : "130581"
          },
          {
            "id" : "500",
            "name" : "沙河市",
            "zip_code" : "130582"
          }
        ],
        "name" : "邢台",
        "zip_code" : "130500"
      },
      {
        "id" : "42",
        "areas" : [
          {
            "id" : "501",
            "name" : "市辖区",
            "zip_code" : "130601"
          },
          {
            "id" : "502",
            "name" : "新市区",
            "zip_code" : "130600"
          },
          {
            "id" : "503",
            "name" : "北市区",
            "zip_code" : "130603"
          },
          {
            "id" : "504",
            "name" : "南市区",
            "zip_code" : "130604"
          },
          {
            "id" : "505",
            "name" : "满城县",
            "zip_code" : "130621"
          },
          {
            "id" : "506",
            "name" : "清苑县",
            "zip_code" : "130622"
          },
          {
            "id" : "507",
            "name" : "涞水县",
            "zip_code" : "130623"
          },
          {
            "id" : "508",
            "name" : "阜平县",
            "zip_code" : "130624"
          },
          {
            "id" : "509",
            "name" : "徐水县",
            "zip_code" : "130625"
          },
          {
            "id" : "510",
            "name" : "定兴县",
            "zip_code" : "130626"
          },
          {
            "id" : "511",
            "name" : "唐县",
            "zip_code" : "130627"
          },
          {
            "id" : "512",
            "name" : "高阳县",
            "zip_code" : "130628"
          },
          {
            "id" : "513",
            "name" : "容城县",
            "zip_code" : "130629"
          },
          {
            "id" : "514",
            "name" : "涞源县",
            "zip_code" : "130630"
          },
          {
            "id" : "515",
            "name" : "望都县",
            "zip_code" : "130631"
          },
          {
            "id" : "516",
            "name" : "安新县",
            "zip_code" : "130632"
          },
          {
            "id" : "517",
            "name" : "易县",
            "zip_code" : "130633"
          },
          {
            "id" : "518",
            "name" : "曲阳县",
            "zip_code" : "130634"
          },
          {
            "id" : "519",
            "name" : "蠡县",
            "zip_code" : "130635"
          },
          {
            "id" : "520",
            "name" : "顺平县",
            "zip_code" : "130636"
          },
          {
            "id" : "521",
            "name" : "博野县",
            "zip_code" : "130637"
          },
          {
            "id" : "522",
            "name" : "雄县",
            "zip_code" : "130638"
          },
          {
            "id" : "523",
            "name" : "涿州市",
            "zip_code" : "130681"
          },
          {
            "id" : "524",
            "name" : "定州市",
            "zip_code" : "130682"
          },
          {
            "id" : "525",
            "name" : "安国市",
            "zip_code" : "130683"
          },
          {
            "id" : "526",
            "name" : "高碑店市",
            "zip_code" : "130684"
          }
        ],
        "name" : "保定",
        "zip_code" : "130600"
      },
      {
        "id" : "43",
        "areas" : [
          {
            "id" : "527",
            "name" : "市辖区",
            "zip_code" : "130701"
          },
          {
            "id" : "528",
            "name" : "桥东区",
            "zip_code" : "130702"
          },
          {
            "id" : "529",
            "name" : "桥西区",
            "zip_code" : "130703"
          },
          {
            "id" : "530",
            "name" : "宣化区",
            "zip_code" : "130705"
          },
          {
            "id" : "531",
            "name" : "下花园区",
            "zip_code" : "130706"
          },
          {
            "id" : "532",
            "name" : "宣化县",
            "zip_code" : "130721"
          },
          {
            "id" : "533",
            "name" : "张北县",
            "zip_code" : "130722"
          },
          {
            "id" : "534",
            "name" : "康保县",
            "zip_code" : "130723"
          },
          {
            "id" : "535",
            "name" : "沽源县",
            "zip_code" : "130724"
          },
          {
            "id" : "536",
            "name" : "尚义县",
            "zip_code" : "130725"
          },
          {
            "id" : "537",
            "name" : "蔚县",
            "zip_code" : "130726"
          },
          {
            "id" : "538",
            "name" : "阳原县",
            "zip_code" : "130727"
          },
          {
            "id" : "539",
            "name" : "怀安县",
            "zip_code" : "130728"
          },
          {
            "id" : "540",
            "name" : "万全县",
            "zip_code" : "130729"
          },
          {
            "id" : "541",
            "name" : "怀来县",
            "zip_code" : "130730"
          },
          {
            "id" : "542",
            "name" : "涿鹿县",
            "zip_code" : "130731"
          },
          {
            "id" : "543",
            "name" : "赤城县",
            "zip_code" : "130732"
          },
          {
            "id" : "544",
            "name" : "崇礼县",
            "zip_code" : "130733"
          }
        ],
        "name" : "张家口",
        "zip_code" : "130700"
      },
      {
        "id" : "44",
        "areas" : [
          {
            "id" : "545",
            "name" : "市辖区",
            "zip_code" : "130801"
          },
          {
            "id" : "546",
            "name" : "双桥区",
            "zip_code" : "130802"
          },
          {
            "id" : "547",
            "name" : "双滦区",
            "zip_code" : "130803"
          },
          {
            "id" : "548",
            "name" : "鹰手营子矿区",
            "zip_code" : "130804"
          },
          {
            "id" : "549",
            "name" : "承德县",
            "zip_code" : "130821"
          },
          {
            "id" : "550",
            "name" : "兴隆县",
            "zip_code" : "130822"
          },
          {
            "id" : "551",
            "name" : "平泉县",
            "zip_code" : "130823"
          },
          {
            "id" : "552",
            "name" : "滦平县",
            "zip_code" : "130824"
          },
          {
            "id" : "553",
            "name" : "隆化县",
            "zip_code" : "130825"
          },
          {
            "id" : "554",
            "name" : "丰宁满族自治县",
            "zip_code" : "130826"
          },
          {
            "id" : "555",
            "name" : "宽城满族自治县",
            "zip_code" : "130827"
          },
          {
            "id" : "556",
            "name" : "围场满族蒙古族自治县",
            "zip_code" : "130828"
          }
        ],
        "name" : "承德",
        "zip_code" : "130800"
      },
      {
        "id" : "45",
        "areas" : [
          {
            "id" : "557",
            "name" : "市辖区",
            "zip_code" : "130901"
          },
          {
            "id" : "558",
            "name" : "新华区",
            "zip_code" : "130902"
          },
          {
            "id" : "559",
            "name" : "运河区",
            "zip_code" : "130903"
          },
          {
            "id" : "560",
            "name" : "沧县",
            "zip_code" : "130921"
          },
          {
            "id" : "561",
            "name" : "青县",
            "zip_code" : "130922"
          },
          {
            "id" : "562",
            "name" : "东光县",
            "zip_code" : "130923"
          },
          {
            "id" : "563",
            "name" : "海兴县",
            "zip_code" : "130924"
          },
          {
            "id" : "564",
            "name" : "盐山县",
            "zip_code" : "130925"
          },
          {
            "id" : "565",
            "name" : "肃宁县",
            "zip_code" : "130926"
          },
          {
            "id" : "566",
            "name" : "南皮县",
            "zip_code" : "130927"
          },
          {
            "id" : "567",
            "name" : "吴桥县",
            "zip_code" : "130928"
          },
          {
            "id" : "568",
            "name" : "献县",
            "zip_code" : "130929"
          },
          {
            "id" : "569",
            "name" : "孟村回族自治县",
            "zip_code" : "130930"
          },
          {
            "id" : "570",
            "name" : "泊头市",
            "zip_code" : "130981"
          },
          {
            "id" : "571",
            "name" : "任丘市",
            "zip_code" : "130982"
          },
          {
            "id" : "572",
            "name" : "黄骅市",
            "zip_code" : "130983"
          },
          {
            "id" : "573",
            "name" : "河间市",
            "zip_code" : "130984"
          }
        ],
        "name" : "沧州",
        "zip_code" : "130900"
      },
      {
        "id" : "46",
        "areas" : [
          {
            "id" : "574",
            "name" : "市辖区",
            "zip_code" : "131001"
          },
          {
            "id" : "575",
            "name" : "安次区",
            "zip_code" : "131002"
          },
          {
            "id" : "576",
            "name" : "广阳区",
            "zip_code" : "131003"
          },
          {
            "id" : "577",
            "name" : "固安县",
            "zip_code" : "131022"
          },
          {
            "id" : "578",
            "name" : "永清县",
            "zip_code" : "131023"
          },
          {
            "id" : "579",
            "name" : "香河县",
            "zip_code" : "131024"
          },
          {
            "id" : "580",
            "name" : "大城县",
            "zip_code" : "131025"
          },
          {
            "id" : "581",
            "name" : "文安县",
            "zip_code" : "131026"
          },
          {
            "id" : "582",
            "name" : "大厂回族自治县",
            "zip_code" : "131028"
          },
          {
            "id" : "583",
            "name" : "霸州市",
            "zip_code" : "131081"
          },
          {
            "id" : "584",
            "name" : "三河市",
            "zip_code" : "131082"
          }
        ],
        "name" : "廊坊",
        "zip_code" : "131000"
      },
      {
        "id" : "47",
        "areas" : [
          {
            "id" : "585",
            "name" : "市辖区",
            "zip_code" : "131101"
          },
          {
            "id" : "586",
            "name" : "桃城区",
            "zip_code" : "131102"
          },
          {
            "id" : "587",
            "name" : "枣强县",
            "zip_code" : "131121"
          },
          {
            "id" : "588",
            "name" : "武邑县",
            "zip_code" : "131122"
          },
          {
            "id" : "589",
            "name" : "武强县",
            "zip_code" : "131123"
          },
          {
            "id" : "590",
            "name" : "饶阳县",
            "zip_code" : "131124"
          },
          {
            "id" : "591",
            "name" : "安平县",
            "zip_code" : "131125"
          },
          {
            "id" : "592",
            "name" : "故城县",
            "zip_code" : "131126"
          },
          {
            "id" : "593",
            "name" : "景县",
            "zip_code" : "131127"
          },
          {
            "id" : "594",
            "name" : "阜城县",
            "zip_code" : "131128"
          },
          {
            "id" : "595",
            "name" : "冀州市",
            "zip_code" : "131181"
          },
          {
            "id" : "596",
            "name" : "深州市",
            "zip_code" : "131182"
          }
        ],
        "name" : "衡水",
        "zip_code" : "131100"
      }
    ],
    "id" : "4",
    "name" : "河北",
    "zip_code" : "130000"
  },
  {
    "cities" : [
      {
        "id" : "48",
        "areas" : [
          {
            "id" : "597",
            "name" : "市辖区",
            "zip_code" : "140101"
          },
          {
            "id" : "598",
            "name" : "小店区",
            "zip_code" : "140105"
          },
          {
            "id" : "599",
            "name" : "迎泽区",
            "zip_code" : "140106"
          },
          {
            "id" : "600",
            "name" : "杏花岭区",
            "zip_code" : "140107"
          },
          {
            "id" : "601",
            "name" : "尖草坪区",
            "zip_code" : "140108"
          },
          {
            "id" : "602",
            "name" : "万柏林区",
            "zip_code" : "140109"
          },
          {
            "id" : "603",
            "name" : "晋源区",
            "zip_code" : "140110"
          },
          {
            "id" : "604",
            "name" : "清徐县",
            "zip_code" : "140121"
          },
          {
            "id" : "605",
            "name" : "阳曲县",
            "zip_code" : "140122"
          },
          {
            "id" : "606",
            "name" : "娄烦县",
            "zip_code" : "140123"
          },
          {
            "id" : "607",
            "name" : "古交市",
            "zip_code" : "140181"
          }
        ],
        "name" : "太原",
        "zip_code" : "140100"
      },
      {
        "id" : "49",
        "areas" : [
          {
            "id" : "608",
            "name" : "市辖区",
            "zip_code" : "140201"
          },
          {
            "id" : "609",
            "name" : "城区",
            "zip_code" : "140202"
          },
          {
            "id" : "610",
            "name" : "矿区",
            "zip_code" : "140203"
          },
          {
            "id" : "611",
            "name" : "南郊区",
            "zip_code" : "140211"
          },
          {
            "id" : "612",
            "name" : "新荣区",
            "zip_code" : "140212"
          },
          {
            "id" : "613",
            "name" : "阳高县",
            "zip_code" : "140221"
          },
          {
            "id" : "614",
            "name" : "天镇县",
            "zip_code" : "140222"
          },
          {
            "id" : "615",
            "name" : "广灵县",
            "zip_code" : "140223"
          },
          {
            "id" : "616",
            "name" : "灵丘县",
            "zip_code" : "140224"
          },
          {
            "id" : "617",
            "name" : "浑源县",
            "zip_code" : "140225"
          },
          {
            "id" : "618",
            "name" : "左云县",
            "zip_code" : "140226"
          },
          {
            "id" : "619",
            "name" : "大同县",
            "zip_code" : "140227"
          }
        ],
        "name" : "大同",
        "zip_code" : "140200"
      },
      {
        "id" : "50",
        "areas" : [
          {
            "id" : "620",
            "name" : "市辖区",
            "zip_code" : "140301"
          },
          {
            "id" : "621",
            "name" : "城区",
            "zip_code" : "140302"
          },
          {
            "id" : "622",
            "name" : "矿区",
            "zip_code" : "140303"
          },
          {
            "id" : "623",
            "name" : "郊区",
            "zip_code" : "140311"
          },
          {
            "id" : "624",
            "name" : "平定县",
            "zip_code" : "140321"
          },
          {
            "id" : "625",
            "name" : "盂县",
            "zip_code" : "140322"
          }
        ],
        "name" : "阳泉",
        "zip_code" : "140300"
      },
      {
        "id" : "51",
        "areas" : [
          {
            "id" : "626",
            "name" : "市辖区",
            "zip_code" : "140401"
          },
          {
            "id" : "627",
            "name" : "城区",
            "zip_code" : "140402"
          },
          {
            "id" : "628",
            "name" : "郊区",
            "zip_code" : "140411"
          },
          {
            "id" : "629",
            "name" : "长治县",
            "zip_code" : "140421"
          },
          {
            "id" : "630",
            "name" : "襄垣县",
            "zip_code" : "140423"
          },
          {
            "id" : "631",
            "name" : "屯留县",
            "zip_code" : "140424"
          },
          {
            "id" : "632",
            "name" : "平顺县",
            "zip_code" : "140425"
          },
          {
            "id" : "633",
            "name" : "黎城县",
            "zip_code" : "140426"
          },
          {
            "id" : "634",
            "name" : "壶关县",
            "zip_code" : "140427"
          },
          {
            "id" : "635",
            "name" : "长子县",
            "zip_code" : "140428"
          },
          {
            "id" : "636",
            "name" : "武乡县",
            "zip_code" : "140429"
          },
          {
            "id" : "637",
            "name" : "沁县",
            "zip_code" : "140430"
          },
          {
            "id" : "638",
            "name" : "沁源县",
            "zip_code" : "140431"
          },
          {
            "id" : "639",
            "name" : "潞城市",
            "zip_code" : "140481"
          }
        ],
        "name" : "长治",
        "zip_code" : "140400"
      },
      {
        "id" : "52",
        "areas" : [
          {
            "id" : "640",
            "name" : "市辖区",
            "zip_code" : "140501"
          },
          {
            "id" : "641",
            "name" : "城区",
            "zip_code" : "140502"
          },
          {
            "id" : "642",
            "name" : "沁水县",
            "zip_code" : "140521"
          },
          {
            "id" : "643",
            "name" : "阳城县",
            "zip_code" : "140522"
          },
          {
            "id" : "644",
            "name" : "陵川县",
            "zip_code" : "140524"
          },
          {
            "id" : "645",
            "name" : "泽州县",
            "zip_code" : "140525"
          },
          {
            "id" : "646",
            "name" : "高平市",
            "zip_code" : "140581"
          }
        ],
        "name" : "晋城",
        "zip_code" : "140500"
      },
      {
        "id" : "53",
        "areas" : [
          {
            "id" : "647",
            "name" : "市辖区",
            "zip_code" : "140601"
          },
          {
            "id" : "648",
            "name" : "朔城区",
            "zip_code" : "140602"
          },
          {
            "id" : "649",
            "name" : "平鲁区",
            "zip_code" : "140603"
          },
          {
            "id" : "650",
            "name" : "山阴县",
            "zip_code" : "140621"
          },
          {
            "id" : "651",
            "name" : "应县",
            "zip_code" : "140622"
          },
          {
            "id" : "652",
            "name" : "右玉县",
            "zip_code" : "140623"
          },
          {
            "id" : "653",
            "name" : "怀仁县",
            "zip_code" : "140624"
          }
        ],
        "name" : "朔州",
        "zip_code" : "140600"
      },
      {
        "id" : "54",
        "areas" : [
          {
            "id" : "654",
            "name" : "市辖区",
            "zip_code" : "140701"
          },
          {
            "id" : "655",
            "name" : "榆次区",
            "zip_code" : "140702"
          },
          {
            "id" : "656",
            "name" : "榆社县",
            "zip_code" : "140721"
          },
          {
            "id" : "657",
            "name" : "左权县",
            "zip_code" : "140722"
          },
          {
            "id" : "658",
            "name" : "和顺县",
            "zip_code" : "140723"
          },
          {
            "id" : "659",
            "name" : "昔阳县",
            "zip_code" : "140724"
          },
          {
            "id" : "660",
            "name" : "寿阳县",
            "zip_code" : "140725"
          },
          {
            "id" : "661",
            "name" : "太谷县",
            "zip_code" : "140726"
          },
          {
            "id" : "662",
            "name" : "祁县",
            "zip_code" : "140727"
          },
          {
            "id" : "663",
            "name" : "平遥县",
            "zip_code" : "140728"
          },
          {
            "id" : "664",
            "name" : "灵石县",
            "zip_code" : "140729"
          },
          {
            "id" : "665",
            "name" : "介休市",
            "zip_code" : "140781"
          }
        ],
        "name" : "晋中",
        "zip_code" : "140700"
      },
      {
        "id" : "55",
        "areas" : [
          {
            "id" : "666",
            "name" : "市辖区",
            "zip_code" : "140801"
          },
          {
            "id" : "667",
            "name" : "盐湖区",
            "zip_code" : "140802"
          },
          {
            "id" : "668",
            "name" : "临猗县",
            "zip_code" : "140821"
          },
          {
            "id" : "669",
            "name" : "万荣县",
            "zip_code" : "140822"
          },
          {
            "id" : "670",
            "name" : "闻喜县",
            "zip_code" : "140823"
          },
          {
            "id" : "671",
            "name" : "稷山县",
            "zip_code" : "140824"
          },
          {
            "id" : "672",
            "name" : "新绛县",
            "zip_code" : "140825"
          },
          {
            "id" : "673",
            "name" : "绛县",
            "zip_code" : "140826"
          },
          {
            "id" : "674",
            "name" : "垣曲县",
            "zip_code" : "140827"
          },
          {
            "id" : "675",
            "name" : "夏县",
            "zip_code" : "140828"
          },
          {
            "id" : "676",
            "name" : "平陆县",
            "zip_code" : "140829"
          },
          {
            "id" : "677",
            "name" : "芮城县",
            "zip_code" : "140830"
          },
          {
            "id" : "678",
            "name" : "永济市",
            "zip_code" : "140881"
          },
          {
            "id" : "679",
            "name" : "河津市",
            "zip_code" : "140882"
          }
        ],
        "name" : "运城",
        "zip_code" : "140800"
      },
      {
        "id" : "56",
        "areas" : [
          {
            "id" : "680",
            "name" : "市辖区",
            "zip_code" : "140901"
          },
          {
            "id" : "681",
            "name" : "忻府区",
            "zip_code" : "140902"
          },
          {
            "id" : "682",
            "name" : "定襄县",
            "zip_code" : "140921"
          },
          {
            "id" : "683",
            "name" : "五台县",
            "zip_code" : "140922"
          },
          {
            "id" : "684",
            "name" : "代县",
            "zip_code" : "140923"
          },
          {
            "id" : "685",
            "name" : "繁峙县",
            "zip_code" : "140924"
          },
          {
            "id" : "686",
            "name" : "宁武县",
            "zip_code" : "140925"
          },
          {
            "id" : "687",
            "name" : "静乐县",
            "zip_code" : "140926"
          },
          {
            "id" : "688",
            "name" : "神池县",
            "zip_code" : "140927"
          },
          {
            "id" : "689",
            "name" : "五寨县",
            "zip_code" : "140928"
          },
          {
            "id" : "690",
            "name" : "岢岚县",
            "zip_code" : "140929"
          },
          {
            "id" : "691",
            "name" : "河曲县",
            "zip_code" : "140930"
          },
          {
            "id" : "692",
            "name" : "保德县",
            "zip_code" : "140931"
          },
          {
            "id" : "693",
            "name" : "偏关县",
            "zip_code" : "140932"
          },
          {
            "id" : "694",
            "name" : "原平市",
            "zip_code" : "140981"
          }
        ],
        "name" : "忻州",
        "zip_code" : "140900"
      },
      {
        "id" : "57",
        "areas" : [
          {
            "id" : "695",
            "name" : "市辖区",
            "zip_code" : "141001"
          },
          {
            "id" : "696",
            "name" : "尧都区",
            "zip_code" : "141002"
          },
          {
            "id" : "697",
            "name" : "曲沃县",
            "zip_code" : "141021"
          },
          {
            "id" : "698",
            "name" : "翼城县",
            "zip_code" : "141022"
          },
          {
            "id" : "699",
            "name" : "襄汾县",
            "zip_code" : "141023"
          },
          {
            "id" : "700",
            "name" : "洪洞县",
            "zip_code" : "141024"
          },
          {
            "id" : "701",
            "name" : "古县",
            "zip_code" : "141025"
          },
          {
            "id" : "702",
            "name" : "安泽县",
            "zip_code" : "141026"
          },
          {
            "id" : "703",
            "name" : "浮山县",
            "zip_code" : "141027"
          },
          {
            "id" : "704",
            "name" : "吉县",
            "zip_code" : "141028"
          },
          {
            "id" : "705",
            "name" : "乡宁县",
            "zip_code" : "141029"
          },
          {
            "id" : "706",
            "name" : "大宁县",
            "zip_code" : "141030"
          },
          {
            "id" : "707",
            "name" : "隰县",
            "zip_code" : "141031"
          },
          {
            "id" : "708",
            "name" : "永和县",
            "zip_code" : "141032"
          },
          {
            "id" : "709",
            "name" : "蒲县",
            "zip_code" : "141033"
          },
          {
            "id" : "710",
            "name" : "汾西县",
            "zip_code" : "141034"
          },
          {
            "id" : "711",
            "name" : "侯马市",
            "zip_code" : "141081"
          },
          {
            "id" : "712",
            "name" : "霍州市",
            "zip_code" : "141082"
          }
        ],
        "name" : "临汾",
        "zip_code" : "141000"
      },
      {
        "id" : "58",
        "areas" : [
          {
            "id" : "713",
            "name" : "市辖区",
            "zip_code" : "141101"
          },
          {
            "id" : "714",
            "name" : "离石区",
            "zip_code" : "141102"
          },
          {
            "id" : "715",
            "name" : "文水县",
            "zip_code" : "141121"
          },
          {
            "id" : "716",
            "name" : "交城县",
            "zip_code" : "141122"
          },
          {
            "id" : "717",
            "name" : "兴县",
            "zip_code" : "141123"
          },
          {
            "id" : "718",
            "name" : "临县",
            "zip_code" : "141124"
          },
          {
            "id" : "719",
            "name" : "柳林县",
            "zip_code" : "141125"
          },
          {
            "id" : "720",
            "name" : "石楼县",
            "zip_code" : "141126"
          },
          {
            "id" : "721",
            "name" : "岚县",
            "zip_code" : "141127"
          },
          {
            "id" : "722",
            "name" : "方山县",
            "zip_code" : "141128"
          },
          {
            "id" : "723",
            "name" : "中阳县",
            "zip_code" : "141129"
          },
          {
            "id" : "724",
            "name" : "交口县",
            "zip_code" : "141130"
          },
          {
            "id" : "725",
            "name" : "孝义市",
            "zip_code" : "141181"
          },
          {
            "id" : "726",
            "name" : "汾阳市",
            "zip_code" : "141182"
          }
        ],
        "name" : "吕梁",
        "zip_code" : "141100"
      }
    ],
    "id" : "5",
    "name" : "山西",
    "zip_code" : "140000"
  },
  {
    "cities" : [
      {
        "id" : "59",
        "areas" : [
          {
            "id" : "727",
            "name" : "市辖区",
            "zip_code" : "150101"
          },
          {
            "id" : "728",
            "name" : "新城区",
            "zip_code" : "150102"
          },
          {
            "id" : "729",
            "name" : "回民区",
            "zip_code" : "150103"
          },
          {
            "id" : "730",
            "name" : "玉泉区",
            "zip_code" : "150104"
          },
          {
            "id" : "731",
            "name" : "赛罕区",
            "zip_code" : "150105"
          },
          {
            "id" : "732",
            "name" : "土默特左旗",
            "zip_code" : "150121"
          },
          {
            "id" : "733",
            "name" : "托克托县",
            "zip_code" : "150122"
          },
          {
            "id" : "734",
            "name" : "和林格尔县",
            "zip_code" : "150123"
          },
          {
            "id" : "735",
            "name" : "清水河县",
            "zip_code" : "150124"
          },
          {
            "id" : "736",
            "name" : "武川县",
            "zip_code" : "150125"
          }
        ],
        "name" : "呼和浩特",
        "zip_code" : "150100"
      },
      {
        "id" : "60",
        "areas" : [
          {
            "id" : "737",
            "name" : "市辖区",
            "zip_code" : "150201"
          },
          {
            "id" : "738",
            "name" : "东河区",
            "zip_code" : "150202"
          },
          {
            "id" : "739",
            "name" : "昆都仑区",
            "zip_code" : "150203"
          },
          {
            "id" : "740",
            "name" : "青山区",
            "zip_code" : "150204"
          },
          {
            "id" : "741",
            "name" : "石拐区",
            "zip_code" : "150205"
          },
          {
            "id" : "742",
            "name" : "白云鄂博矿区",
            "zip_code" : "150206"
          },
          {
            "id" : "743",
            "name" : "九原区",
            "zip_code" : "150207"
          },
          {
            "id" : "744",
            "name" : "土默特右旗",
            "zip_code" : "150221"
          },
          {
            "id" : "745",
            "name" : "固阳县",
            "zip_code" : "150222"
          },
          {
            "id" : "746",
            "name" : "达尔罕茂明安联合旗",
            "zip_code" : "150223"
          }
        ],
        "name" : "包头",
        "zip_code" : "150200"
      },
      {
        "id" : "61",
        "areas" : [
          {
            "id" : "747",
            "name" : "市辖区",
            "zip_code" : "150301"
          },
          {
            "id" : "748",
            "name" : "海勃湾区",
            "zip_code" : "150302"
          },
          {
            "id" : "749",
            "name" : "海南区",
            "zip_code" : "150303"
          },
          {
            "id" : "750",
            "name" : "乌达区",
            "zip_code" : "150304"
          }
        ],
        "name" : "乌海",
        "zip_code" : "150300"
      },
      {
        "id" : "62",
        "areas" : [
          {
            "id" : "751",
            "name" : "市辖区",
            "zip_code" : "150401"
          },
          {
            "id" : "752",
            "name" : "红山区",
            "zip_code" : "150402"
          },
          {
            "id" : "753",
            "name" : "元宝山区",
            "zip_code" : "150403"
          },
          {
            "id" : "754",
            "name" : "松山区",
            "zip_code" : "150404"
          },
          {
            "id" : "755",
            "name" : "阿鲁科尔沁旗",
            "zip_code" : "150421"
          },
          {
            "id" : "756",
            "name" : "巴林左旗",
            "zip_code" : "150422"
          },
          {
            "id" : "757",
            "name" : "巴林右旗",
            "zip_code" : "150423"
          },
          {
            "id" : "758",
            "name" : "林西县",
            "zip_code" : "150424"
          },
          {
            "id" : "759",
            "name" : "克什克腾旗",
            "zip_code" : "150425"
          },
          {
            "id" : "760",
            "name" : "翁牛特旗",
            "zip_code" : "150426"
          },
          {
            "id" : "761",
            "name" : "喀喇沁旗",
            "zip_code" : "150428"
          },
          {
            "id" : "762",
            "name" : "宁城县",
            "zip_code" : "150429"
          },
          {
            "id" : "763",
            "name" : "敖汉旗",
            "zip_code" : "150430"
          }
        ],
        "name" : "赤峰",
        "zip_code" : "150400"
      },
      {
        "id" : "63",
        "areas" : [
          {
            "id" : "764",
            "name" : "市辖区",
            "zip_code" : "150501"
          },
          {
            "id" : "765",
            "name" : "科尔沁区",
            "zip_code" : "150502"
          },
          {
            "id" : "766",
            "name" : "科尔沁左翼中旗",
            "zip_code" : "150521"
          },
          {
            "id" : "767",
            "name" : "科尔沁左翼后旗",
            "zip_code" : "150522"
          },
          {
            "id" : "768",
            "name" : "开鲁县",
            "zip_code" : "150523"
          },
          {
            "id" : "769",
            "name" : "库伦旗",
            "zip_code" : "150524"
          },
          {
            "id" : "770",
            "name" : "奈曼旗",
            "zip_code" : "150525"
          },
          {
            "id" : "771",
            "name" : "扎鲁特旗",
            "zip_code" : "150526"
          },
          {
            "id" : "772",
            "name" : "霍林郭勒市",
            "zip_code" : "150581"
          }
        ],
        "name" : "通辽",
        "zip_code" : "150500"
      },
      {
        "id" : "64",
        "areas" : [
          {
            "id" : "773",
            "name" : "东胜区",
            "zip_code" : "150602"
          },
          {
            "id" : "774",
            "name" : "达拉特旗",
            "zip_code" : "150621"
          },
          {
            "id" : "775",
            "name" : "准格尔旗",
            "zip_code" : "150622"
          },
          {
            "id" : "776",
            "name" : "鄂托克前旗",
            "zip_code" : "150623"
          },
          {
            "id" : "777",
            "name" : "鄂托克旗",
            "zip_code" : "150624"
          },
          {
            "id" : "778",
            "name" : "杭锦旗",
            "zip_code" : "150625"
          },
          {
            "id" : "779",
            "name" : "乌审旗",
            "zip_code" : "150626"
          },
          {
            "id" : "780",
            "name" : "伊金霍洛旗",
            "zip_code" : "150627"
          }
        ],
        "name" : "鄂尔多斯",
        "zip_code" : "150600"
      },
      {
        "id" : "65",
        "areas" : [
          {
            "id" : "781",
            "name" : "市辖区",
            "zip_code" : "150701"
          },
          {
            "id" : "782",
            "name" : "海拉尔区",
            "zip_code" : "150702"
          },
          {
            "id" : "783",
            "name" : "阿荣旗",
            "zip_code" : "150721"
          },
          {
            "id" : "784",
            "name" : "莫力达瓦达斡尔族自治旗",
            "zip_code" : "150722"
          },
          {
            "id" : "785",
            "name" : "鄂伦春自治旗",
            "zip_code" : "150723"
          },
          {
            "id" : "786",
            "name" : "鄂温克族自治旗",
            "zip_code" : "150724"
          },
          {
            "id" : "787",
            "name" : "陈巴尔虎旗",
            "zip_code" : "150725"
          },
          {
            "id" : "788",
            "name" : "新巴尔虎左旗",
            "zip_code" : "150726"
          },
          {
            "id" : "789",
            "name" : "新巴尔虎右旗",
            "zip_code" : "150727"
          },
          {
            "id" : "790",
            "name" : "满洲里市",
            "zip_code" : "150781"
          },
          {
            "id" : "791",
            "name" : "牙克石市",
            "zip_code" : "150782"
          },
          {
            "id" : "792",
            "name" : "扎兰屯市",
            "zip_code" : "150783"
          },
          {
            "id" : "793",
            "name" : "额尔古纳市",
            "zip_code" : "150784"
          },
          {
            "id" : "794",
            "name" : "根河市",
            "zip_code" : "150785"
          }
        ],
        "name" : "呼伦贝尔",
        "zip_code" : "150700"
      },
      {
        "id" : "66",
        "areas" : [
          {
            "id" : "795",
            "name" : "市辖区",
            "zip_code" : "150801"
          },
          {
            "id" : "796",
            "name" : "临河区",
            "zip_code" : "150802"
          },
          {
            "id" : "797",
            "name" : "五原县",
            "zip_code" : "150821"
          },
          {
            "id" : "798",
            "name" : "磴口县",
            "zip_code" : "150822"
          },
          {
            "id" : "799",
            "name" : "乌拉特前旗",
            "zip_code" : "150823"
          },
          {
            "id" : "800",
            "name" : "乌拉特中旗",
            "zip_code" : "150824"
          },
          {
            "id" : "801",
            "name" : "乌拉特后旗",
            "zip_code" : "150825"
          },
          {
            "id" : "802",
            "name" : "杭锦后旗",
            "zip_code" : "150826"
          }
        ],
        "name" : "巴彦淖尔",
        "zip_code" : "150800"
      },
      {
        "id" : "67",
        "areas" : [
          {
            "id" : "803",
            "name" : "市辖区",
            "zip_code" : "150901"
          },
          {
            "id" : "804",
            "name" : "集宁区",
            "zip_code" : "150902"
          },
          {
            "id" : "805",
            "name" : "卓资县",
            "zip_code" : "150921"
          },
          {
            "id" : "806",
            "name" : "化德县",
            "zip_code" : "150922"
          },
          {
            "id" : "807",
            "name" : "商都县",
            "zip_code" : "150923"
          },
          {
            "id" : "808",
            "name" : "兴和县",
            "zip_code" : "150924"
          },
          {
            "id" : "809",
            "name" : "凉城县",
            "zip_code" : "150925"
          },
          {
            "id" : "810",
            "name" : "察哈尔右翼前旗",
            "zip_code" : "150926"
          },
          {
            "id" : "811",
            "name" : "察哈尔右翼中旗",
            "zip_code" : "150927"
          },
          {
            "id" : "812",
            "name" : "察哈尔右翼后旗",
            "zip_code" : "150928"
          },
          {
            "id" : "813",
            "name" : "四子王旗",
            "zip_code" : "150929"
          },
          {
            "id" : "814",
            "name" : "丰镇市",
            "zip_code" : "150981"
          }
        ],
        "name" : "乌兰察布",
        "zip_code" : "150900"
      },
      {
        "id" : "68",
        "areas" : [
          {
            "id" : "815",
            "name" : "乌兰浩特市",
            "zip_code" : "152201"
          },
          {
            "id" : "816",
            "name" : "阿尔山市",
            "zip_code" : "152202"
          },
          {
            "id" : "817",
            "name" : "科尔沁右翼前旗",
            "zip_code" : "152221"
          },
          {
            "id" : "818",
            "name" : "科尔沁右翼中旗",
            "zip_code" : "152222"
          },
          {
            "id" : "819",
            "name" : "扎赉特旗",
            "zip_code" : "152223"
          },
          {
            "id" : "820",
            "name" : "突泉县",
            "zip_code" : "152224"
          }
        ],
        "name" : "兴安盟",
        "zip_code" : "152200"
      },
      {
        "id" : "69",
        "areas" : [
          {
            "id" : "821",
            "name" : "二连浩特市",
            "zip_code" : "152501"
          },
          {
            "id" : "822",
            "name" : "锡林浩特市",
            "zip_code" : "152502"
          },
          {
            "id" : "823",
            "name" : "阿巴嘎旗",
            "zip_code" : "152522"
          },
          {
            "id" : "824",
            "name" : "苏尼特左旗",
            "zip_code" : "152523"
          },
          {
            "id" : "825",
            "name" : "苏尼特右旗",
            "zip_code" : "152524"
          },
          {
            "id" : "826",
            "name" : "东乌珠穆沁旗",
            "zip_code" : "152525"
          },
          {
            "id" : "827",
            "name" : "西乌珠穆沁旗",
            "zip_code" : "152526"
          },
          {
            "id" : "828",
            "name" : "太仆寺旗",
            "zip_code" : "152527"
          },
          {
            "id" : "829",
            "name" : "镶黄旗",
            "zip_code" : "152528"
          },
          {
            "id" : "830",
            "name" : "正镶白旗",
            "zip_code" : "152529"
          },
          {
            "id" : "831",
            "name" : "正蓝旗",
            "zip_code" : "152530"
          },
          {
            "id" : "832",
            "name" : "多伦县",
            "zip_code" : "152531"
          }
        ],
        "name" : "锡林郭勒盟",
        "zip_code" : "152500"
      },
      {
        "id" : "70",
        "areas" : [
          {
            "id" : "833",
            "name" : "阿拉善左旗",
            "zip_code" : "152921"
          },
          {
            "id" : "834",
            "name" : "阿拉善右旗",
            "zip_code" : "152922"
          },
          {
            "id" : "835",
            "name" : "额济纳旗",
            "zip_code" : "152923"
          }
        ],
        "name" : "阿拉善盟",
        "zip_code" : "152900"
      }
    ],
    "id" : "6",
    "name" : "内蒙古自治区",
    "zip_code" : "150000"
  },
  {
    "cities" : [
      {
        "id" : "71",
        "areas" : [
          {
            "id" : "836",
            "name" : "市辖区",
            "zip_code" : "210101"
          },
          {
            "id" : "837",
            "name" : "和平区",
            "zip_code" : "210102"
          },
          {
            "id" : "838",
            "name" : "沈河区",
            "zip_code" : "210103"
          },
          {
            "id" : "839",
            "name" : "大东区",
            "zip_code" : "210104"
          },
          {
            "id" : "840",
            "name" : "皇姑区",
            "zip_code" : "210105"
          },
          {
            "id" : "841",
            "name" : "铁西区",
            "zip_code" : "210106"
          },
          {
            "id" : "842",
            "name" : "苏家屯区",
            "zip_code" : "210111"
          },
          {
            "id" : "843",
            "name" : "东陵区",
            "zip_code" : "210112"
          },
          {
            "id" : "844",
            "name" : "沈北新区",
            "zip_code" : "210113"
          },
          {
            "id" : "845",
            "name" : "于洪区",
            "zip_code" : "210114"
          },
          {
            "id" : "846",
            "name" : "辽中县",
            "zip_code" : "210122"
          },
          {
            "id" : "847",
            "name" : "康平县",
            "zip_code" : "210123"
          },
          {
            "id" : "848",
            "name" : "法库县",
            "zip_code" : "210124"
          },
          {
            "id" : "849",
            "name" : "新民市",
            "zip_code" : "210181"
          }
        ],
        "name" : "沈阳",
        "zip_code" : "210100"
      },
      {
        "id" : "72",
        "areas" : [
          {
            "id" : "850",
            "name" : "市辖区",
            "zip_code" : "210201"
          },
          {
            "id" : "851",
            "name" : "中山区",
            "zip_code" : "210202"
          },
          {
            "id" : "852",
            "name" : "西岗区",
            "zip_code" : "210203"
          },
          {
            "id" : "853",
            "name" : "沙河口区",
            "zip_code" : "210204"
          },
          {
            "id" : "854",
            "name" : "甘井子区",
            "zip_code" : "210211"
          },
          {
            "id" : "855",
            "name" : "旅顺口区",
            "zip_code" : "210212"
          },
          {
            "id" : "856",
            "name" : "金州区",
            "zip_code" : "210213"
          },
          {
            "id" : "857",
            "name" : "长海县",
            "zip_code" : "210224"
          },
          {
            "id" : "858",
            "name" : "瓦房店市",
            "zip_code" : "210281"
          },
          {
            "id" : "859",
            "name" : "普兰店市",
            "zip_code" : "210282"
          },
          {
            "id" : "860",
            "name" : "庄河市",
            "zip_code" : "210283"
          }
        ],
        "name" : "大连",
        "zip_code" : "210200"
      },
      {
        "id" : "73",
        "areas" : [
          {
            "id" : "861",
            "name" : "市辖区",
            "zip_code" : "210301"
          },
          {
            "id" : "862",
            "name" : "铁东区",
            "zip_code" : "210302"
          },
          {
            "id" : "863",
            "name" : "铁西区",
            "zip_code" : "210303"
          },
          {
            "id" : "864",
            "name" : "立山区",
            "zip_code" : "210304"
          },
          {
            "id" : "865",
            "name" : "千山区",
            "zip_code" : "210311"
          },
          {
            "id" : "866",
            "name" : "台安县",
            "zip_code" : "210321"
          },
          {
            "id" : "867",
            "name" : "岫岩满族自治县",
            "zip_code" : "210323"
          },
          {
            "id" : "868",
            "name" : "海城市",
            "zip_code" : "210381"
          }
        ],
        "name" : "鞍山",
        "zip_code" : "210300"
      },
      {
        "id" : "74",
        "areas" : [
          {
            "id" : "869",
            "name" : "市辖区",
            "zip_code" : "210401"
          },
          {
            "id" : "870",
            "name" : "新抚区",
            "zip_code" : "210402"
          },
          {
            "id" : "871",
            "name" : "东洲区",
            "zip_code" : "210403"
          },
          {
            "id" : "872",
            "name" : "望花区",
            "zip_code" : "210404"
          },
          {
            "id" : "873",
            "name" : "顺城区",
            "zip_code" : "210411"
          },
          {
            "id" : "874",
            "name" : "抚顺县",
            "zip_code" : "210421"
          },
          {
            "id" : "875",
            "name" : "新宾满族自治县",
            "zip_code" : "210422"
          },
          {
            "id" : "876",
            "name" : "清原满族自治县",
            "zip_code" : "210423"
          }
        ],
        "name" : "抚顺",
        "zip_code" : "210400"
      },
      {
        "id" : "75",
        "areas" : [
          {
            "id" : "877",
            "name" : "市辖区",
            "zip_code" : "210501"
          },
          {
            "id" : "878",
            "name" : "平山区",
            "zip_code" : "210502"
          },
          {
            "id" : "879",
            "name" : "溪湖区",
            "zip_code" : "210503"
          },
          {
            "id" : "880",
            "name" : "明山区",
            "zip_code" : "210504"
          },
          {
            "id" : "881",
            "name" : "南芬区",
            "zip_code" : "210505"
          },
          {
            "id" : "882",
            "name" : "本溪满族自治县",
            "zip_code" : "210521"
          },
          {
            "id" : "883",
            "name" : "桓仁满族自治县",
            "zip_code" : "210522"
          }
        ],
        "name" : "本溪",
        "zip_code" : "210500"
      },
      {
        "id" : "76",
        "areas" : [
          {
            "id" : "884",
            "name" : "市辖区",
            "zip_code" : "210601"
          },
          {
            "id" : "885",
            "name" : "元宝区",
            "zip_code" : "210602"
          },
          {
            "id" : "886",
            "name" : "振兴区",
            "zip_code" : "210603"
          },
          {
            "id" : "887",
            "name" : "振安区",
            "zip_code" : "210604"
          },
          {
            "id" : "888",
            "name" : "宽甸满族自治县",
            "zip_code" : "210624"
          },
          {
            "id" : "889",
            "name" : "东港市",
            "zip_code" : "210681"
          },
          {
            "id" : "890",
            "name" : "凤城市",
            "zip_code" : "210682"
          }
        ],
        "name" : "丹东",
        "zip_code" : "210600"
      },
      {
        "id" : "77",
        "areas" : [
          {
            "id" : "891",
            "name" : "市辖区",
            "zip_code" : "210701"
          },
          {
            "id" : "892",
            "name" : "古塔区",
            "zip_code" : "210702"
          },
          {
            "id" : "893",
            "name" : "凌河区",
            "zip_code" : "210703"
          },
          {
            "id" : "894",
            "name" : "太和区",
            "zip_code" : "210711"
          },
          {
            "id" : "895",
            "name" : "黑山县",
            "zip_code" : "210726"
          },
          {
            "id" : "896",
            "name" : "义县",
            "zip_code" : "210727"
          },
          {
            "id" : "897",
            "name" : "凌海市",
            "zip_code" : "210781"
          },
          {
            "id" : "898",
            "name" : "北镇市",
            "zip_code" : "210782"
          }
        ],
        "name" : "锦州",
        "zip_code" : "210700"
      },
      {
        "id" : "78",
        "areas" : [
          {
            "id" : "899",
            "name" : "市辖区",
            "zip_code" : "210801"
          },
          {
            "id" : "900",
            "name" : "站前区",
            "zip_code" : "210802"
          },
          {
            "id" : "901",
            "name" : "西市区",
            "zip_code" : "210803"
          },
          {
            "id" : "902",
            "name" : "鲅鱼圈区",
            "zip_code" : "210804"
          },
          {
            "id" : "903",
            "name" : "老边区",
            "zip_code" : "210811"
          },
          {
            "id" : "904",
            "name" : "盖州市",
            "zip_code" : "210881"
          },
          {
            "id" : "905",
            "name" : "大石桥市",
            "zip_code" : "210882"
          }
        ],
        "name" : "营口",
        "zip_code" : "210800"
      },
      {
        "id" : "79",
        "areas" : [
          {
            "id" : "906",
            "name" : "市辖区",
            "zip_code" : "210901"
          },
          {
            "id" : "907",
            "name" : "海州区",
            "zip_code" : "210902"
          },
          {
            "id" : "908",
            "name" : "新邱区",
            "zip_code" : "210903"
          },
          {
            "id" : "909",
            "name" : "太平区",
            "zip_code" : "210904"
          },
          {
            "id" : "910",
            "name" : "清河门区",
            "zip_code" : "210905"
          },
          {
            "id" : "911",
            "name" : "细河区",
            "zip_code" : "210911"
          },
          {
            "id" : "912",
            "name" : "阜新蒙古族自治县",
            "zip_code" : "210921"
          },
          {
            "id" : "913",
            "name" : "彰武县",
            "zip_code" : "210922"
          }
        ],
        "name" : "阜新",
        "zip_code" : "210900"
      },
      {
        "id" : "80",
        "areas" : [
          {
            "id" : "914",
            "name" : "市辖区",
            "zip_code" : "211001"
          },
          {
            "id" : "915",
            "name" : "白塔区",
            "zip_code" : "211002"
          },
          {
            "id" : "916",
            "name" : "文圣区",
            "zip_code" : "211003"
          },
          {
            "id" : "917",
            "name" : "宏伟区",
            "zip_code" : "211004"
          },
          {
            "id" : "918",
            "name" : "弓长岭区",
            "zip_code" : "211005"
          },
          {
            "id" : "919",
            "name" : "太子河区",
            "zip_code" : "211011"
          },
          {
            "id" : "920",
            "name" : "辽阳县",
            "zip_code" : "211021"
          },
          {
            "id" : "921",
            "name" : "灯塔市",
            "zip_code" : "211081"
          }
        ],
        "name" : "辽阳",
        "zip_code" : "211000"
      },
      {
        "id" : "81",
        "areas" : [
          {
            "id" : "922",
            "name" : "市辖区",
            "zip_code" : "211101"
          },
          {
            "id" : "923",
            "name" : "双台子区",
            "zip_code" : "211102"
          },
          {
            "id" : "924",
            "name" : "兴隆台区",
            "zip_code" : "211103"
          },
          {
            "id" : "925",
            "name" : "大洼县",
            "zip_code" : "211121"
          },
          {
            "id" : "926",
            "name" : "盘山县",
            "zip_code" : "211122"
          }
        ],
        "name" : "盘锦",
        "zip_code" : "211100"
      },
      {
        "id" : "82",
        "areas" : [
          {
            "id" : "927",
            "name" : "市辖区",
            "zip_code" : "211201"
          },
          {
            "id" : "928",
            "name" : "银州区",
            "zip_code" : "211202"
          },
          {
            "id" : "929",
            "name" : "清河区",
            "zip_code" : "211204"
          },
          {
            "id" : "930",
            "name" : "铁岭县",
            "zip_code" : "211221"
          },
          {
            "id" : "931",
            "name" : "西丰县",
            "zip_code" : "211223"
          },
          {
            "id" : "932",
            "name" : "昌图县",
            "zip_code" : "211224"
          },
          {
            "id" : "933",
            "name" : "调兵山市",
            "zip_code" : "211281"
          },
          {
            "id" : "934",
            "name" : "开原市",
            "zip_code" : "211282"
          }
        ],
        "name" : "铁岭",
        "zip_code" : "211200"
      },
      {
        "id" : "83",
        "areas" : [
          {
            "id" : "935",
            "name" : "市辖区",
            "zip_code" : "211301"
          },
          {
            "id" : "936",
            "name" : "双塔区",
            "zip_code" : "211302"
          },
          {
            "id" : "937",
            "name" : "龙城区",
            "zip_code" : "211303"
          },
          {
            "id" : "938",
            "name" : "朝阳县",
            "zip_code" : "211321"
          },
          {
            "id" : "939",
            "name" : "建平县",
            "zip_code" : "211322"
          },
          {
            "id" : "940",
            "name" : "喀喇沁左翼蒙古族自治县",
            "zip_code" : "211324"
          },
          {
            "id" : "941",
            "name" : "北票市",
            "zip_code" : "211381"
          },
          {
            "id" : "942",
            "name" : "凌源市",
            "zip_code" : "211382"
          }
        ],
        "name" : "朝阳",
        "zip_code" : "211300"
      },
      {
        "id" : "84",
        "areas" : [
          {
            "id" : "943",
            "name" : "市辖区",
            "zip_code" : "211401"
          },
          {
            "id" : "944",
            "name" : "连山区",
            "zip_code" : "211402"
          },
          {
            "id" : "945",
            "name" : "龙港区",
            "zip_code" : "211403"
          },
          {
            "id" : "946",
            "name" : "南票区",
            "zip_code" : "211404"
          },
          {
            "id" : "947",
            "name" : "绥中县",
            "zip_code" : "211421"
          },
          {
            "id" : "948",
            "name" : "建昌县",
            "zip_code" : "211422"
          },
          {
            "id" : "949",
            "name" : "兴城市",
            "zip_code" : "211481"
          }
        ],
        "name" : "葫芦岛",
        "zip_code" : "211400"
      }
    ],
    "id" : "7",
    "name" : "辽宁",
    "zip_code" : "210000"
  },
  {
    "cities" : [
      {
        "id" : "85",
        "areas" : [
          {
            "id" : "950",
            "name" : "市辖区",
            "zip_code" : "220101"
          },
          {
            "id" : "951",
            "name" : "南关区",
            "zip_code" : "220102"
          },
          {
            "id" : "952",
            "name" : "宽城区",
            "zip_code" : "220103"
          },
          {
            "id" : "953",
            "name" : "朝阳区",
            "zip_code" : "220104"
          },
          {
            "id" : "954",
            "name" : "二道区",
            "zip_code" : "220105"
          },
          {
            "id" : "955",
            "name" : "绿园区",
            "zip_code" : "220106"
          },
          {
            "id" : "956",
            "name" : "双阳区",
            "zip_code" : "220112"
          },
          {
            "id" : "957",
            "name" : "农安县",
            "zip_code" : "220122"
          },
          {
            "id" : "958",
            "name" : "九台市",
            "zip_code" : "220181"
          },
          {
            "id" : "959",
            "name" : "榆树市",
            "zip_code" : "220182"
          },
          {
            "id" : "960",
            "name" : "德惠市",
            "zip_code" : "220183"
          }
        ],
        "name" : "长春",
        "zip_code" : "220100"
      },
      {
        "id" : "86",
        "areas" : [
          {
            "id" : "961",
            "name" : "市辖区",
            "zip_code" : "220201"
          },
          {
            "id" : "962",
            "name" : "昌邑区",
            "zip_code" : "220202"
          },
          {
            "id" : "963",
            "name" : "龙潭区",
            "zip_code" : "220203"
          },
          {
            "id" : "964",
            "name" : "船营区",
            "zip_code" : "220204"
          },
          {
            "id" : "965",
            "name" : "丰满区",
            "zip_code" : "220211"
          },
          {
            "id" : "966",
            "name" : "永吉县",
            "zip_code" : "220221"
          },
          {
            "id" : "967",
            "name" : "蛟河市",
            "zip_code" : "220281"
          },
          {
            "id" : "968",
            "name" : "桦甸市",
            "zip_code" : "220282"
          },
          {
            "id" : "969",
            "name" : "舒兰市",
            "zip_code" : "220283"
          },
          {
            "id" : "970",
            "name" : "磐石市",
            "zip_code" : "220284"
          }
        ],
        "name" : "吉林",
        "zip_code" : "220200"
      },
      {
        "id" : "87",
        "areas" : [
          {
            "id" : "971",
            "name" : "市辖区",
            "zip_code" : "220301"
          },
          {
            "id" : "972",
            "name" : "铁西区",
            "zip_code" : "220302"
          },
          {
            "id" : "973",
            "name" : "铁东区",
            "zip_code" : "220303"
          },
          {
            "id" : "974",
            "name" : "梨树县",
            "zip_code" : "220322"
          },
          {
            "id" : "975",
            "name" : "伊通满族自治县",
            "zip_code" : "220323"
          },
          {
            "id" : "976",
            "name" : "公主岭市",
            "zip_code" : "220381"
          },
          {
            "id" : "977",
            "name" : "双辽市",
            "zip_code" : "220382"
          }
        ],
        "name" : "四平",
        "zip_code" : "220300"
      },
      {
        "id" : "88",
        "areas" : [
          {
            "id" : "978",
            "name" : "市辖区",
            "zip_code" : "220401"
          },
          {
            "id" : "979",
            "name" : "龙山区",
            "zip_code" : "220402"
          },
          {
            "id" : "980",
            "name" : "西安区",
            "zip_code" : "220403"
          },
          {
            "id" : "981",
            "name" : "东丰县",
            "zip_code" : "220421"
          },
          {
            "id" : "982",
            "name" : "东辽县",
            "zip_code" : "220422"
          }
        ],
        "name" : "辽源",
        "zip_code" : "220400"
      },
      {
        "id" : "89",
        "areas" : [
          {
            "id" : "983",
            "name" : "市辖区",
            "zip_code" : "220501"
          },
          {
            "id" : "984",
            "name" : "东昌区",
            "zip_code" : "220502"
          },
          {
            "id" : "985",
            "name" : "二道江区",
            "zip_code" : "220503"
          },
          {
            "id" : "986",
            "name" : "通化县",
            "zip_code" : "220521"
          },
          {
            "id" : "987",
            "name" : "辉南县",
            "zip_code" : "220523"
          },
          {
            "id" : "988",
            "name" : "柳河县",
            "zip_code" : "220524"
          },
          {
            "id" : "989",
            "name" : "梅河口市",
            "zip_code" : "220581"
          },
          {
            "id" : "990",
            "name" : "集安市",
            "zip_code" : "220582"
          }
        ],
        "name" : "通化",
        "zip_code" : "220500"
      },
      {
        "id" : "90",
        "areas" : [
          {
            "id" : "991",
            "name" : "市辖区",
            "zip_code" : "220601"
          },
          {
            "id" : "992",
            "name" : "八道江区",
            "zip_code" : "220602"
          },
          {
            "id" : "993",
            "name" : "抚松县",
            "zip_code" : "220621"
          },
          {
            "id" : "994",
            "name" : "靖宇县",
            "zip_code" : "220622"
          },
          {
            "id" : "995",
            "name" : "长白朝鲜族自治县",
            "zip_code" : "220623"
          },
          {
            "id" : "996",
            "name" : "江源区",
            "zip_code" : "220605"
          },
          {
            "id" : "997",
            "name" : "临江市",
            "zip_code" : "220681"
          }
        ],
        "name" : "白山",
        "zip_code" : "220600"
      },
      {
        "id" : "91",
        "areas" : [
          {
            "id" : "998",
            "name" : "市辖区",
            "zip_code" : "220701"
          },
          {
            "id" : "999",
            "name" : "宁江区",
            "zip_code" : "220702"
          },
          {
            "id" : "1000",
            "name" : "前郭尔罗斯蒙古族自治县",
            "zip_code" : "220721"
          },
          {
            "id" : "1001",
            "name" : "长岭县",
            "zip_code" : "220722"
          },
          {
            "id" : "1002",
            "name" : "乾安县",
            "zip_code" : "220723"
          },
          {
            "id" : "1003",
            "name" : "扶余县",
            "zip_code" : "220724"
          }
        ],
        "name" : "松原",
        "zip_code" : "220700"
      },
      {
        "id" : "92",
        "areas" : [
          {
            "id" : "1004",
            "name" : "市辖区",
            "zip_code" : "220801"
          },
          {
            "id" : "1005",
            "name" : "洮北区",
            "zip_code" : "220802"
          },
          {
            "id" : "1006",
            "name" : "镇赉县",
            "zip_code" : "220821"
          },
          {
            "id" : "1007",
            "name" : "通榆县",
            "zip_code" : "220822"
          },
          {
            "id" : "1008",
            "name" : "洮南市",
            "zip_code" : "220881"
          },
          {
            "id" : "1009",
            "name" : "大安市",
            "zip_code" : "220882"
          }
        ],
        "name" : "白城",
        "zip_code" : "220800"
      },
      {
        "id" : "93",
        "areas" : [
          {
            "id" : "1010",
            "name" : "延吉市",
            "zip_code" : "222401"
          },
          {
            "id" : "1011",
            "name" : "图们市",
            "zip_code" : "222402"
          },
          {
            "id" : "1012",
            "name" : "敦化市",
            "zip_code" : "222403"
          },
          {
            "id" : "1013",
            "name" : "珲春市",
            "zip_code" : "222404"
          },
          {
            "id" : "1014",
            "name" : "龙井市",
            "zip_code" : "222405"
          },
          {
            "id" : "1015",
            "name" : "和龙市",
            "zip_code" : "222406"
          },
          {
            "id" : "1016",
            "name" : "汪清县",
            "zip_code" : "222424"
          },
          {
            "id" : "1017",
            "name" : "安图县",
            "zip_code" : "222426"
          }
        ],
        "name" : "延边朝鲜族自治州",
        "zip_code" : "222400"
      }
    ],
    "id" : "8",
    "name" : "吉林",
    "zip_code" : "220000"
  },
  {
    "cities" : [
      {
        "id" : "94",
        "areas" : [
          {
            "id" : "1018",
            "name" : "市辖区",
            "zip_code" : "230101"
          },
          {
            "id" : "1019",
            "name" : "道里区",
            "zip_code" : "230102"
          },
          {
            "id" : "1020",
            "name" : "南岗区",
            "zip_code" : "230103"
          },
          {
            "id" : "1021",
            "name" : "道外区",
            "zip_code" : "230104"
          },
          {
            "id" : "1022",
            "name" : "香坊区",
            "zip_code" : "230110"
          },
          {
            "id" : "1024",
            "name" : "平房区",
            "zip_code" : "230108"
          },
          {
            "id" : "1025",
            "name" : "松北区",
            "zip_code" : "230109"
          },
          {
            "id" : "1026",
            "name" : "呼兰区",
            "zip_code" : "230111"
          },
          {
            "id" : "1027",
            "name" : "依兰县",
            "zip_code" : "230123"
          },
          {
            "id" : "1028",
            "name" : "方正县",
            "zip_code" : "230124"
          },
          {
            "id" : "1029",
            "name" : "宾县",
            "zip_code" : "230125"
          },
          {
            "id" : "1030",
            "name" : "巴彦县",
            "zip_code" : "230126"
          },
          {
            "id" : "1031",
            "name" : "木兰县",
            "zip_code" : "230127"
          },
          {
            "id" : "1032",
            "name" : "通河县",
            "zip_code" : "230128"
          },
          {
            "id" : "1033",
            "name" : "延寿县",
            "zip_code" : "230129"
          },
          {
            "id" : "1034",
            "name" : "阿城区",
            "zip_code" : "230112"
          },
          {
            "id" : "1035",
            "name" : "双城市",
            "zip_code" : "230182"
          },
          {
            "id" : "1036",
            "name" : "尚志市",
            "zip_code" : "230183"
          },
          {
            "id" : "1037",
            "name" : "五常市",
            "zip_code" : "230184"
          }
        ],
        "name" : "哈尔滨",
        "zip_code" : "230100"
      },
      {
        "id" : "95",
        "areas" : [
          {
            "id" : "1038",
            "name" : "市辖区",
            "zip_code" : "230201"
          },
          {
            "id" : "1039",
            "name" : "龙沙区",
            "zip_code" : "230202"
          },
          {
            "id" : "1040",
            "name" : "建华区",
            "zip_code" : "230203"
          },
          {
            "id" : "1041",
            "name" : "铁锋区",
            "zip_code" : "230204"
          },
          {
            "id" : "1042",
            "name" : "昂昂溪区",
            "zip_code" : "230205"
          },
          {
            "id" : "1043",
            "name" : "富拉尔基区",
            "zip_code" : "230206"
          },
          {
            "id" : "1044",
            "name" : "碾子山区",
            "zip_code" : "230207"
          },
          {
            "id" : "1045",
            "name" : "梅里斯达斡尔族区",
            "zip_code" : "230208"
          },
          {
            "id" : "1046",
            "name" : "龙江县",
            "zip_code" : "230221"
          },
          {
            "id" : "1047",
            "name" : "依安县",
            "zip_code" : "230223"
          },
          {
            "id" : "1048",
            "name" : "泰来县",
            "zip_code" : "230224"
          },
          {
            "id" : "1049",
            "name" : "甘南县",
            "zip_code" : "230225"
          },
          {
            "id" : "1050",
            "name" : "富裕县",
            "zip_code" : "230227"
          },
          {
            "id" : "1051",
            "name" : "克山县",
            "zip_code" : "230229"
          },
          {
            "id" : "1052",
            "name" : "克东县",
            "zip_code" : "230230"
          },
          {
            "id" : "1053",
            "name" : "拜泉县",
            "zip_code" : "230231"
          },
          {
            "id" : "1054",
            "name" : "讷河市",
            "zip_code" : "230281"
          }
        ],
        "name" : "齐齐哈尔",
        "zip_code" : "230200"
      },
      {
        "id" : "96",
        "areas" : [
          {
            "id" : "1055",
            "name" : "市辖区",
            "zip_code" : "230301"
          },
          {
            "id" : "1056",
            "name" : "鸡冠区",
            "zip_code" : "230302"
          },
          {
            "id" : "1057",
            "name" : "恒山区",
            "zip_code" : "230303"
          },
          {
            "id" : "1058",
            "name" : "滴道区",
            "zip_code" : "230304"
          },
          {
            "id" : "1059",
            "name" : "梨树区",
            "zip_code" : "230305"
          },
          {
            "id" : "1060",
            "name" : "城子河区",
            "zip_code" : "230306"
          },
          {
            "id" : "1061",
            "name" : "麻山区",
            "zip_code" : "230307"
          },
          {
            "id" : "1062",
            "name" : "鸡东县",
            "zip_code" : "230321"
          },
          {
            "id" : "1063",
            "name" : "虎林市",
            "zip_code" : "230381"
          },
          {
            "id" : "1064",
            "name" : "密山市",
            "zip_code" : "230382"
          }
        ],
        "name" : "鸡西",
        "zip_code" : "230300"
      },
      {
        "id" : "97",
        "areas" : [
          {
            "id" : "1065",
            "name" : "市辖区",
            "zip_code" : "230401"
          },
          {
            "id" : "1066",
            "name" : "向阳区",
            "zip_code" : "230402"
          },
          {
            "id" : "1067",
            "name" : "工农区",
            "zip_code" : "230403"
          },
          {
            "id" : "1068",
            "name" : "南山区",
            "zip_code" : "230404"
          },
          {
            "id" : "1069",
            "name" : "兴安区",
            "zip_code" : "230405"
          },
          {
            "id" : "1070",
            "name" : "东山区",
            "zip_code" : "230406"
          },
          {
            "id" : "1071",
            "name" : "兴山区",
            "zip_code" : "230407"
          },
          {
            "id" : "1072",
            "name" : "萝北县",
            "zip_code" : "230421"
          },
          {
            "id" : "1073",
            "name" : "绥滨县",
            "zip_code" : "230422"
          }
        ],
        "name" : "鹤岗",
        "zip_code" : "230400"
      },
      {
        "id" : "98",
        "areas" : [
          {
            "id" : "1074",
            "name" : "市辖区",
            "zip_code" : "230501"
          },
          {
            "id" : "1075",
            "name" : "尖山区",
            "zip_code" : "230502"
          },
          {
            "id" : "1076",
            "name" : "岭东区",
            "zip_code" : "230503"
          },
          {
            "id" : "1077",
            "name" : "四方台区",
            "zip_code" : "230505"
          },
          {
            "id" : "1078",
            "name" : "宝山区",
            "zip_code" : "230506"
          },
          {
            "id" : "1079",
            "name" : "集贤县",
            "zip_code" : "230521"
          },
          {
            "id" : "1080",
            "name" : "友谊县",
            "zip_code" : "230522"
          },
          {
            "id" : "1081",
            "name" : "宝清县",
            "zip_code" : "230523"
          },
          {
            "id" : "1082",
            "name" : "饶河县",
            "zip_code" : "230524"
          }
        ],
        "name" : "双鸭山",
        "zip_code" : "230500"
      },
      {
        "id" : "99",
        "areas" : [
          {
            "id" : "1083",
            "name" : "市辖区",
            "zip_code" : "230601"
          },
          {
            "id" : "1084",
            "name" : "萨尔图区",
            "zip_code" : "230602"
          },
          {
            "id" : "1085",
            "name" : "龙凤区",
            "zip_code" : "230603"
          },
          {
            "id" : "1086",
            "name" : "让胡路区",
            "zip_code" : "230604"
          },
          {
            "id" : "1087",
            "name" : "红岗区",
            "zip_code" : "230605"
          },
          {
            "id" : "1088",
            "name" : "大同区",
            "zip_code" : "230606"
          },
          {
            "id" : "1089",
            "name" : "肇州县",
            "zip_code" : "230621"
          },
          {
            "id" : "1090",
            "name" : "肇源县",
            "zip_code" : "230622"
          },
          {
            "id" : "1091",
            "name" : "林甸县",
            "zip_code" : "230623"
          },
          {
            "id" : "1092",
            "name" : "杜尔伯特蒙古族自治县",
            "zip_code" : "230624"
          }
        ],
        "name" : "大庆",
        "zip_code" : "230600"
      },
      {
        "id" : "100",
        "areas" : [
          {
            "id" : "1093",
            "name" : "市辖区",
            "zip_code" : "230701"
          },
          {
            "id" : "1094",
            "name" : "伊春区",
            "zip_code" : "230702"
          },
          {
            "id" : "1095",
            "name" : "南岔区",
            "zip_code" : "230703"
          },
          {
            "id" : "1096",
            "name" : "友好区",
            "zip_code" : "230704"
          },
          {
            "id" : "1097",
            "name" : "西林区",
            "zip_code" : "230705"
          },
          {
            "id" : "1098",
            "name" : "翠峦区",
            "zip_code" : "230706"
          },
          {
            "id" : "1099",
            "name" : "新青区",
            "zip_code" : "230707"
          },
          {
            "id" : "1100",
            "name" : "美溪区",
            "zip_code" : "230708"
          },
          {
            "id" : "1101",
            "name" : "金山屯区",
            "zip_code" : "230709"
          },
          {
            "id" : "1102",
            "name" : "五营区",
            "zip_code" : "230710"
          },
          {
            "id" : "1103",
            "name" : "乌马河区",
            "zip_code" : "230711"
          },
          {
            "id" : "1104",
            "name" : "汤旺河区",
            "zip_code" : "230712"
          },
          {
            "id" : "1105",
            "name" : "带岭区",
            "zip_code" : "230713"
          },
          {
            "id" : "1106",
            "name" : "乌伊岭区",
            "zip_code" : "230714"
          },
          {
            "id" : "1107",
            "name" : "红星区",
            "zip_code" : "230715"
          },
          {
            "id" : "1108",
            "name" : "上甘岭区",
            "zip_code" : "230716"
          },
          {
            "id" : "1109",
            "name" : "嘉荫县",
            "zip_code" : "230722"
          },
          {
            "id" : "1110",
            "name" : "铁力市",
            "zip_code" : "230781"
          }
        ],
        "name" : "伊春",
        "zip_code" : "230700"
      },
      {
        "id" : "101",
        "areas" : [
          {
            "id" : "1111",
            "name" : "市辖区",
            "zip_code" : "230801"
          },
          {
            "id" : "1113",
            "name" : "向阳区",
            "zip_code" : "230803"
          },
          {
            "id" : "1114",
            "name" : "前进区",
            "zip_code" : "230804"
          },
          {
            "id" : "1115",
            "name" : "东风区",
            "zip_code" : "230805"
          },
          {
            "id" : "1116",
            "name" : "郊区",
            "zip_code" : "230811"
          },
          {
            "id" : "1117",
            "name" : "桦南县",
            "zip_code" : "230822"
          },
          {
            "id" : "1118",
            "name" : "桦川县",
            "zip_code" : "230826"
          },
          {
            "id" : "1119",
            "name" : "汤原县",
            "zip_code" : "230828"
          },
          {
            "id" : "1120",
            "name" : "抚远县",
            "zip_code" : "230833"
          },
          {
            "id" : "1121",
            "name" : "同江市",
            "zip_code" : "230881"
          },
          {
            "id" : "1122",
            "name" : "富锦市",
            "zip_code" : "230882"
          }
        ],
        "name" : "佳木斯",
        "zip_code" : "230800"
      },
      {
        "id" : "102",
        "areas" : [
          {
            "id" : "1123",
            "name" : "市辖区",
            "zip_code" : "230901"
          },
          {
            "id" : "1124",
            "name" : "新兴区",
            "zip_code" : "230902"
          },
          {
            "id" : "1125",
            "name" : "桃山区",
            "zip_code" : "230903"
          },
          {
            "id" : "1126",
            "name" : "茄子河区",
            "zip_code" : "230904"
          },
          {
            "id" : "1127",
            "name" : "勃利县",
            "zip_code" : "230921"
          }
        ],
        "name" : "七台河",
        "zip_code" : "230900"
      },
      {
        "id" : "103",
        "areas" : [
          {
            "id" : "1128",
            "name" : "市辖区",
            "zip_code" : "231001"
          },
          {
            "id" : "1129",
            "name" : "东安区",
            "zip_code" : "231002"
          },
          {
            "id" : "1130",
            "name" : "阳明区",
            "zip_code" : "231003"
          },
          {
            "id" : "1131",
            "name" : "爱民区",
            "zip_code" : "231004"
          },
          {
            "id" : "1132",
            "name" : "西安区",
            "zip_code" : "231005"
          },
          {
            "id" : "1133",
            "name" : "东宁县",
            "zip_code" : "231024"
          },
          {
            "id" : "1134",
            "name" : "林口县",
            "zip_code" : "231025"
          },
          {
            "id" : "1135",
            "name" : "绥芬河市",
            "zip_code" : "231081"
          },
          {
            "id" : "1136",
            "name" : "海林市",
            "zip_code" : "231083"
          },
          {
            "id" : "1137",
            "name" : "宁安市",
            "zip_code" : "231084"
          },
          {
            "id" : "1138",
            "name" : "穆棱市",
            "zip_code" : "231085"
          }
        ],
        "name" : "牡丹江",
        "zip_code" : "231000"
      },
      {
        "id" : "104",
        "areas" : [
          {
            "id" : "1139",
            "name" : "市辖区",
            "zip_code" : "231101"
          },
          {
            "id" : "1140",
            "name" : "爱辉区",
            "zip_code" : "231102"
          },
          {
            "id" : "1141",
            "name" : "嫩江县",
            "zip_code" : "231121"
          },
          {
            "id" : "1142",
            "name" : "逊克县",
            "zip_code" : "231123"
          },
          {
            "id" : "1143",
            "name" : "孙吴县",
            "zip_code" : "231124"
          },
          {
            "id" : "1144",
            "name" : "北安市",
            "zip_code" : "231181"
          },
          {
            "id" : "1145",
            "name" : "五大连池市",
            "zip_code" : "231182"
          }
        ],
        "name" : "黑河",
        "zip_code" : "231100"
      },
      {
        "id" : "105",
        "areas" : [
          {
            "id" : "1146",
            "name" : "市辖区",
            "zip_code" : "231201"
          },
          {
            "id" : "1147",
            "name" : "北林区",
            "zip_code" : "231202"
          },
          {
            "id" : "1148",
            "name" : "望奎县",
            "zip_code" : "231221"
          },
          {
            "id" : "1149",
            "name" : "兰西县",
            "zip_code" : "231222"
          },
          {
            "id" : "1150",
            "name" : "青冈县",
            "zip_code" : "231223"
          },
          {
            "id" : "1151",
            "name" : "庆安县",
            "zip_code" : "231224"
          },
          {
            "id" : "1152",
            "name" : "明水县",
            "zip_code" : "231225"
          },
          {
            "id" : "1153",
            "name" : "绥棱县",
            "zip_code" : "231226"
          },
          {
            "id" : "1154",
            "name" : "安达市",
            "zip_code" : "231281"
          },
          {
            "id" : "1155",
            "name" : "肇东市",
            "zip_code" : "231282"
          },
          {
            "id" : "1156",
            "name" : "海伦市",
            "zip_code" : "231283"
          }
        ],
        "name" : "绥化",
        "zip_code" : "231200"
      },
      {
        "id" : "106",
        "areas" : [
          {
            "id" : "1157",
            "name" : "呼玛县",
            "zip_code" : "232721"
          },
          {
            "id" : "1158",
            "name" : "塔河县",
            "zip_code" : "232722"
          },
          {
            "id" : "1159",
            "name" : "漠河县",
            "zip_code" : "232723"
          },
          {
            "id" : "4100",
            "name" : "加格达奇区",
            "zip_code" : "232701"
          },
          {
            "id" : "4101",
            "name" : "松岭区",
            "zip_code" : "232702"
          },
          {
            "id" : "4102",
            "name" : "新林区",
            "zip_code" : "232703"
          },
          {
            "id" : "4103",
            "name" : "呼中区",
            "zip_code" : "232704"
          }
        ],
        "name" : "大兴安岭地区",
        "zip_code" : "232700"
      }
    ],
    "id" : "9",
    "name" : "黑龙江",
    "zip_code" : "230000"
  },
  {
    "cities" : [
      {
        "id" : "107",
        "areas" : [
          {
            "id" : "1160",
            "name" : "黄浦区",
            "zip_code" : "310101"
          },
          {
            "id" : "1161",
            "name" : "卢湾区",
            "zip_code" : "310103"
          },
          {
            "id" : "1162",
            "name" : "徐汇区",
            "zip_code" : "310104"
          },
          {
            "id" : "1163",
            "name" : "长宁区",
            "zip_code" : "310105"
          },
          {
            "id" : "1164",
            "name" : "静安区",
            "zip_code" : "310106"
          },
          {
            "id" : "1165",
            "name" : "普陀区",
            "zip_code" : "310107"
          },
          {
            "id" : "1166",
            "name" : "闸北区",
            "zip_code" : "310108"
          },
          {
            "id" : "1167",
            "name" : "虹口区",
            "zip_code" : "310109"
          },
          {
            "id" : "1168",
            "name" : "杨浦区",
            "zip_code" : "310110"
          },
          {
            "id" : "1169",
            "name" : "闵行区",
            "zip_code" : "310112"
          },
          {
            "id" : "1170",
            "name" : "宝山区",
            "zip_code" : "310113"
          },
          {
            "id" : "1171",
            "name" : "嘉定区",
            "zip_code" : "310114"
          },
          {
            "id" : "1172",
            "name" : "浦东新区",
            "zip_code" : "310115"
          },
          {
            "id" : "1173",
            "name" : "金山区",
            "zip_code" : "310116"
          },
          {
            "id" : "1174",
            "name" : "松江区",
            "zip_code" : "310117"
          },
          {
            "id" : "1175",
            "name" : "青浦区",
            "zip_code" : "310118"
          },
          {
            "id" : "1177",
            "name" : "奉贤区",
            "zip_code" : "310120"
          },
          {
            "id" : "1178",
            "name" : "崇明县",
            "zip_code" : "310230"
          }
        ],
        "name" : "上海",
        "zip_code" : "310100"
      }
    ],
    "id" : "10",
    "name" : "上海",
    "zip_code" : "310000"
  },
  {
    "cities" : [
      {
        "id" : "109",
        "areas" : [
          {
            "id" : "1179",
            "name" : "市辖区",
            "zip_code" : "320101"
          },
          {
            "id" : "1180",
            "name" : "玄武区",
            "zip_code" : "320102"
          },
          {
            "id" : "1181",
            "name" : "白下区",
            "zip_code" : "320103"
          },
          {
            "id" : "1182",
            "name" : "秦淮区",
            "zip_code" : "320104"
          },
          {
            "id" : "1183",
            "name" : "建邺区",
            "zip_code" : "320105"
          },
          {
            "id" : "1184",
            "name" : "鼓楼区",
            "zip_code" : "320106"
          },
          {
            "id" : "1185",
            "name" : "下关区",
            "zip_code" : "320107"
          },
          {
            "id" : "1186",
            "name" : "浦口区",
            "zip_code" : "320111"
          },
          {
            "id" : "1187",
            "name" : "栖霞区",
            "zip_code" : "320113"
          },
          {
            "id" : "1188",
            "name" : "雨花台区",
            "zip_code" : "320114"
          },
          {
            "id" : "1189",
            "name" : "江宁区",
            "zip_code" : "320115"
          },
          {
            "id" : "1190",
            "name" : "六合区",
            "zip_code" : "320116"
          },
          {
            "id" : "1191",
            "name" : "溧水县",
            "zip_code" : "320124"
          },
          {
            "id" : "1192",
            "name" : "高淳县",
            "zip_code" : "320125"
          }
        ],
        "name" : "南京",
        "zip_code" : "320100"
      },
      {
        "id" : "110",
        "areas" : [
          {
            "id" : "1193",
            "name" : "市辖区",
            "zip_code" : "320201"
          },
          {
            "id" : "1194",
            "name" : "崇安区",
            "zip_code" : "320202"
          },
          {
            "id" : "1195",
            "name" : "南长区",
            "zip_code" : "320203"
          },
          {
            "id" : "1196",
            "name" : "北塘区",
            "zip_code" : "320204"
          },
          {
            "id" : "1197",
            "name" : "锡山区",
            "zip_code" : "320205"
          },
          {
            "id" : "1198",
            "name" : "惠山区",
            "zip_code" : "320206"
          },
          {
            "id" : "1199",
            "name" : "滨湖区",
            "zip_code" : "320211"
          },
          {
            "id" : "1200",
            "name" : "江阴市",
            "zip_code" : "320281"
          },
          {
            "id" : "1201",
            "name" : "宜兴市",
            "zip_code" : "320282"
          }
        ],
        "name" : "无锡",
        "zip_code" : "320200"
      },
      {
        "id" : "111",
        "areas" : [
          {
            "id" : "1202",
            "name" : "市辖区",
            "zip_code" : "320301"
          },
          {
            "id" : "1203",
            "name" : "鼓楼区",
            "zip_code" : "320302"
          },
          {
            "id" : "1204",
            "name" : "云龙区",
            "zip_code" : "320303"
          },
          {
            "id" : "1206",
            "name" : "贾汪区",
            "zip_code" : "320305"
          },
          {
            "id" : "1207",
            "name" : "泉山区",
            "zip_code" : "320311"
          },
          {
            "id" : "1208",
            "name" : "丰县",
            "zip_code" : "320321"
          },
          {
            "id" : "1209",
            "name" : "沛县",
            "zip_code" : "320322"
          },
          {
            "id" : "1210",
            "name" : "铜山区",
            "zip_code" : "320312"
          },
          {
            "id" : "1211",
            "name" : "睢宁县",
            "zip_code" : "320324"
          },
          {
            "id" : "1212",
            "name" : "新沂市",
            "zip_code" : "320381"
          },
          {
            "id" : "1213",
            "name" : "邳州市",
            "zip_code" : "320382"
          }
        ],
        "name" : "徐州",
        "zip_code" : "320300"
      },
      {
        "id" : "112",
        "areas" : [
          {
            "id" : "1214",
            "name" : "市辖区",
            "zip_code" : "320401"
          },
          {
            "id" : "1215",
            "name" : "天宁区",
            "zip_code" : "320402"
          },
          {
            "id" : "1216",
            "name" : "钟楼区",
            "zip_code" : "320404"
          },
          {
            "id" : "1217",
            "name" : "戚墅堰区",
            "zip_code" : "320405"
          },
          {
            "id" : "1218",
            "name" : "新北区",
            "zip_code" : "320411"
          },
          {
            "id" : "1219",
            "name" : "武进区",
            "zip_code" : "320412"
          },
          {
            "id" : "1220",
            "name" : "溧阳市",
            "zip_code" : "320481"
          },
          {
            "id" : "1221",
            "name" : "金坛市",
            "zip_code" : "320482"
          }
        ],
        "name" : "常州",
        "zip_code" : "320400"
      },
      {
        "id" : "113",
        "areas" : [
          {
            "id" : "1222",
            "name" : "市辖区",
            "zip_code" : "320501"
          },
          {
            "id" : "1223",
            "name" : "沧浪区",
            "zip_code" : "320502"
          },
          {
            "id" : "1224",
            "name" : "平江区",
            "zip_code" : "320503"
          },
          {
            "id" : "1225",
            "name" : "金阊区",
            "zip_code" : "320504"
          },
          {
            "id" : "1226",
            "name" : "虎丘区",
            "zip_code" : "320505"
          },
          {
            "id" : "1227",
            "name" : "吴中区",
            "zip_code" : "320506"
          },
          {
            "id" : "1228",
            "name" : "相城区",
            "zip_code" : "320507"
          },
          {
            "id" : "1229",
            "name" : "常熟市",
            "zip_code" : "320581"
          },
          {
            "id" : "1230",
            "name" : "张家港市",
            "zip_code" : "320582"
          },
          {
            "id" : "1231",
            "name" : "昆山市",
            "zip_code" : "320583"
          },
          {
            "id" : "1232",
            "name" : "吴江市",
            "zip_code" : "320584"
          },
          {
            "id" : "1233",
            "name" : "太仓市",
            "zip_code" : "320585"
          }
        ],
        "name" : "苏州",
        "zip_code" : "320500"
      },
      {
        "id" : "114",
        "areas" : [
          {
            "id" : "1234",
            "name" : "市辖区",
            "zip_code" : "320601"
          },
          {
            "id" : "1235",
            "name" : "崇川区",
            "zip_code" : "320602"
          },
          {
            "id" : "1236",
            "name" : "港闸区",
            "zip_code" : "320611"
          },
          {
            "id" : "1237",
            "name" : "海安县",
            "zip_code" : "320621"
          },
          {
            "id" : "1238",
            "name" : "如东县",
            "zip_code" : "320623"
          },
          {
            "id" : "1239",
            "name" : "启东市",
            "zip_code" : "320681"
          },
          {
            "id" : "1240",
            "name" : "如皋市",
            "zip_code" : "320682"
          },
          {
            "id" : "1241",
            "name" : "通州区",
            "zip_code" : "320612"
          },
          {
            "id" : "1242",
            "name" : "海门市",
            "zip_code" : "320684"
          }
        ],
        "name" : "南通",
        "zip_code" : "320600"
      },
      {
        "id" : "115",
        "areas" : [
          {
            "id" : "1243",
            "name" : "市辖区",
            "zip_code" : "320701"
          },
          {
            "id" : "1244",
            "name" : "连云区",
            "zip_code" : "320703"
          },
          {
            "id" : "1245",
            "name" : "新浦区",
            "zip_code" : "320705"
          },
          {
            "id" : "1246",
            "name" : "海州区",
            "zip_code" : "320706"
          },
          {
            "id" : "1247",
            "name" : "赣榆县",
            "zip_code" : "320721"
          },
          {
            "id" : "1248",
            "name" : "东海县",
            "zip_code" : "320722"
          },
          {
            "id" : "1249",
            "name" : "灌云县",
            "zip_code" : "320723"
          },
          {
            "id" : "1250",
            "name" : "灌南县",
            "zip_code" : "320724"
          }
        ],
        "name" : "连云港",
        "zip_code" : "320700"
      },
      {
        "id" : "116",
        "areas" : [
          {
            "id" : "1251",
            "name" : "市辖区",
            "zip_code" : "320801"
          },
          {
            "id" : "1252",
            "name" : "清河区",
            "zip_code" : "320802"
          },
          {
            "id" : "1253",
            "name" : "楚州区",
            "zip_code" : "320803"
          },
          {
            "id" : "1254",
            "name" : "淮阴区",
            "zip_code" : "320804"
          },
          {
            "id" : "1255",
            "name" : "清浦区",
            "zip_code" : "320811"
          },
          {
            "id" : "1256",
            "name" : "涟水县",
            "zip_code" : "320826"
          },
          {
            "id" : "1257",
            "name" : "洪泽县",
            "zip_code" : "320829"
          },
          {
            "id" : "1258",
            "name" : "盱眙县",
            "zip_code" : "320830"
          },
          {
            "id" : "1259",
            "name" : "金湖县",
            "zip_code" : "320831"
          }
        ],
        "name" : "淮安",
        "zip_code" : "320800"
      },
      {
        "id" : "117",
        "areas" : [
          {
            "id" : "1260",
            "name" : "市辖区",
            "zip_code" : "320901"
          },
          {
            "id" : "1261",
            "name" : "亭湖区",
            "zip_code" : "320902"
          },
          {
            "id" : "1262",
            "name" : "盐都区",
            "zip_code" : "320903"
          },
          {
            "id" : "1263",
            "name" : "响水县",
            "zip_code" : "320921"
          },
          {
            "id" : "1264",
            "name" : "滨海县",
            "zip_code" : "320922"
          },
          {
            "id" : "1265",
            "name" : "阜宁县",
            "zip_code" : "320923"
          },
          {
            "id" : "1266",
            "name" : "射阳县",
            "zip_code" : "320924"
          },
          {
            "id" : "1267",
            "name" : "建湖县",
            "zip_code" : "320925"
          },
          {
            "id" : "1268",
            "name" : "东台市",
            "zip_code" : "320981"
          },
          {
            "id" : "1269",
            "name" : "大丰市",
            "zip_code" : "320982"
          }
        ],
        "name" : "盐城",
        "zip_code" : "320900"
      },
      {
        "id" : "118",
        "areas" : [
          {
            "id" : "1270",
            "name" : "市辖区",
            "zip_code" : "321001"
          },
          {
            "id" : "1271",
            "name" : "广陵区",
            "zip_code" : "321002"
          },
          {
            "id" : "1272",
            "name" : "邗江区",
            "zip_code" : "321003"
          },
          {
            "id" : "1273",
            "name" : "维扬区",
            "zip_code" : "321011"
          },
          {
            "id" : "1274",
            "name" : "宝应县",
            "zip_code" : "321023"
          },
          {
            "id" : "1275",
            "name" : "仪征市",
            "zip_code" : "321081"
          },
          {
            "id" : "1276",
            "name" : "高邮市",
            "zip_code" : "321084"
          },
          {
            "id" : "1277",
            "name" : "江都市",
            "zip_code" : "321088"
          }
        ],
        "name" : "扬州",
        "zip_code" : "321000"
      },
      {
        "id" : "119",
        "areas" : [
          {
            "id" : "1278",
            "name" : "市辖区",
            "zip_code" : "321101"
          },
          {
            "id" : "1279",
            "name" : "京口区",
            "zip_code" : "321102"
          },
          {
            "id" : "1280",
            "name" : "润州区",
            "zip_code" : "321111"
          },
          {
            "id" : "1281",
            "name" : "丹徒区",
            "zip_code" : "321112"
          },
          {
            "id" : "1282",
            "name" : "丹阳市",
            "zip_code" : "321181"
          },
          {
            "id" : "1283",
            "name" : "扬中市",
            "zip_code" : "321182"
          },
          {
            "id" : "1284",
            "name" : "句容市",
            "zip_code" : "321183"
          }
        ],
        "name" : "镇江",
        "zip_code" : "321100"
      },
      {
        "id" : "120",
        "areas" : [
          {
            "id" : "1285",
            "name" : "市辖区",
            "zip_code" : "321201"
          },
          {
            "id" : "1286",
            "name" : "海陵区",
            "zip_code" : "321202"
          },
          {
            "id" : "1287",
            "name" : "高港区",
            "zip_code" : "321203"
          },
          {
            "id" : "1288",
            "name" : "兴化市",
            "zip_code" : "321281"
          },
          {
            "id" : "1289",
            "name" : "靖江市",
            "zip_code" : "321282"
          },
          {
            "id" : "1290",
            "name" : "泰兴市",
            "zip_code" : "321283"
          },
          {
            "id" : "1291",
            "name" : "姜堰市",
            "zip_code" : "321284"
          }
        ],
        "name" : "泰州",
        "zip_code" : "321200"
      },
      {
        "id" : "121",
        "areas" : [
          {
            "id" : "1292",
            "name" : "市辖区",
            "zip_code" : "321301"
          },
          {
            "id" : "1293",
            "name" : "宿城区",
            "zip_code" : "321302"
          },
          {
            "id" : "1294",
            "name" : "宿豫区",
            "zip_code" : "321311"
          },
          {
            "id" : "1295",
            "name" : "沭阳县",
            "zip_code" : "321322"
          },
          {
            "id" : "1296",
            "name" : "泗阳县",
            "zip_code" : "321323"
          },
          {
            "id" : "1297",
            "name" : "泗洪县",
            "zip_code" : "321324"
          }
        ],
        "name" : "宿迁",
        "zip_code" : "321300"
      }
    ],
    "id" : "11",
    "name" : "江苏",
    "zip_code" : "320000"
  },
  {
    "cities" : [
      {
        "id" : "122",
        "areas" : [
          {
            "id" : "1298",
            "name" : "市辖区",
            "zip_code" : "330101"
          },
          {
            "id" : "1299",
            "name" : "上城区",
            "zip_code" : "330102"
          },
          {
            "id" : "1300",
            "name" : "下城区",
            "zip_code" : "330103"
          },
          {
            "id" : "1301",
            "name" : "江干区",
            "zip_code" : "330104"
          },
          {
            "id" : "1302",
            "name" : "拱墅区",
            "zip_code" : "330105"
          },
          {
            "id" : "1303",
            "name" : "西湖区",
            "zip_code" : "330106"
          },
          {
            "id" : "1304",
            "name" : "滨江区",
            "zip_code" : "330108"
          },
          {
            "id" : "1305",
            "name" : "萧山区",
            "zip_code" : "330109"
          },
          {
            "id" : "1306",
            "name" : "余杭区",
            "zip_code" : "330110"
          },
          {
            "id" : "1307",
            "name" : "桐庐县",
            "zip_code" : "330122"
          },
          {
            "id" : "1308",
            "name" : "淳安县",
            "zip_code" : "330127"
          },
          {
            "id" : "1309",
            "name" : "建德市",
            "zip_code" : "330182"
          },
          {
            "id" : "1310",
            "name" : "富阳市",
            "zip_code" : "330183"
          },
          {
            "id" : "1311",
            "name" : "临安市",
            "zip_code" : "330185"
          }
        ],
        "name" : "杭州",
        "zip_code" : "330100"
      },
      {
        "id" : "123",
        "areas" : [
          {
            "id" : "1312",
            "name" : "市辖区",
            "zip_code" : "330201"
          },
          {
            "id" : "1313",
            "name" : "海曙区",
            "zip_code" : "330203"
          },
          {
            "id" : "1314",
            "name" : "江东区",
            "zip_code" : "330204"
          },
          {
            "id" : "1315",
            "name" : "江北区",
            "zip_code" : "330205"
          },
          {
            "id" : "1316",
            "name" : "北仑区",
            "zip_code" : "330206"
          },
          {
            "id" : "1317",
            "name" : "镇海区",
            "zip_code" : "330211"
          },
          {
            "id" : "1318",
            "name" : "鄞州区",
            "zip_code" : "330212"
          },
          {
            "id" : "1319",
            "name" : "象山县",
            "zip_code" : "330225"
          },
          {
            "id" : "1320",
            "name" : "宁海县",
            "zip_code" : "330226"
          },
          {
            "id" : "1321",
            "name" : "余姚市",
            "zip_code" : "330281"
          },
          {
            "id" : "1322",
            "name" : "慈溪市",
            "zip_code" : "330282"
          },
          {
            "id" : "1323",
            "name" : "奉化市",
            "zip_code" : "330283"
          }
        ],
        "name" : "宁波",
        "zip_code" : "330200"
      },
      {
        "id" : "124",
        "areas" : [
          {
            "id" : "1324",
            "name" : "市辖区",
            "zip_code" : "330301"
          },
          {
            "id" : "1325",
            "name" : "鹿城区",
            "zip_code" : "330302"
          },
          {
            "id" : "1326",
            "name" : "龙湾区",
            "zip_code" : "330303"
          },
          {
            "id" : "1327",
            "name" : "瓯海区",
            "zip_code" : "330304"
          },
          {
            "id" : "1328",
            "name" : "洞头县",
            "zip_code" : "330322"
          },
          {
            "id" : "1329",
            "name" : "永嘉县",
            "zip_code" : "330324"
          },
          {
            "id" : "1330",
            "name" : "平阳县",
            "zip_code" : "330326"
          },
          {
            "id" : "1331",
            "name" : "苍南县",
            "zip_code" : "330327"
          },
          {
            "id" : "1332",
            "name" : "文成县",
            "zip_code" : "330328"
          },
          {
            "id" : "1333",
            "name" : "泰顺县",
            "zip_code" : "330329"
          },
          {
            "id" : "1334",
            "name" : "瑞安市",
            "zip_code" : "330381"
          },
          {
            "id" : "1335",
            "name" : "乐清市",
            "zip_code" : "330382"
          }
        ],
        "name" : "温州",
        "zip_code" : "330300"
      },
      {
        "id" : "125",
        "areas" : [
          {
            "id" : "1336",
            "name" : "市辖区",
            "zip_code" : "330401"
          },
          {
            "id" : "1338",
            "name" : "秀洲区",
            "zip_code" : "330411"
          },
          {
            "id" : "1339",
            "name" : "嘉善县",
            "zip_code" : "330421"
          },
          {
            "id" : "1340",
            "name" : "海盐县",
            "zip_code" : "330424"
          },
          {
            "id" : "1341",
            "name" : "海宁市",
            "zip_code" : "330481"
          },
          {
            "id" : "1342",
            "name" : "平湖市",
            "zip_code" : "330482"
          },
          {
            "id" : "1343",
            "name" : "桐乡市",
            "zip_code" : "330483"
          },
          {
            "id" : "4200",
            "name" : "南湖区",
            "zip_code" : "330402"
          }
        ],
        "name" : "嘉兴",
        "zip_code" : "330400"
      },
      {
        "id" : "126",
        "areas" : [
          {
            "id" : "1344",
            "name" : "市辖区",
            "zip_code" : "330501"
          },
          {
            "id" : "1345",
            "name" : "吴兴区",
            "zip_code" : "330502"
          },
          {
            "id" : "1346",
            "name" : "南浔区",
            "zip_code" : "330503"
          },
          {
            "id" : "1347",
            "name" : "德清县",
            "zip_code" : "330521"
          },
          {
            "id" : "1348",
            "name" : "长兴县",
            "zip_code" : "330522"
          },
          {
            "id" : "1349",
            "name" : "安吉县",
            "zip_code" : "330523"
          }
        ],
        "name" : "湖州",
        "zip_code" : "330500"
      },
      {
        "id" : "127",
        "areas" : [
          {
            "id" : "1350",
            "name" : "市辖区",
            "zip_code" : "330601"
          },
          {
            "id" : "1351",
            "name" : "越城区",
            "zip_code" : "330602"
          },
          {
            "id" : "1352",
            "name" : "绍兴县",
            "zip_code" : "330621"
          },
          {
            "id" : "1353",
            "name" : "新昌县",
            "zip_code" : "330624"
          },
          {
            "id" : "1354",
            "name" : "诸暨市",
            "zip_code" : "330681"
          },
          {
            "id" : "1355",
            "name" : "上虞市",
            "zip_code" : "330682"
          },
          {
            "id" : "1356",
            "name" : "嵊州市",
            "zip_code" : "330683"
          }
        ],
        "name" : "绍兴",
        "zip_code" : "330600"
      },
      {
        "id" : "128",
        "areas" : [
          {
            "id" : "1357",
            "name" : "市辖区",
            "zip_code" : "330701"
          },
          {
            "id" : "1358",
            "name" : "婺城区",
            "zip_code" : "330702"
          },
          {
            "id" : "1359",
            "name" : "金东区",
            "zip_code" : "330703"
          },
          {
            "id" : "1360",
            "name" : "武义县",
            "zip_code" : "330723"
          },
          {
            "id" : "1361",
            "name" : "浦江县",
            "zip_code" : "330726"
          },
          {
            "id" : "1362",
            "name" : "磐安县",
            "zip_code" : "330727"
          },
          {
            "id" : "1363",
            "name" : "兰溪市",
            "zip_code" : "330781"
          },
          {
            "id" : "1364",
            "name" : "义乌市",
            "zip_code" : "330782"
          },
          {
            "id" : "1365",
            "name" : "东阳市",
            "zip_code" : "330783"
          },
          {
            "id" : "1366",
            "name" : "永康市",
            "zip_code" : "330784"
          }
        ],
        "name" : "金华",
        "zip_code" : "330700"
      },
      {
        "id" : "129",
        "areas" : [
          {
            "id" : "1367",
            "name" : "市辖区",
            "zip_code" : "330801"
          },
          {
            "id" : "1368",
            "name" : "柯城区",
            "zip_code" : "330802"
          },
          {
            "id" : "1369",
            "name" : "衢江区",
            "zip_code" : "330803"
          },
          {
            "id" : "1370",
            "name" : "常山县",
            "zip_code" : "330822"
          },
          {
            "id" : "1371",
            "name" : "开化县",
            "zip_code" : "330824"
          },
          {
            "id" : "1372",
            "name" : "龙游县",
            "zip_code" : "330825"
          },
          {
            "id" : "1373",
            "name" : "江山市",
            "zip_code" : "330881"
          }
        ],
        "name" : "衢州",
        "zip_code" : "330800"
      },
      {
        "id" : "130",
        "areas" : [
          {
            "id" : "1374",
            "name" : "市辖区",
            "zip_code" : "330901"
          },
          {
            "id" : "1375",
            "name" : "定海区",
            "zip_code" : "330902"
          },
          {
            "id" : "1376",
            "name" : "普陀区",
            "zip_code" : "330903"
          },
          {
            "id" : "1377",
            "name" : "岱山县",
            "zip_code" : "330921"
          },
          {
            "id" : "1378",
            "name" : "嵊泗县",
            "zip_code" : "330922"
          }
        ],
        "name" : "舟山",
        "zip_code" : "330900"
      },
      {
        "id" : "131",
        "areas" : [
          {
            "id" : "1379",
            "name" : "市辖区",
            "zip_code" : "331001"
          },
          {
            "id" : "1380",
            "name" : "椒江区",
            "zip_code" : "331002"
          },
          {
            "id" : "1381",
            "name" : "黄岩区",
            "zip_code" : "331003"
          },
          {
            "id" : "1382",
            "name" : "路桥区",
            "zip_code" : "331004"
          },
          {
            "id" : "1383",
            "name" : "玉环县",
            "zip_code" : "331021"
          },
          {
            "id" : "1384",
            "name" : "三门县",
            "zip_code" : "331022"
          },
          {
            "id" : "1385",
            "name" : "天台县",
            "zip_code" : "331023"
          },
          {
            "id" : "1386",
            "name" : "仙居县",
            "zip_code" : "331024"
          },
          {
            "id" : "1387",
            "name" : "温岭市",
            "zip_code" : "331081"
          },
          {
            "id" : "1388",
            "name" : "临海市",
            "zip_code" : "331082"
          }
        ],
        "name" : "台州",
        "zip_code" : "331000"
      },
      {
        "id" : "132",
        "areas" : [
          {
            "id" : "1389",
            "name" : "市辖区",
            "zip_code" : "331101"
          },
          {
            "id" : "1390",
            "name" : "莲都区",
            "zip_code" : "331102"
          },
          {
            "id" : "1391",
            "name" : "青田县",
            "zip_code" : "331121"
          },
          {
            "id" : "1392",
            "name" : "缙云县",
            "zip_code" : "331122"
          },
          {
            "id" : "1393",
            "name" : "遂昌县",
            "zip_code" : "331123"
          },
          {
            "id" : "1394",
            "name" : "松阳县",
            "zip_code" : "331124"
          },
          {
            "id" : "1395",
            "name" : "云和县",
            "zip_code" : "331125"
          },
          {
            "id" : "1396",
            "name" : "庆元县",
            "zip_code" : "331126"
          },
          {
            "id" : "1397",
            "name" : "景宁畲族自治县",
            "zip_code" : "331127"
          },
          {
            "id" : "1398",
            "name" : "龙泉市",
            "zip_code" : "331181"
          }
        ],
        "name" : "丽水",
        "zip_code" : "331100"
      }
    ],
    "id" : "12",
    "name" : "浙江",
    "zip_code" : "330000"
  },
  {
    "cities" : [
      {
        "id" : "133",
        "areas" : [
          {
            "id" : "1399",
            "name" : "市辖区",
            "zip_code" : "340101"
          },
          {
            "id" : "1400",
            "name" : "瑶海区",
            "zip_code" : "340102"
          },
          {
            "id" : "1401",
            "name" : "庐阳区",
            "zip_code" : "340103"
          },
          {
            "id" : "1402",
            "name" : "蜀山区",
            "zip_code" : "340104"
          },
          {
            "id" : "1403",
            "name" : "包河区",
            "zip_code" : "340111"
          },
          {
            "id" : "1404",
            "name" : "长丰县",
            "zip_code" : "340121"
          },
          {
            "id" : "1405",
            "name" : "肥东县",
            "zip_code" : "340122"
          },
          {
            "id" : "1406",
            "name" : "肥西县",
            "zip_code" : "340123"
          }
        ],
        "name" : "合肥",
        "zip_code" : "340100"
      },
      {
        "id" : "134",
        "areas" : [
          {
            "id" : "1412",
            "name" : "芜湖市",
            "zip_code" : "340200"
          }
        ],
        "name" : "芜湖",
        "zip_code" : "340200"
      },
      {
        "id" : "135",
        "areas" : [
          {
            "id" : "1415",
            "name" : "市辖区",
            "zip_code" : "340301"
          },
          {
            "id" : "1416",
            "name" : "龙子湖区",
            "zip_code" : "340302"
          },
          {
            "id" : "1417",
            "name" : "蚌山区",
            "zip_code" : "340303"
          },
          {
            "id" : "1418",
            "name" : "禹会区",
            "zip_code" : "340304"
          },
          {
            "id" : "1419",
            "name" : "淮上区",
            "zip_code" : "340311"
          },
          {
            "id" : "1420",
            "name" : "怀远县",
            "zip_code" : "340321"
          },
          {
            "id" : "1421",
            "name" : "五河县",
            "zip_code" : "340322"
          },
          {
            "id" : "1422",
            "name" : "固镇县",
            "zip_code" : "340323"
          }
        ],
        "name" : "蚌埠",
        "zip_code" : "340300"
      },
      {
        "id" : "136",
        "areas" : [
          {
            "id" : "1423",
            "name" : "市辖区",
            "zip_code" : "340401"
          },
          {
            "id" : "1424",
            "name" : "大通区",
            "zip_code" : "340402"
          },
          {
            "id" : "1425",
            "name" : "田家庵区",
            "zip_code" : "340403"
          },
          {
            "id" : "1426",
            "name" : "谢家集区",
            "zip_code" : "340404"
          },
          {
            "id" : "1427",
            "name" : "八公山区",
            "zip_code" : "340405"
          },
          {
            "id" : "1428",
            "name" : "潘集区",
            "zip_code" : "340406"
          },
          {
            "id" : "1429",
            "name" : "凤台县",
            "zip_code" : "340421"
          }
        ],
        "name" : "淮南",
        "zip_code" : "340400"
      },
      {
        "id" : "137",
        "areas" : [
          {
            "id" : "1430",
            "name" : "市辖区",
            "zip_code" : "340501"
          },
          {
            "id" : "1431",
            "name" : "金家庄区",
            "zip_code" : "340502"
          },
          {
            "id" : "1432",
            "name" : "花山区",
            "zip_code" : "340503"
          },
          {
            "id" : "1433",
            "name" : "雨山区",
            "zip_code" : "340504"
          },
          {
            "id" : "1434",
            "name" : "当涂县",
            "zip_code" : "340521"
          }
        ],
        "name" : "马鞍山",
        "zip_code" : "340500"
      },
      {
        "id" : "138",
        "areas" : [
          {
            "id" : "1435",
            "name" : "市辖区",
            "zip_code" : "340601"
          },
          {
            "id" : "1436",
            "name" : "杜集区",
            "zip_code" : "340602"
          },
          {
            "id" : "1437",
            "name" : "相山区",
            "zip_code" : "340603"
          },
          {
            "id" : "1438",
            "name" : "烈山区",
            "zip_code" : "340604"
          },
          {
            "id" : "1439",
            "name" : "濉溪县",
            "zip_code" : "340621"
          }
        ],
        "name" : "淮北",
        "zip_code" : "340600"
      },
      {
        "id" : "139",
        "areas" : [
          {
            "id" : "1440",
            "name" : "市辖区",
            "zip_code" : "340701"
          },
          {
            "id" : "1441",
            "name" : "铜官山区",
            "zip_code" : "340702"
          },
          {
            "id" : "1442",
            "name" : "狮子山区",
            "zip_code" : "340703"
          },
          {
            "id" : "1443",
            "name" : "郊区",
            "zip_code" : "340711"
          },
          {
            "id" : "1444",
            "name" : "铜陵县",
            "zip_code" : "340721"
          }
        ],
        "name" : "铜陵",
        "zip_code" : "340700"
      },
      {
        "id" : "140",
        "areas" : [
          {
            "id" : "1445",
            "name" : "市辖区",
            "zip_code" : "340801"
          },
          {
            "id" : "1446",
            "name" : "迎江区",
            "zip_code" : "340802"
          },
          {
            "id" : "1447",
            "name" : "大观区",
            "zip_code" : "340803"
          },
          {
            "id" : "1448",
            "name" : "宜秀区",
            "zip_code" : "340811"
          },
          {
            "id" : "1449",
            "name" : "怀宁县",
            "zip_code" : "340822"
          },
          {
            "id" : "1450",
            "name" : "枞阳县",
            "zip_code" : "340823"
          },
          {
            "id" : "1451",
            "name" : "潜山县",
            "zip_code" : "340824"
          },
          {
            "id" : "1452",
            "name" : "太湖县",
            "zip_code" : "340825"
          },
          {
            "id" : "1453",
            "name" : "宿松县",
            "zip_code" : "340826"
          },
          {
            "id" : "1454",
            "name" : "望江县",
            "zip_code" : "340827"
          },
          {
            "id" : "1455",
            "name" : "岳西县",
            "zip_code" : "340828"
          },
          {
            "id" : "1456",
            "name" : "桐城市",
            "zip_code" : "340881"
          }
        ],
        "name" : "安庆",
        "zip_code" : "340800"
      },
      {
        "id" : "141",
        "areas" : [
          {
            "id" : "1457",
            "name" : "市辖区",
            "zip_code" : "341001"
          },
          {
            "id" : "1458",
            "name" : "屯溪区",
            "zip_code" : "341002"
          },
          {
            "id" : "1459",
            "name" : "黄山区",
            "zip_code" : "341003"
          },
          {
            "id" : "1460",
            "name" : "徽州区",
            "zip_code" : "341004"
          },
          {
            "id" : "1461",
            "name" : "歙县",
            "zip_code" : "341021"
          },
          {
            "id" : "1462",
            "name" : "休宁县",
            "zip_code" : "341022"
          },
          {
            "id" : "1463",
            "name" : "黟县",
            "zip_code" : "341023"
          },
          {
            "id" : "1464",
            "name" : "祁门县",
            "zip_code" : "341024"
          }
        ],
        "name" : "黄山",
        "zip_code" : "341000"
      },
      {
        "id" : "142",
        "areas" : [
          {
            "id" : "1465",
            "name" : "市辖区",
            "zip_code" : "341101"
          },
          {
            "id" : "1466",
            "name" : "琅琊区",
            "zip_code" : "341102"
          },
          {
            "id" : "1467",
            "name" : "南谯区",
            "zip_code" : "341103"
          },
          {
            "id" : "1468",
            "name" : "来安县",
            "zip_code" : "341122"
          },
          {
            "id" : "1469",
            "name" : "全椒县",
            "zip_code" : "341124"
          },
          {
            "id" : "1470",
            "name" : "定远县",
            "zip_code" : "341125"
          },
          {
            "id" : "1471",
            "name" : "凤阳县",
            "zip_code" : "341126"
          },
          {
            "id" : "1472",
            "name" : "天长市",
            "zip_code" : "341181"
          },
          {
            "id" : "1473",
            "name" : "明光市",
            "zip_code" : "341182"
          }
        ],
        "name" : "滁州",
        "zip_code" : "341100"
      },
      {
        "id" : "143",
        "areas" : [
          {
            "id" : "1474",
            "name" : "市辖区",
            "zip_code" : "341201"
          },
          {
            "id" : "1475",
            "name" : "颍州区",
            "zip_code" : "341202"
          },
          {
            "id" : "1476",
            "name" : "颍东区",
            "zip_code" : "341203"
          },
          {
            "id" : "1477",
            "name" : "颍泉区",
            "zip_code" : "341204"
          },
          {
            "id" : "1478",
            "name" : "临泉县",
            "zip_code" : "341221"
          },
          {
            "id" : "1479",
            "name" : "太和县",
            "zip_code" : "341222"
          },
          {
            "id" : "1480",
            "name" : "阜南县",
            "zip_code" : "341225"
          },
          {
            "id" : "1481",
            "name" : "颍上县",
            "zip_code" : "341226"
          },
          {
            "id" : "1482",
            "name" : "界首市",
            "zip_code" : "341282"
          }
        ],
        "name" : "阜阳",
        "zip_code" : "341200"
      },
      {
        "id" : "144",
        "areas" : [
          {
            "id" : "1483",
            "name" : "市辖区",
            "zip_code" : "341301"
          },
          {
            "id" : "1484",
            "name" : "埇桥区",
            "zip_code" : "341302"
          },
          {
            "id" : "1485",
            "name" : "砀山县",
            "zip_code" : "341321"
          },
          {
            "id" : "1486",
            "name" : "萧县",
            "zip_code" : "341322"
          },
          {
            "id" : "1487",
            "name" : "灵璧县",
            "zip_code" : "341323"
          },
          {
            "id" : "1488",
            "name" : "泗县",
            "zip_code" : "341324"
          }
        ],
        "name" : "宿州",
        "zip_code" : "341300"
      },
      {
        "id" : "145",
        "areas" : [
          {
            "id" : "1489",
            "name" : "市辖区",
            "zip_code" : "341401"
          },
          {
            "id" : "1490",
            "name" : "居巢区",
            "zip_code" : "341402"
          },
          {
            "id" : "1491",
            "name" : "庐江县",
            "zip_code" : "341421"
          },
          {
            "id" : "1492",
            "name" : "无为县",
            "zip_code" : "341422"
          },
          {
            "id" : "1493",
            "name" : "含山县",
            "zip_code" : "341423"
          },
          {
            "id" : "1494",
            "name" : "和县",
            "zip_code" : "341424"
          }
        ],
        "name" : "巢湖",
        "zip_code" : "341400"
      },
      {
        "id" : "146",
        "areas" : [
          {
            "id" : "1495",
            "name" : "市辖区",
            "zip_code" : "341501"
          },
          {
            "id" : "1496",
            "name" : "金安区",
            "zip_code" : "341502"
          },
          {
            "id" : "1497",
            "name" : "裕安区",
            "zip_code" : "341503"
          },
          {
            "id" : "1498",
            "name" : "寿县",
            "zip_code" : "341521"
          },
          {
            "id" : "1499",
            "name" : "霍邱县",
            "zip_code" : "341522"
          },
          {
            "id" : "1500",
            "name" : "舒城县",
            "zip_code" : "341523"
          },
          {
            "id" : "1501",
            "name" : "金寨县",
            "zip_code" : "341524"
          },
          {
            "id" : "1502",
            "name" : "霍山县",
            "zip_code" : "341525"
          }
        ],
        "name" : "六安",
        "zip_code" : "341500"
      },
      {
        "id" : "147",
        "areas" : [
          {
            "id" : "1503",
            "name" : "市辖区",
            "zip_code" : "341601"
          },
          {
            "id" : "1504",
            "name" : "谯城区",
            "zip_code" : "341602"
          },
          {
            "id" : "1505",
            "name" : "涡阳县",
            "zip_code" : "341621"
          },
          {
            "id" : "1506",
            "name" : "蒙城县",
            "zip_code" : "341622"
          },
          {
            "id" : "1507",
            "name" : "利辛县",
            "zip_code" : "341623"
          }
        ],
        "name" : "亳州",
        "zip_code" : "341600"
      },
      {
        "id" : "148",
        "areas" : [
          {
            "id" : "1508",
            "name" : "市辖区",
            "zip_code" : "341701"
          },
          {
            "id" : "1509",
            "name" : "贵池区",
            "zip_code" : "341702"
          },
          {
            "id" : "1510",
            "name" : "东至县",
            "zip_code" : "341721"
          },
          {
            "id" : "1511",
            "name" : "石台县",
            "zip_code" : "341722"
          },
          {
            "id" : "1512",
            "name" : "青阳县",
            "zip_code" : "341723"
          }
        ],
        "name" : "池州",
        "zip_code" : "341700"
      },
      {
        "id" : "149",
        "areas" : [
          {
            "id" : "1513",
            "name" : "市辖区",
            "zip_code" : "341801"
          },
          {
            "id" : "1514",
            "name" : "宣州区",
            "zip_code" : "341802"
          },
          {
            "id" : "1515",
            "name" : "郎溪县",
            "zip_code" : "341821"
          },
          {
            "id" : "1516",
            "name" : "广德县",
            "zip_code" : "341822"
          },
          {
            "id" : "1517",
            "name" : "泾县",
            "zip_code" : "341823"
          },
          {
            "id" : "1518",
            "name" : "绩溪县",
            "zip_code" : "341824"
          },
          {
            "id" : "1519",
            "name" : "旌德县",
            "zip_code" : "341825"
          },
          {
            "id" : "1520",
            "name" : "宁国市",
            "zip_code" : "341881"
          }
        ],
        "name" : "宣城",
        "zip_code" : "341800"
      }
    ],
    "id" : "13",
    "name" : "安徽",
    "zip_code" : "340000"
  },
  {
    "cities" : [
      {
        "id" : "150",
        "areas" : [
          {
            "id" : "1521",
            "name" : "市辖区",
            "zip_code" : "350101"
          },
          {
            "id" : "1522",
            "name" : "鼓楼区",
            "zip_code" : "350102"
          },
          {
            "id" : "1523",
            "name" : "台江区",
            "zip_code" : "350103"
          },
          {
            "id" : "1524",
            "name" : "仓山区",
            "zip_code" : "350104"
          },
          {
            "id" : "1525",
            "name" : "马尾区",
            "zip_code" : "350105"
          },
          {
            "id" : "1526",
            "name" : "晋安区",
            "zip_code" : "350111"
          },
          {
            "id" : "1527",
            "name" : "闽侯县",
            "zip_code" : "350121"
          },
          {
            "id" : "1528",
            "name" : "连江县",
            "zip_code" : "350122"
          },
          {
            "id" : "1529",
            "name" : "罗源县",
            "zip_code" : "350123"
          },
          {
            "id" : "1530",
            "name" : "闽清县",
            "zip_code" : "350124"
          },
          {
            "id" : "1531",
            "name" : "永泰县",
            "zip_code" : "350125"
          },
          {
            "id" : "1532",
            "name" : "平潭县",
            "zip_code" : "350128"
          },
          {
            "id" : "1533",
            "name" : "福清市",
            "zip_code" : "350181"
          },
          {
            "id" : "1534",
            "name" : "长乐市",
            "zip_code" : "350182"
          }
        ],
        "name" : "福州",
        "zip_code" : "350100"
      },
      {
        "id" : "151",
        "areas" : [
          {
            "id" : "1535",
            "name" : "市辖区",
            "zip_code" : "350201"
          },
          {
            "id" : "1536",
            "name" : "思明区",
            "zip_code" : "350203"
          },
          {
            "id" : "1537",
            "name" : "海沧区",
            "zip_code" : "350205"
          },
          {
            "id" : "1538",
            "name" : "湖里区",
            "zip_code" : "350206"
          },
          {
            "id" : "1539",
            "name" : "集美区",
            "zip_code" : "350211"
          },
          {
            "id" : "1540",
            "name" : "同安区",
            "zip_code" : "350212"
          },
          {
            "id" : "1541",
            "name" : "翔安区",
            "zip_code" : "350213"
          }
        ],
        "name" : "厦门",
        "zip_code" : "350200"
      },
      {
        "id" : "152",
        "areas" : [
          {
            "id" : "1542",
            "name" : "市辖区",
            "zip_code" : "350301"
          },
          {
            "id" : "1543",
            "name" : "城厢区",
            "zip_code" : "350302"
          },
          {
            "id" : "1544",
            "name" : "涵江区",
            "zip_code" : "350303"
          },
          {
            "id" : "1545",
            "name" : "荔城区",
            "zip_code" : "350304"
          },
          {
            "id" : "1546",
            "name" : "秀屿区",
            "zip_code" : "350305"
          },
          {
            "id" : "1547",
            "name" : "仙游县",
            "zip_code" : "350322"
          }
        ],
        "name" : "莆田",
        "zip_code" : "350300"
      },
      {
        "id" : "153",
        "areas" : [
          {
            "id" : "1548",
            "name" : "市辖区",
            "zip_code" : "350401"
          },
          {
            "id" : "1549",
            "name" : "梅列区",
            "zip_code" : "350402"
          },
          {
            "id" : "1550",
            "name" : "三元区",
            "zip_code" : "350403"
          },
          {
            "id" : "1551",
            "name" : "明溪县",
            "zip_code" : "350421"
          },
          {
            "id" : "1552",
            "name" : "清流县",
            "zip_code" : "350423"
          },
          {
            "id" : "1553",
            "name" : "宁化县",
            "zip_code" : "350424"
          },
          {
            "id" : "1554",
            "name" : "大田县",
            "zip_code" : "350425"
          },
          {
            "id" : "1555",
            "name" : "尤溪县",
            "zip_code" : "350426"
          },
          {
            "id" : "1556",
            "name" : "沙县",
            "zip_code" : "350427"
          },
          {
            "id" : "1557",
            "name" : "将乐县",
            "zip_code" : "350428"
          },
          {
            "id" : "1558",
            "name" : "泰宁县",
            "zip_code" : "350429"
          },
          {
            "id" : "1559",
            "name" : "建宁县",
            "zip_code" : "350430"
          },
          {
            "id" : "1560",
            "name" : "永安市",
            "zip_code" : "350481"
          }
        ],
        "name" : "三明",
        "zip_code" : "350400"
      },
      {
        "id" : "154",
        "areas" : [
          {
            "id" : "1561",
            "name" : "市辖区",
            "zip_code" : "350501"
          },
          {
            "id" : "1562",
            "name" : "鲤城区",
            "zip_code" : "350502"
          },
          {
            "id" : "1563",
            "name" : "丰泽区",
            "zip_code" : "350503"
          },
          {
            "id" : "1564",
            "name" : "洛江区",
            "zip_code" : "350504"
          },
          {
            "id" : "1565",
            "name" : "泉港区",
            "zip_code" : "350505"
          },
          {
            "id" : "1566",
            "name" : "惠安县",
            "zip_code" : "350521"
          },
          {
            "id" : "1567",
            "name" : "安溪县",
            "zip_code" : "350524"
          },
          {
            "id" : "1568",
            "name" : "永春县",
            "zip_code" : "350525"
          },
          {
            "id" : "1569",
            "name" : "德化县",
            "zip_code" : "350526"
          },
          {
            "id" : "1570",
            "name" : "金门县",
            "zip_code" : "350527"
          },
          {
            "id" : "1571",
            "name" : "石狮市",
            "zip_code" : "350581"
          },
          {
            "id" : "1572",
            "name" : "晋江市",
            "zip_code" : "350582"
          },
          {
            "id" : "1573",
            "name" : "南安市",
            "zip_code" : "350583"
          }
        ],
        "name" : "泉州",
        "zip_code" : "350500"
      },
      {
        "id" : "155",
        "areas" : [
          {
            "id" : "1574",
            "name" : "市辖区",
            "zip_code" : "350601"
          },
          {
            "id" : "1575",
            "name" : "芗城区",
            "zip_code" : "350602"
          },
          {
            "id" : "1576",
            "name" : "龙文区",
            "zip_code" : "350603"
          },
          {
            "id" : "1577",
            "name" : "云霄县",
            "zip_code" : "350622"
          },
          {
            "id" : "1578",
            "name" : "漳浦县",
            "zip_code" : "350623"
          },
          {
            "id" : "1579",
            "name" : "诏安县",
            "zip_code" : "350624"
          },
          {
            "id" : "1580",
            "name" : "长泰县",
            "zip_code" : "350625"
          },
          {
            "id" : "1581",
            "name" : "东山县",
            "zip_code" : "350626"
          },
          {
            "id" : "1582",
            "name" : "南靖县",
            "zip_code" : "350627"
          },
          {
            "id" : "1583",
            "name" : "平和县",
            "zip_code" : "350628"
          },
          {
            "id" : "1584",
            "name" : "华安县",
            "zip_code" : "350629"
          },
          {
            "id" : "1585",
            "name" : "龙海市",
            "zip_code" : "350681"
          }
        ],
        "name" : "漳州",
        "zip_code" : "350600"
      },
      {
        "id" : "156",
        "areas" : [
          {
            "id" : "1586",
            "name" : "市辖区",
            "zip_code" : "350701"
          },
          {
            "id" : "1587",
            "name" : "延平区",
            "zip_code" : "350702"
          },
          {
            "id" : "1588",
            "name" : "顺昌县",
            "zip_code" : "350721"
          },
          {
            "id" : "1589",
            "name" : "浦城县",
            "zip_code" : "350722"
          },
          {
            "id" : "1590",
            "name" : "光泽县",
            "zip_code" : "350723"
          },
          {
            "id" : "1591",
            "name" : "松溪县",
            "zip_code" : "350724"
          },
          {
            "id" : "1592",
            "name" : "政和县",
            "zip_code" : "350725"
          },
          {
            "id" : "1593",
            "name" : "邵武市",
            "zip_code" : "350781"
          },
          {
            "id" : "1594",
            "name" : "武夷山市",
            "zip_code" : "350782"
          },
          {
            "id" : "1595",
            "name" : "建瓯市",
            "zip_code" : "350783"
          },
          {
            "id" : "1596",
            "name" : "建阳市",
            "zip_code" : "350784"
          }
        ],
        "name" : "南平",
        "zip_code" : "350700"
      },
      {
        "id" : "157",
        "areas" : [
          {
            "id" : "1597",
            "name" : "市辖区",
            "zip_code" : "350801"
          },
          {
            "id" : "1598",
            "name" : "新罗区",
            "zip_code" : "350802"
          },
          {
            "id" : "1599",
            "name" : "长汀县",
            "zip_code" : "350821"
          },
          {
            "id" : "1600",
            "name" : "永定县",
            "zip_code" : "350822"
          },
          {
            "id" : "1601",
            "name" : "上杭县",
            "zip_code" : "350823"
          },
          {
            "id" : "1602",
            "name" : "武平县",
            "zip_code" : "350824"
          },
          {
            "id" : "1603",
            "name" : "连城县",
            "zip_code" : "350825"
          },
          {
            "id" : "1604",
            "name" : "漳平市",
            "zip_code" : "350881"
          }
        ],
        "name" : "龙岩",
        "zip_code" : "350800"
      },
      {
        "id" : "158",
        "areas" : [
          {
            "id" : "1605",
            "name" : "市辖区",
            "zip_code" : "350901"
          },
          {
            "id" : "1606",
            "name" : "蕉城区",
            "zip_code" : "350902"
          },
          {
            "id" : "1607",
            "name" : "霞浦县",
            "zip_code" : "350921"
          },
          {
            "id" : "1608",
            "name" : "古田县",
            "zip_code" : "350922"
          },
          {
            "id" : "1609",
            "name" : "屏南县",
            "zip_code" : "350923"
          },
          {
            "id" : "1610",
            "name" : "寿宁县",
            "zip_code" : "350924"
          },
          {
            "id" : "1611",
            "name" : "周宁县",
            "zip_code" : "350925"
          },
          {
            "id" : "1612",
            "name" : "柘荣县",
            "zip_code" : "350926"
          },
          {
            "id" : "1613",
            "name" : "福安市",
            "zip_code" : "350981"
          },
          {
            "id" : "1614",
            "name" : "福鼎市",
            "zip_code" : "350982"
          }
        ],
        "name" : "宁德",
        "zip_code" : "350900"
      }
    ],
    "id" : "14",
    "name" : "福建",
    "zip_code" : "350000"
  },
  {
    "cities" : [
      {
        "id" : "159",
        "areas" : [
          {
            "id" : "1615",
            "name" : "市辖区",
            "zip_code" : "360101"
          },
          {
            "id" : "1616",
            "name" : "东湖区",
            "zip_code" : "360102"
          },
          {
            "id" : "1617",
            "name" : "西湖区",
            "zip_code" : "360103"
          },
          {
            "id" : "1618",
            "name" : "青云谱区",
            "zip_code" : "360104"
          },
          {
            "id" : "1619",
            "name" : "湾里区",
            "zip_code" : "360105"
          },
          {
            "id" : "1620",
            "name" : "青山湖区",
            "zip_code" : "360111"
          },
          {
            "id" : "1621",
            "name" : "南昌县",
            "zip_code" : "360121"
          },
          {
            "id" : "1622",
            "name" : "新建县",
            "zip_code" : "360122"
          },
          {
            "id" : "1623",
            "name" : "安义县",
            "zip_code" : "360123"
          },
          {
            "id" : "1624",
            "name" : "进贤县",
            "zip_code" : "360124"
          }
        ],
        "name" : "南昌",
        "zip_code" : "360100"
      },
      {
        "id" : "160",
        "areas" : [
          {
            "id" : "1625",
            "name" : "市辖区",
            "zip_code" : "360201"
          },
          {
            "id" : "1626",
            "name" : "昌江区",
            "zip_code" : "360202"
          },
          {
            "id" : "1627",
            "name" : "珠山区",
            "zip_code" : "360203"
          },
          {
            "id" : "1628",
            "name" : "浮梁县",
            "zip_code" : "360222"
          },
          {
            "id" : "1629",
            "name" : "乐平市",
            "zip_code" : "360281"
          }
        ],
        "name" : "景德镇",
        "zip_code" : "360200"
      },
      {
        "id" : "161",
        "areas" : [
          {
            "id" : "1630",
            "name" : "市辖区",
            "zip_code" : "360301"
          },
          {
            "id" : "1631",
            "name" : "安源区",
            "zip_code" : "360302"
          },
          {
            "id" : "1632",
            "name" : "湘东区",
            "zip_code" : "360313"
          },
          {
            "id" : "1633",
            "name" : "莲花县",
            "zip_code" : "360321"
          },
          {
            "id" : "1634",
            "name" : "上栗县",
            "zip_code" : "360322"
          },
          {
            "id" : "1635",
            "name" : "芦溪县",
            "zip_code" : "360323"
          }
        ],
        "name" : "萍乡",
        "zip_code" : "360300"
      },
      {
        "id" : "162",
        "areas" : [
          {
            "id" : "1636",
            "name" : "市辖区",
            "zip_code" : "360401"
          },
          {
            "id" : "1637",
            "name" : "庐山区",
            "zip_code" : "360402"
          },
          {
            "id" : "1638",
            "name" : "浔阳区",
            "zip_code" : "360403"
          },
          {
            "id" : "1639",
            "name" : "九江县",
            "zip_code" : "360421"
          },
          {
            "id" : "1640",
            "name" : "武宁县",
            "zip_code" : "360423"
          },
          {
            "id" : "1641",
            "name" : "修水县",
            "zip_code" : "360424"
          },
          {
            "id" : "1642",
            "name" : "永修县",
            "zip_code" : "360425"
          },
          {
            "id" : "1643",
            "name" : "德安县",
            "zip_code" : "360426"
          },
          {
            "id" : "1644",
            "name" : "星子县",
            "zip_code" : "360427"
          },
          {
            "id" : "1645",
            "name" : "都昌县",
            "zip_code" : "360428"
          },
          {
            "id" : "1646",
            "name" : "湖口县",
            "zip_code" : "360429"
          },
          {
            "id" : "1647",
            "name" : "彭泽县",
            "zip_code" : "360430"
          },
          {
            "id" : "1648",
            "name" : "瑞昌市",
            "zip_code" : "360481"
          },
          {
            "id" : "4300",
            "name" : "共青城市",
            "zip_code" : "360482"
          }
        ],
        "name" : "九江",
        "zip_code" : "360400"
      },
      {
        "id" : "163",
        "areas" : [
          {
            "id" : "1649",
            "name" : "市辖区",
            "zip_code" : "360501"
          },
          {
            "id" : "1650",
            "name" : "渝水区",
            "zip_code" : "360502"
          },
          {
            "id" : "1651",
            "name" : "分宜县",
            "zip_code" : "360521"
          }
        ],
        "name" : "新余",
        "zip_code" : "360500"
      },
      {
        "id" : "164",
        "areas" : [
          {
            "id" : "1652",
            "name" : "市辖区",
            "zip_code" : "360601"
          },
          {
            "id" : "1653",
            "name" : "月湖区",
            "zip_code" : "360602"
          },
          {
            "id" : "1654",
            "name" : "余江县",
            "zip_code" : "360622"
          },
          {
            "id" : "1655",
            "name" : "贵溪市",
            "zip_code" : "360681"
          }
        ],
        "name" : "鹰潭",
        "zip_code" : "360600"
      },
      {
        "id" : "165",
        "areas" : [
          {
            "id" : "1656",
            "name" : "市辖区",
            "zip_code" : "360701"
          },
          {
            "id" : "1657",
            "name" : "章贡区",
            "zip_code" : "360702"
          },
          {
            "id" : "1658",
            "name" : "赣县",
            "zip_code" : "360721"
          },
          {
            "id" : "1659",
            "name" : "信丰县",
            "zip_code" : "360722"
          },
          {
            "id" : "1660",
            "name" : "大余县",
            "zip_code" : "360723"
          },
          {
            "id" : "1661",
            "name" : "上犹县",
            "zip_code" : "360724"
          },
          {
            "id" : "1662",
            "name" : "崇义县",
            "zip_code" : "360725"
          },
          {
            "id" : "1663",
            "name" : "安远县",
            "zip_code" : "360726"
          },
          {
            "id" : "1664",
            "name" : "龙南县",
            "zip_code" : "360727"
          },
          {
            "id" : "1665",
            "name" : "定南县",
            "zip_code" : "360728"
          },
          {
            "id" : "1666",
            "name" : "全南县",
            "zip_code" : "360729"
          },
          {
            "id" : "1667",
            "name" : "宁都县",
            "zip_code" : "360730"
          },
          {
            "id" : "1668",
            "name" : "于都县",
            "zip_code" : "360731"
          },
          {
            "id" : "1669",
            "name" : "兴国县",
            "zip_code" : "360732"
          },
          {
            "id" : "1670",
            "name" : "会昌县",
            "zip_code" : "360733"
          },
          {
            "id" : "1671",
            "name" : "寻乌县",
            "zip_code" : "360734"
          },
          {
            "id" : "1672",
            "name" : "石城县",
            "zip_code" : "360735"
          },
          {
            "id" : "1673",
            "name" : "瑞金市",
            "zip_code" : "360781"
          },
          {
            "id" : "1674",
            "name" : "南康市",
            "zip_code" : "360782"
          }
        ],
        "name" : "赣州",
        "zip_code" : "360700"
      },
      {
        "id" : "166",
        "areas" : [
          {
            "id" : "1675",
            "name" : "市辖区",
            "zip_code" : "360801"
          },
          {
            "id" : "1676",
            "name" : "吉州区",
            "zip_code" : "360802"
          },
          {
            "id" : "1677",
            "name" : "青原区",
            "zip_code" : "360803"
          },
          {
            "id" : "1678",
            "name" : "吉安县",
            "zip_code" : "360821"
          },
          {
            "id" : "1679",
            "name" : "吉水县",
            "zip_code" : "360822"
          },
          {
            "id" : "1680",
            "name" : "峡江县",
            "zip_code" : "360823"
          },
          {
            "id" : "1681",
            "name" : "新干县",
            "zip_code" : "360824"
          },
          {
            "id" : "1682",
            "name" : "永丰县",
            "zip_code" : "360825"
          },
          {
            "id" : "1683",
            "name" : "泰和县",
            "zip_code" : "360826"
          },
          {
            "id" : "1684",
            "name" : "遂川县",
            "zip_code" : "360827"
          },
          {
            "id" : "1685",
            "name" : "万安县",
            "zip_code" : "360828"
          },
          {
            "id" : "1686",
            "name" : "安福县",
            "zip_code" : "360829"
          },
          {
            "id" : "1687",
            "name" : "永新县",
            "zip_code" : "360830"
          },
          {
            "id" : "1688",
            "name" : "井冈山市",
            "zip_code" : "360881"
          }
        ],
        "name" : "吉安",
        "zip_code" : "360800"
      },
      {
        "id" : "167",
        "areas" : [
          {
            "id" : "1689",
            "name" : "市辖区",
            "zip_code" : "360901"
          },
          {
            "id" : "1690",
            "name" : "袁州区",
            "zip_code" : "360902"
          },
          {
            "id" : "1691",
            "name" : "奉新县",
            "zip_code" : "360921"
          },
          {
            "id" : "1692",
            "name" : "万载县",
            "zip_code" : "360922"
          },
          {
            "id" : "1693",
            "name" : "上高县",
            "zip_code" : "360923"
          },
          {
            "id" : "1694",
            "name" : "宜丰县",
            "zip_code" : "360924"
          },
          {
            "id" : "1695",
            "name" : "靖安县",
            "zip_code" : "360925"
          },
          {
            "id" : "1696",
            "name" : "铜鼓县",
            "zip_code" : "360926"
          },
          {
            "id" : "1697",
            "name" : "丰城市",
            "zip_code" : "360981"
          },
          {
            "id" : "1698",
            "name" : "樟树市",
            "zip_code" : "360982"
          },
          {
            "id" : "1699",
            "name" : "高安市",
            "zip_code" : "360983"
          }
        ],
        "name" : "宜春",
        "zip_code" : "360900"
      },
      {
        "id" : "168",
        "areas" : [
          {
            "id" : "1700",
            "name" : "市辖区",
            "zip_code" : "361001"
          },
          {
            "id" : "1701",
            "name" : "临川区",
            "zip_code" : "361002"
          },
          {
            "id" : "1702",
            "name" : "南城县",
            "zip_code" : "361021"
          },
          {
            "id" : "1703",
            "name" : "黎川县",
            "zip_code" : "361022"
          },
          {
            "id" : "1704",
            "name" : "南丰县",
            "zip_code" : "361023"
          },
          {
            "id" : "1705",
            "name" : "崇仁县",
            "zip_code" : "361024"
          },
          {
            "id" : "1706",
            "name" : "乐安县",
            "zip_code" : "361025"
          },
          {
            "id" : "1707",
            "name" : "宜黄县",
            "zip_code" : "361026"
          },
          {
            "id" : "1708",
            "name" : "金溪县",
            "zip_code" : "361027"
          },
          {
            "id" : "1709",
            "name" : "资溪县",
            "zip_code" : "361028"
          },
          {
            "id" : "1710",
            "name" : "东乡县",
            "zip_code" : "361029"
          },
          {
            "id" : "1711",
            "name" : "广昌县",
            "zip_code" : "361030"
          }
        ],
        "name" : "抚州",
        "zip_code" : "361000"
      },
      {
        "id" : "169",
        "areas" : [
          {
            "id" : "1712",
            "name" : "市辖区",
            "zip_code" : "361101"
          },
          {
            "id" : "1713",
            "name" : "信州区",
            "zip_code" : "361102"
          },
          {
            "id" : "1714",
            "name" : "上饶县",
            "zip_code" : "361121"
          },
          {
            "id" : "1715",
            "name" : "广丰县",
            "zip_code" : "361122"
          },
          {
            "id" : "1716",
            "name" : "玉山县",
            "zip_code" : "361123"
          },
          {
            "id" : "1717",
            "name" : "铅山县",
            "zip_code" : "361124"
          },
          {
            "id" : "1718",
            "name" : "横峰县",
            "zip_code" : "361125"
          },
          {
            "id" : "1719",
            "name" : "弋阳县",
            "zip_code" : "361126"
          },
          {
            "id" : "1720",
            "name" : "余干县",
            "zip_code" : "361127"
          },
          {
            "id" : "1721",
            "name" : "鄱阳县",
            "zip_code" : "361128"
          },
          {
            "id" : "1722",
            "name" : "万年县",
            "zip_code" : "361129"
          },
          {
            "id" : "1723",
            "name" : "婺源县",
            "zip_code" : "361130"
          },
          {
            "id" : "1724",
            "name" : "德兴市",
            "zip_code" : "361181"
          }
        ],
        "name" : "上饶",
        "zip_code" : "361100"
      }
    ],
    "id" : "15",
    "name" : "江西",
    "zip_code" : "360000"
  },
  {
    "cities" : [
      {
        "id" : "170",
        "areas" : [
          {
            "id" : "1725",
            "name" : "市辖区",
            "zip_code" : "370101"
          },
          {
            "id" : "1726",
            "name" : "历下区",
            "zip_code" : "370102"
          },
          {
            "id" : "1727",
            "name" : "市中区",
            "zip_code" : "370101"
          },
          {
            "id" : "1728",
            "name" : "槐荫区",
            "zip_code" : "370104"
          },
          {
            "id" : "1729",
            "name" : "天桥区",
            "zip_code" : "370105"
          },
          {
            "id" : "1730",
            "name" : "历城区",
            "zip_code" : "370112"
          },
          {
            "id" : "1731",
            "name" : "长清区",
            "zip_code" : "370113"
          },
          {
            "id" : "1732",
            "name" : "平阴县",
            "zip_code" : "370124"
          },
          {
            "id" : "1733",
            "name" : "济阳县",
            "zip_code" : "370125"
          },
          {
            "id" : "1734",
            "name" : "商河县",
            "zip_code" : "370126"
          },
          {
            "id" : "1735",
            "name" : "章丘市",
            "zip_code" : "370181"
          }
        ],
        "name" : "济南",
        "zip_code" : "370100"
      },
      {
        "id" : "171",
        "areas" : [
          {
            "id" : "1736",
            "name" : "市辖区",
            "zip_code" : "370201"
          },
          {
            "id" : "1737",
            "name" : "市南区",
            "zip_code" : "370202"
          },
          {
            "id" : "1738",
            "name" : "市北区",
            "zip_code" : "370203"
          },
          {
            "id" : "1739",
            "name" : "四方区",
            "zip_code" : "370205"
          },
          {
            "id" : "1740",
            "name" : "黄岛区",
            "zip_code" : "370211"
          },
          {
            "id" : "1741",
            "name" : "崂山区",
            "zip_code" : "370212"
          },
          {
            "id" : "1742",
            "name" : "李沧区",
            "zip_code" : "370213"
          },
          {
            "id" : "1743",
            "name" : "城阳区",
            "zip_code" : "370214"
          },
          {
            "id" : "1744",
            "name" : "胶州市",
            "zip_code" : "370281"
          },
          {
            "id" : "1745",
            "name" : "即墨市",
            "zip_code" : "370282"
          },
          {
            "id" : "1746",
            "name" : "平度市",
            "zip_code" : "370283"
          },
          {
            "id" : "1747",
            "name" : "胶南市",
            "zip_code" : "370284"
          },
          {
            "id" : "1748",
            "name" : "莱西市",
            "zip_code" : "370285"
          }
        ],
        "name" : "青岛",
        "zip_code" : "370200"
      },
      {
        "id" : "172",
        "areas" : [
          {
            "id" : "1749",
            "name" : "市辖区",
            "zip_code" : "370301"
          },
          {
            "id" : "1750",
            "name" : "淄川区",
            "zip_code" : "370302"
          },
          {
            "id" : "1751",
            "name" : "张店区",
            "zip_code" : "370303"
          },
          {
            "id" : "1752",
            "name" : "博山区",
            "zip_code" : "370304"
          },
          {
            "id" : "1753",
            "name" : "临淄区",
            "zip_code" : "370305"
          },
          {
            "id" : "1754",
            "name" : "周村区",
            "zip_code" : "370306"
          },
          {
            "id" : "1755",
            "name" : "桓台县",
            "zip_code" : "370321"
          },
          {
            "id" : "1756",
            "name" : "高青县",
            "zip_code" : "370322"
          },
          {
            "id" : "1757",
            "name" : "沂源县",
            "zip_code" : "370323"
          }
        ],
        "name" : "淄博",
        "zip_code" : "370300"
      },
      {
        "id" : "173",
        "areas" : [
          {
            "id" : "1758",
            "name" : "市辖区",
            "zip_code" : "370401"
          },
          {
            "id" : "1759",
            "name" : "市中区",
            "zip_code" : "370402"
          },
          {
            "id" : "1760",
            "name" : "薛城区",
            "zip_code" : "370403"
          },
          {
            "id" : "1761",
            "name" : "峄城区",
            "zip_code" : "370404"
          },
          {
            "id" : "1762",
            "name" : "台儿庄区",
            "zip_code" : "370405"
          },
          {
            "id" : "1763",
            "name" : "山亭区",
            "zip_code" : "370406"
          },
          {
            "id" : "1764",
            "name" : "滕州市",
            "zip_code" : "370481"
          }
        ],
        "name" : "枣庄",
        "zip_code" : "370400"
      },
      {
        "id" : "174",
        "areas" : [
          {
            "id" : "1765",
            "name" : "市辖区",
            "zip_code" : "370501"
          },
          {
            "id" : "1766",
            "name" : "东营区",
            "zip_code" : "370502"
          },
          {
            "id" : "1767",
            "name" : "河口区",
            "zip_code" : "370503"
          },
          {
            "id" : "1768",
            "name" : "垦利县",
            "zip_code" : "370521"
          },
          {
            "id" : "1769",
            "name" : "利津县",
            "zip_code" : "370522"
          },
          {
            "id" : "1770",
            "name" : "广饶县",
            "zip_code" : "370523"
          }
        ],
        "name" : "东营",
        "zip_code" : "370500"
      },
      {
        "id" : "175",
        "areas" : [
          {
            "id" : "1771",
            "name" : "市辖区",
            "zip_code" : "370601"
          },
          {
            "id" : "1772",
            "name" : "芝罘区",
            "zip_code" : "370602"
          },
          {
            "id" : "1773",
            "name" : "福山区",
            "zip_code" : "370611"
          },
          {
            "id" : "1774",
            "name" : "牟平区",
            "zip_code" : "370612"
          },
          {
            "id" : "1775",
            "name" : "莱山区",
            "zip_code" : "370613"
          },
          {
            "id" : "1776",
            "name" : "长岛县",
            "zip_code" : "370634"
          },
          {
            "id" : "1777",
            "name" : "龙口市",
            "zip_code" : "370681"
          },
          {
            "id" : "1778",
            "name" : "莱阳市",
            "zip_code" : "370682"
          },
          {
            "id" : "1779",
            "name" : "莱州市",
            "zip_code" : "370683"
          },
          {
            "id" : "1780",
            "name" : "蓬莱市",
            "zip_code" : "370684"
          },
          {
            "id" : "1781",
            "name" : "招远市",
            "zip_code" : "370685"
          },
          {
            "id" : "1782",
            "name" : "栖霞市",
            "zip_code" : "370686"
          },
          {
            "id" : "1783",
            "name" : "海阳市",
            "zip_code" : "370687"
          }
        ],
        "name" : "烟台",
        "zip_code" : "370600"
      },
      {
        "id" : "176",
        "areas" : [
          {
            "id" : "1784",
            "name" : "市辖区",
            "zip_code" : "370701"
          },
          {
            "id" : "1785",
            "name" : "潍城区",
            "zip_code" : "370702"
          },
          {
            "id" : "1786",
            "name" : "寒亭区",
            "zip_code" : "370703"
          },
          {
            "id" : "1787",
            "name" : "坊子区",
            "zip_code" : "370704"
          },
          {
            "id" : "1788",
            "name" : "奎文区",
            "zip_code" : "370705"
          },
          {
            "id" : "1789",
            "name" : "临朐县",
            "zip_code" : "370724"
          },
          {
            "id" : "1790",
            "name" : "昌乐县",
            "zip_code" : "370725"
          },
          {
            "id" : "1791",
            "name" : "青州市",
            "zip_code" : "370781"
          },
          {
            "id" : "1792",
            "name" : "诸城市",
            "zip_code" : "370782"
          },
          {
            "id" : "1793",
            "name" : "寿光市",
            "zip_code" : "370783"
          },
          {
            "id" : "1794",
            "name" : "安丘市",
            "zip_code" : "370784"
          },
          {
            "id" : "1795",
            "name" : "高密市",
            "zip_code" : "370785"
          },
          {
            "id" : "1796",
            "name" : "昌邑市",
            "zip_code" : "370786"
          }
        ],
        "name" : "潍坊",
        "zip_code" : "370700"
      },
      {
        "id" : "177",
        "areas" : [
          {
            "id" : "1797",
            "name" : "市辖区",
            "zip_code" : "370801"
          },
          {
            "id" : "1798",
            "name" : "市中区",
            "zip_code" : "370802"
          },
          {
            "id" : "1799",
            "name" : "任城区",
            "zip_code" : "370811"
          },
          {
            "id" : "1800",
            "name" : "微山县",
            "zip_code" : "370826"
          },
          {
            "id" : "1801",
            "name" : "鱼台县",
            "zip_code" : "370827"
          },
          {
            "id" : "1802",
            "name" : "金乡县",
            "zip_code" : "370828"
          },
          {
            "id" : "1803",
            "name" : "嘉祥县",
            "zip_code" : "370829"
          },
          {
            "id" : "1804",
            "name" : "汶上县",
            "zip_code" : "370830"
          },
          {
            "id" : "1805",
            "name" : "泗水县",
            "zip_code" : "370831"
          },
          {
            "id" : "1806",
            "name" : "梁山县",
            "zip_code" : "370832"
          },
          {
            "id" : "1807",
            "name" : "曲阜市",
            "zip_code" : "370881"
          },
          {
            "id" : "1808",
            "name" : "兖州市",
            "zip_code" : "370882"
          },
          {
            "id" : "1809",
            "name" : "邹城市",
            "zip_code" : "370883"
          }
        ],
        "name" : "济宁",
        "zip_code" : "370800"
      },
      {
        "id" : "178",
        "areas" : [
          {
            "id" : "1810",
            "name" : "市辖区",
            "zip_code" : "370901"
          },
          {
            "id" : "1811",
            "name" : "泰山区",
            "zip_code" : "370902"
          },
          {
            "id" : "1812",
            "name" : "岱岳区",
            "zip_code" : "370911"
          },
          {
            "id" : "1813",
            "name" : "宁阳县",
            "zip_code" : "370921"
          },
          {
            "id" : "1814",
            "name" : "东平县",
            "zip_code" : "370923"
          },
          {
            "id" : "1815",
            "name" : "新泰市",
            "zip_code" : "370982"
          },
          {
            "id" : "1816",
            "name" : "肥城市",
            "zip_code" : "370983"
          }
        ],
        "name" : "泰安",
        "zip_code" : "370900"
      },
      {
        "id" : "179",
        "areas" : [
          {
            "id" : "1817",
            "name" : "市辖区",
            "zip_code" : "371001"
          },
          {
            "id" : "1818",
            "name" : "环翠区",
            "zip_code" : "371002"
          },
          {
            "id" : "1819",
            "name" : "文登市",
            "zip_code" : "371081"
          },
          {
            "id" : "1820",
            "name" : "荣成市",
            "zip_code" : "371082"
          },
          {
            "id" : "1821",
            "name" : "乳山市",
            "zip_code" : "371083"
          }
        ],
        "name" : "威海",
        "zip_code" : "371000"
      },
      {
        "id" : "180",
        "areas" : [
          {
            "id" : "1822",
            "name" : "市辖区",
            "zip_code" : "371101"
          },
          {
            "id" : "1823",
            "name" : "东港区",
            "zip_code" : "371102"
          },
          {
            "id" : "1824",
            "name" : "岚山区",
            "zip_code" : "371103"
          },
          {
            "id" : "1825",
            "name" : "五莲县",
            "zip_code" : "371121"
          },
          {
            "id" : "1826",
            "name" : "莒县",
            "zip_code" : "371122"
          }
        ],
        "name" : "日照",
        "zip_code" : "371100"
      },
      {
        "id" : "181",
        "areas" : [
          {
            "id" : "1827",
            "name" : "市辖区",
            "zip_code" : "371201"
          },
          {
            "id" : "1828",
            "name" : "莱城区",
            "zip_code" : "371202"
          },
          {
            "id" : "1829",
            "name" : "钢城区",
            "zip_code" : "371203"
          }
        ],
        "name" : "莱芜",
        "zip_code" : "371200"
      },
      {
        "id" : "182",
        "areas" : [
          {
            "id" : "1830",
            "name" : "市辖区",
            "zip_code" : "371301"
          },
          {
            "id" : "1831",
            "name" : "兰山区",
            "zip_code" : "371302"
          },
          {
            "id" : "1832",
            "name" : "罗庄区",
            "zip_code" : "371311"
          },
          {
            "id" : "1833",
            "name" : "河东区",
            "zip_code" : "371301"
          },
          {
            "id" : "1834",
            "name" : "沂南县",
            "zip_code" : "371321"
          },
          {
            "id" : "1835",
            "name" : "郯城县",
            "zip_code" : "371322"
          },
          {
            "id" : "1836",
            "name" : "沂水县",
            "zip_code" : "371323"
          },
          {
            "id" : "1837",
            "name" : "苍山县",
            "zip_code" : "371324"
          },
          {
            "id" : "1838",
            "name" : "费县",
            "zip_code" : "371325"
          },
          {
            "id" : "1839",
            "name" : "平邑县",
            "zip_code" : "371326"
          },
          {
            "id" : "1840",
            "name" : "莒南县",
            "zip_code" : "371327"
          },
          {
            "id" : "1841",
            "name" : "蒙阴县",
            "zip_code" : "371328"
          },
          {
            "id" : "1842",
            "name" : "临沭县",
            "zip_code" : "371329"
          }
        ],
        "name" : "临沂",
        "zip_code" : "371300"
      },
      {
        "id" : "183",
        "areas" : [
          {
            "id" : "1843",
            "name" : "市辖区",
            "zip_code" : "371401"
          },
          {
            "id" : "1844",
            "name" : "德城区",
            "zip_code" : "371402"
          },
          {
            "id" : "1845",
            "name" : "陵县",
            "zip_code" : "371421"
          },
          {
            "id" : "1846",
            "name" : "宁津县",
            "zip_code" : "371422"
          },
          {
            "id" : "1847",
            "name" : "庆云县",
            "zip_code" : "371423"
          },
          {
            "id" : "1848",
            "name" : "临邑县",
            "zip_code" : "371424"
          },
          {
            "id" : "1849",
            "name" : "齐河县",
            "zip_code" : "371425"
          },
          {
            "id" : "1850",
            "name" : "平原县",
            "zip_code" : "371426"
          },
          {
            "id" : "1851",
            "name" : "夏津县",
            "zip_code" : "371427"
          },
          {
            "id" : "1852",
            "name" : "武城县",
            "zip_code" : "371428"
          },
          {
            "id" : "1853",
            "name" : "乐陵市",
            "zip_code" : "371481"
          },
          {
            "id" : "1854",
            "name" : "禹城市",
            "zip_code" : "371482"
          }
        ],
        "name" : "德州",
        "zip_code" : "371400"
      },
      {
        "id" : "184",
        "areas" : [
          {
            "id" : "1855",
            "name" : "市辖区",
            "zip_code" : "371501"
          },
          {
            "id" : "1856",
            "name" : "东昌府区",
            "zip_code" : "371502"
          },
          {
            "id" : "1857",
            "name" : "阳谷县",
            "zip_code" : "371521"
          },
          {
            "id" : "1858",
            "name" : "莘县",
            "zip_code" : "371522"
          },
          {
            "id" : "1859",
            "name" : "茌平县",
            "zip_code" : "371523"
          },
          {
            "id" : "1860",
            "name" : "东阿县",
            "zip_code" : "371524"
          },
          {
            "id" : "1861",
            "name" : "冠县",
            "zip_code" : "371525"
          },
          {
            "id" : "1862",
            "name" : "高唐县",
            "zip_code" : "371526"
          },
          {
            "id" : "1863",
            "name" : "临清市",
            "zip_code" : "371581"
          }
        ],
        "name" : "聊城",
        "zip_code" : "371500"
      },
      {
        "id" : "185",
        "areas" : [
          {
            "id" : "1864",
            "name" : "市辖区",
            "zip_code" : "371601"
          },
          {
            "id" : "1865",
            "name" : "滨城区",
            "zip_code" : "371602"
          },
          {
            "id" : "1866",
            "name" : "惠民县",
            "zip_code" : "371621"
          },
          {
            "id" : "1867",
            "name" : "阳信县",
            "zip_code" : "371622"
          },
          {
            "id" : "1868",
            "name" : "无棣县",
            "zip_code" : "371623"
          },
          {
            "id" : "1869",
            "name" : "沾化县",
            "zip_code" : "371624"
          },
          {
            "id" : "1870",
            "name" : "博兴县",
            "zip_code" : "371625"
          },
          {
            "id" : "1871",
            "name" : "邹平县",
            "zip_code" : "371626"
          }
        ],
        "name" : "滨州",
        "zip_code" : "371600"
      },
      {
        "id" : "186",
        "areas" : [
          {
            "id" : "1873",
            "name" : "牡丹区",
            "zip_code" : "371702"
          },
          {
            "id" : "1874",
            "name" : "曹县",
            "zip_code" : "371721"
          },
          {
            "id" : "1875",
            "name" : "单县",
            "zip_code" : "371722"
          },
          {
            "id" : "1876",
            "name" : "成武县",
            "zip_code" : "371723"
          },
          {
            "id" : "1877",
            "name" : "巨野县",
            "zip_code" : "371724"
          },
          {
            "id" : "1878",
            "name" : "郓城县",
            "zip_code" : "371725"
          },
          {
            "id" : "1879",
            "name" : "鄄城县",
            "zip_code" : "371726"
          },
          {
            "id" : "1880",
            "name" : "定陶县",
            "zip_code" : "371727"
          },
          {
            "id" : "1881",
            "name" : "东明县",
            "zip_code" : "371728"
          }
        ],
        "name" : "菏泽",
        "zip_code" : "371700"
      }
    ],
    "id" : "16",
    "name" : "山东",
    "zip_code" : "370000"
  },
  {
    "cities" : [
      {
        "id" : "187",
        "areas" : [
          {
            "id" : "1882",
            "name" : "市辖区",
            "zip_code" : "410101"
          },
          {
            "id" : "1883",
            "name" : "中原区",
            "zip_code" : "410102"
          },
          {
            "id" : "1884",
            "name" : "二七区",
            "zip_code" : "410103"
          },
          {
            "id" : "1885",
            "name" : "管城回族区",
            "zip_code" : "410104"
          },
          {
            "id" : "1886",
            "name" : "金水区",
            "zip_code" : "410105"
          },
          {
            "id" : "1887",
            "name" : "上街区",
            "zip_code" : "410106"
          },
          {
            "id" : "1888",
            "name" : "惠济区",
            "zip_code" : "410108"
          },
          {
            "id" : "1889",
            "name" : "中牟县",
            "zip_code" : "410122"
          },
          {
            "id" : "1890",
            "name" : "巩义市",
            "zip_code" : "410181"
          },
          {
            "id" : "1891",
            "name" : "荥阳市",
            "zip_code" : "410182"
          },
          {
            "id" : "1892",
            "name" : "新密市",
            "zip_code" : "410183"
          },
          {
            "id" : "1893",
            "name" : "新郑市",
            "zip_code" : "410184"
          },
          {
            "id" : "1894",
            "name" : "登封市",
            "zip_code" : "410185"
          }
        ],
        "name" : "郑州",
        "zip_code" : "410100"
      },
      {
        "id" : "188",
        "areas" : [
          {
            "id" : "1895",
            "name" : "市辖区",
            "zip_code" : "410201"
          },
          {
            "id" : "1896",
            "name" : "龙亭区",
            "zip_code" : "410202"
          },
          {
            "id" : "1897",
            "name" : "顺河回族区",
            "zip_code" : "410203"
          },
          {
            "id" : "1898",
            "name" : "鼓楼区",
            "zip_code" : "410204"
          },
          {
            "id" : "1899",
            "name" : "禹王台区",
            "zip_code" : "410205"
          },
          {
            "id" : "1900",
            "name" : "金明区",
            "zip_code" : "410211"
          },
          {
            "id" : "1901",
            "name" : "杞县",
            "zip_code" : "410221"
          },
          {
            "id" : "1902",
            "name" : "通许县",
            "zip_code" : "410222"
          },
          {
            "id" : "1903",
            "name" : "尉氏县",
            "zip_code" : "410223"
          },
          {
            "id" : "1904",
            "name" : "开封县",
            "zip_code" : "410224"
          },
          {
            "id" : "1905",
            "name" : "兰考县",
            "zip_code" : "410225"
          }
        ],
        "name" : "开封",
        "zip_code" : "410200"
      },
      {
        "id" : "189",
        "areas" : [
          {
            "id" : "1906",
            "name" : "市辖区",
            "zip_code" : "410301"
          },
          {
            "id" : "1907",
            "name" : "老城区",
            "zip_code" : "410302"
          },
          {
            "id" : "1908",
            "name" : "西工区",
            "zip_code" : "410303"
          },
          {
            "id" : "1909",
            "name" : "瀍河回族区",
            "zip_code" : "410304"
          },
          {
            "id" : "1910",
            "name" : "涧西区",
            "zip_code" : "410305"
          },
          {
            "id" : "1911",
            "name" : "吉利区",
            "zip_code" : "410306"
          },
          {
            "id" : "1912",
            "name" : "洛龙区",
            "zip_code" : "410311"
          },
          {
            "id" : "1913",
            "name" : "孟津县",
            "zip_code" : "410322"
          },
          {
            "id" : "1914",
            "name" : "新安县",
            "zip_code" : "410323"
          },
          {
            "id" : "1915",
            "name" : "栾川县",
            "zip_code" : "410324"
          },
          {
            "id" : "1916",
            "name" : "嵩县",
            "zip_code" : "410325"
          },
          {
            "id" : "1917",
            "name" : "汝阳县",
            "zip_code" : "410326"
          },
          {
            "id" : "1918",
            "name" : "宜阳县",
            "zip_code" : "410327"
          },
          {
            "id" : "1919",
            "name" : "洛宁县",
            "zip_code" : "410328"
          },
          {
            "id" : "1920",
            "name" : "伊川县",
            "zip_code" : "410329"
          },
          {
            "id" : "1921",
            "name" : "偃师市",
            "zip_code" : "410381"
          }
        ],
        "name" : "洛阳",
        "zip_code" : "410300"
      },
      {
        "id" : "190",
        "areas" : [
          {
            "id" : "1922",
            "name" : "市辖区",
            "zip_code" : "410401"
          },
          {
            "id" : "1923",
            "name" : "新华区",
            "zip_code" : "410402"
          },
          {
            "id" : "1924",
            "name" : "卫东区",
            "zip_code" : "410403"
          },
          {
            "id" : "1925",
            "name" : "石龙区",
            "zip_code" : "410404"
          },
          {
            "id" : "1926",
            "name" : "湛河区",
            "zip_code" : "410411"
          },
          {
            "id" : "1927",
            "name" : "宝丰县",
            "zip_code" : "410421"
          },
          {
            "id" : "1928",
            "name" : "叶县",
            "zip_code" : "410422"
          },
          {
            "id" : "1929",
            "name" : "鲁山县",
            "zip_code" : "410423"
          },
          {
            "id" : "1930",
            "name" : "郏县",
            "zip_code" : "410425"
          },
          {
            "id" : "1931",
            "name" : "舞钢市",
            "zip_code" : "410481"
          },
          {
            "id" : "1932",
            "name" : "汝州市",
            "zip_code" : "410482"
          }
        ],
        "name" : "平顶山",
        "zip_code" : "410400"
      },
      {
        "id" : "191",
        "areas" : [
          {
            "id" : "1933",
            "name" : "市辖区",
            "zip_code" : "410501"
          },
          {
            "id" : "1934",
            "name" : "文峰区",
            "zip_code" : "410502"
          },
          {
            "id" : "1935",
            "name" : "北关区",
            "zip_code" : "410503"
          },
          {
            "id" : "1936",
            "name" : "殷都区",
            "zip_code" : "410505"
          },
          {
            "id" : "1937",
            "name" : "龙安区",
            "zip_code" : "410506"
          },
          {
            "id" : "1938",
            "name" : "安阳县",
            "zip_code" : "410522"
          },
          {
            "id" : "1939",
            "name" : "汤阴县",
            "zip_code" : "410523"
          },
          {
            "id" : "1940",
            "name" : "滑县",
            "zip_code" : "410526"
          },
          {
            "id" : "1941",
            "name" : "内黄县",
            "zip_code" : "410527"
          },
          {
            "id" : "1942",
            "name" : "林州市",
            "zip_code" : "410581"
          }
        ],
        "name" : "安阳",
        "zip_code" : "410500"
      },
      {
        "id" : "192",
        "areas" : [
          {
            "id" : "1943",
            "name" : "市辖区",
            "zip_code" : "410601"
          },
          {
            "id" : "1944",
            "name" : "鹤山区",
            "zip_code" : "410602"
          },
          {
            "id" : "1945",
            "name" : "山城区",
            "zip_code" : "410603"
          },
          {
            "id" : "1946",
            "name" : "淇滨区",
            "zip_code" : "410611"
          },
          {
            "id" : "1947",
            "name" : "浚县",
            "zip_code" : "410621"
          },
          {
            "id" : "1948",
            "name" : "淇县",
            "zip_code" : "410622"
          }
        ],
        "name" : "鹤壁",
        "zip_code" : "410600"
      },
      {
        "id" : "193",
        "areas" : [
          {
            "id" : "1949",
            "name" : "市辖区",
            "zip_code" : "410701"
          },
          {
            "id" : "1950",
            "name" : "红旗区",
            "zip_code" : "410702"
          },
          {
            "id" : "1951",
            "name" : "卫滨区",
            "zip_code" : "410703"
          },
          {
            "id" : "1952",
            "name" : "凤泉区",
            "zip_code" : "410704"
          },
          {
            "id" : "1953",
            "name" : "牧野区",
            "zip_code" : "410711"
          },
          {
            "id" : "1954",
            "name" : "新乡县",
            "zip_code" : "410721"
          },
          {
            "id" : "1955",
            "name" : "获嘉县",
            "zip_code" : "410724"
          },
          {
            "id" : "1956",
            "name" : "原阳县",
            "zip_code" : "410725"
          },
          {
            "id" : "1957",
            "name" : "延津县",
            "zip_code" : "410726"
          },
          {
            "id" : "1958",
            "name" : "封丘县",
            "zip_code" : "410727"
          },
          {
            "id" : "1959",
            "name" : "长垣县",
            "zip_code" : "410728"
          },
          {
            "id" : "1960",
            "name" : "卫辉市",
            "zip_code" : "410781"
          },
          {
            "id" : "1961",
            "name" : "辉县市",
            "zip_code" : "410782"
          }
        ],
        "name" : "新乡",
        "zip_code" : "410700"
      },
      {
        "id" : "194",
        "areas" : [
          {
            "id" : "1962",
            "name" : "市辖区",
            "zip_code" : "410801"
          },
          {
            "id" : "1963",
            "name" : "解放区",
            "zip_code" : "410802"
          },
          {
            "id" : "1964",
            "name" : "中站区",
            "zip_code" : "410803"
          },
          {
            "id" : "1965",
            "name" : "马村区",
            "zip_code" : "410804"
          },
          {
            "id" : "1966",
            "name" : "山阳区",
            "zip_code" : "410811"
          },
          {
            "id" : "1967",
            "name" : "修武县",
            "zip_code" : "410821"
          },
          {
            "id" : "1968",
            "name" : "博爱县",
            "zip_code" : "410822"
          },
          {
            "id" : "1969",
            "name" : "武陟县",
            "zip_code" : "410823"
          },
          {
            "id" : "1970",
            "name" : "温县",
            "zip_code" : "410825"
          },
          {
            "id" : "1971",
            "name" : "济源市",
            "zip_code" : "419001"
          },
          {
            "id" : "1972",
            "name" : "沁阳市",
            "zip_code" : "410882"
          },
          {
            "id" : "1973",
            "name" : "孟州市",
            "zip_code" : "410883"
          }
        ],
        "name" : "焦作",
        "zip_code" : "410800"
      },
      {
        "id" : "195",
        "areas" : [
          {
            "id" : "1974",
            "name" : "市辖区",
            "zip_code" : "410901"
          },
          {
            "id" : "1975",
            "name" : "华龙区",
            "zip_code" : "410902"
          },
          {
            "id" : "1976",
            "name" : "清丰县",
            "zip_code" : "410922"
          },
          {
            "id" : "1977",
            "name" : "南乐县",
            "zip_code" : "410923"
          },
          {
            "id" : "1978",
            "name" : "范县",
            "zip_code" : "410926"
          },
          {
            "id" : "1979",
            "name" : "台前县",
            "zip_code" : "410927"
          },
          {
            "id" : "1980",
            "name" : "濮阳县",
            "zip_code" : "410928"
          }
        ],
        "name" : "濮阳",
        "zip_code" : "410900"
      },
      {
        "id" : "196",
        "areas" : [
          {
            "id" : "1981",
            "name" : "市辖区",
            "zip_code" : "411001"
          },
          {
            "id" : "1982",
            "name" : "魏都区",
            "zip_code" : "411002"
          },
          {
            "id" : "1983",
            "name" : "许昌县",
            "zip_code" : "411023"
          },
          {
            "id" : "1984",
            "name" : "鄢陵县",
            "zip_code" : "411024"
          },
          {
            "id" : "1985",
            "name" : "襄城县",
            "zip_code" : "411025"
          },
          {
            "id" : "1986",
            "name" : "禹州市",
            "zip_code" : "411081"
          },
          {
            "id" : "1987",
            "name" : "长葛市",
            "zip_code" : "411082"
          }
        ],
        "name" : "许昌",
        "zip_code" : "411000"
      },
      {
        "id" : "197",
        "areas" : [
          {
            "id" : "1988",
            "name" : "市辖区",
            "zip_code" : "411101"
          },
          {
            "id" : "1989",
            "name" : "源汇区",
            "zip_code" : "411102"
          },
          {
            "id" : "1990",
            "name" : "郾城区",
            "zip_code" : "411103"
          },
          {
            "id" : "1991",
            "name" : "召陵区",
            "zip_code" : "411104"
          },
          {
            "id" : "1992",
            "name" : "舞阳县",
            "zip_code" : "411121"
          },
          {
            "id" : "1993",
            "name" : "临颍县",
            "zip_code" : "411122"
          }
        ],
        "name" : "漯河",
        "zip_code" : "411100"
      },
      {
        "id" : "198",
        "areas" : [
          {
            "id" : "1994",
            "name" : "市辖区",
            "zip_code" : "411201"
          },
          {
            "id" : "1995",
            "name" : "湖滨区",
            "zip_code" : "411202"
          },
          {
            "id" : "1996",
            "name" : "渑池县",
            "zip_code" : "411221"
          },
          {
            "id" : "1997",
            "name" : "陕县",
            "zip_code" : "411222"
          },
          {
            "id" : "1998",
            "name" : "卢氏县",
            "zip_code" : "411224"
          },
          {
            "id" : "1999",
            "name" : "义马市",
            "zip_code" : "411281"
          },
          {
            "id" : "2000",
            "name" : "灵宝市",
            "zip_code" : "411282"
          }
        ],
        "name" : "三门峡",
        "zip_code" : "411200"
      },
      {
        "id" : "199",
        "areas" : [
          {
            "id" : "2001",
            "name" : "市辖区",
            "zip_code" : "411301"
          },
          {
            "id" : "2002",
            "name" : "宛城区",
            "zip_code" : "411302"
          },
          {
            "id" : "2003",
            "name" : "卧龙区",
            "zip_code" : "411303"
          },
          {
            "id" : "2004",
            "name" : "南召县",
            "zip_code" : "411321"
          },
          {
            "id" : "2005",
            "name" : "方城县",
            "zip_code" : "411322"
          },
          {
            "id" : "2006",
            "name" : "西峡县",
            "zip_code" : "411323"
          },
          {
            "id" : "2007",
            "name" : "镇平县",
            "zip_code" : "411324"
          },
          {
            "id" : "2008",
            "name" : "内乡县",
            "zip_code" : "411325"
          },
          {
            "id" : "2009",
            "name" : "淅川县",
            "zip_code" : "411326"
          },
          {
            "id" : "2010",
            "name" : "社旗县",
            "zip_code" : "411327"
          },
          {
            "id" : "2011",
            "name" : "唐河县",
            "zip_code" : "411328"
          },
          {
            "id" : "2012",
            "name" : "新野县",
            "zip_code" : "411329"
          },
          {
            "id" : "2013",
            "name" : "桐柏县",
            "zip_code" : "411330"
          },
          {
            "id" : "2014",
            "name" : "邓州市",
            "zip_code" : "411381"
          }
        ],
        "name" : "南阳",
        "zip_code" : "411300"
      },
      {
        "id" : "200",
        "areas" : [
          {
            "id" : "2015",
            "name" : "市辖区",
            "zip_code" : "411401"
          },
          {
            "id" : "2016",
            "name" : "梁园区",
            "zip_code" : "411402"
          },
          {
            "id" : "2017",
            "name" : "睢阳区",
            "zip_code" : "411403"
          },
          {
            "id" : "2018",
            "name" : "民权县",
            "zip_code" : "411421"
          },
          {
            "id" : "2019",
            "name" : "睢县",
            "zip_code" : "411422"
          },
          {
            "id" : "2020",
            "name" : "宁陵县",
            "zip_code" : "411423"
          },
          {
            "id" : "2021",
            "name" : "柘城县",
            "zip_code" : "411424"
          },
          {
            "id" : "2022",
            "name" : "虞城县",
            "zip_code" : "411425"
          },
          {
            "id" : "2023",
            "name" : "夏邑县",
            "zip_code" : "411426"
          },
          {
            "id" : "2024",
            "name" : "永城市",
            "zip_code" : "411481"
          }
        ],
        "name" : "商丘",
        "zip_code" : "411400"
      },
      {
        "id" : "201",
        "areas" : [
          {
            "id" : "2025",
            "name" : "市辖区",
            "zip_code" : "411501"
          },
          {
            "id" : "2026",
            "name" : "浉河区",
            "zip_code" : "411502"
          },
          {
            "id" : "2027",
            "name" : "平桥区",
            "zip_code" : "411503"
          },
          {
            "id" : "2028",
            "name" : "罗山县",
            "zip_code" : "411521"
          },
          {
            "id" : "2029",
            "name" : "光山县",
            "zip_code" : "411522"
          },
          {
            "id" : "2030",
            "name" : "新县",
            "zip_code" : "411523"
          },
          {
            "id" : "2031",
            "name" : "商城县",
            "zip_code" : "411524"
          },
          {
            "id" : "2032",
            "name" : "固始县",
            "zip_code" : "411525"
          },
          {
            "id" : "2033",
            "name" : "潢川县",
            "zip_code" : "411526"
          },
          {
            "id" : "2034",
            "name" : "淮滨县",
            "zip_code" : "411527"
          },
          {
            "id" : "2035",
            "name" : "息县",
            "zip_code" : "411528"
          }
        ],
        "name" : "信阳",
        "zip_code" : "411500"
      },
      {
        "id" : "202",
        "areas" : [
          {
            "id" : "2036",
            "name" : "市辖区",
            "zip_code" : "411601"
          },
          {
            "id" : "2037",
            "name" : "川汇区",
            "zip_code" : "411602"
          },
          {
            "id" : "2038",
            "name" : "扶沟县",
            "zip_code" : "411621"
          },
          {
            "id" : "2039",
            "name" : "西华县",
            "zip_code" : "411622"
          },
          {
            "id" : "2040",
            "name" : "商水县",
            "zip_code" : "411623"
          },
          {
            "id" : "2041",
            "name" : "沈丘县",
            "zip_code" : "411624"
          },
          {
            "id" : "2042",
            "name" : "郸城县",
            "zip_code" : "411625"
          },
          {
            "id" : "2043",
            "name" : "淮阳县",
            "zip_code" : "411626"
          },
          {
            "id" : "2044",
            "name" : "太康县",
            "zip_code" : "411627"
          },
          {
            "id" : "2045",
            "name" : "鹿邑县",
            "zip_code" : "411628"
          },
          {
            "id" : "2046",
            "name" : "项城市",
            "zip_code" : "411681"
          }
        ],
        "name" : "周口",
        "zip_code" : "411600"
      },
      {
        "id" : "203",
        "areas" : [
          {
            "id" : "2047",
            "name" : "市辖区",
            "zip_code" : "411701"
          },
          {
            "id" : "2048",
            "name" : "驿城区",
            "zip_code" : "411702"
          },
          {
            "id" : "2049",
            "name" : "西平县",
            "zip_code" : "411721"
          },
          {
            "id" : "2050",
            "name" : "上蔡县",
            "zip_code" : "411722"
          },
          {
            "id" : "2051",
            "name" : "平舆县",
            "zip_code" : "411723"
          },
          {
            "id" : "2052",
            "name" : "正阳县",
            "zip_code" : "411724"
          },
          {
            "id" : "2053",
            "name" : "确山县",
            "zip_code" : "411725"
          },
          {
            "id" : "2054",
            "name" : "泌阳县",
            "zip_code" : "411726"
          },
          {
            "id" : "2055",
            "name" : "汝南县",
            "zip_code" : "411727"
          },
          {
            "id" : "2056",
            "name" : "遂平县",
            "zip_code" : "411728"
          },
          {
            "id" : "2057",
            "name" : "新蔡县",
            "zip_code" : "411729"
          }
        ],
        "name" : "驻马店",
        "zip_code" : "411700"
      }
    ],
    "id" : "17",
    "name" : "河南",
    "zip_code" : "410000"
  },
  {
    "cities" : [
      {
        "id" : "204",
        "areas" : [
          {
            "id" : "2058",
            "name" : "市辖区",
            "zip_code" : "420101"
          },
          {
            "id" : "2059",
            "name" : "江岸区",
            "zip_code" : "420102"
          },
          {
            "id" : "2060",
            "name" : "江汉区",
            "zip_code" : "420103"
          },
          {
            "id" : "2061",
            "name" : "硚口区",
            "zip_code" : "420104"
          },
          {
            "id" : "2062",
            "name" : "汉阳区",
            "zip_code" : "420105"
          },
          {
            "id" : "2063",
            "name" : "武昌区",
            "zip_code" : "420106"
          },
          {
            "id" : "2064",
            "name" : "青山区",
            "zip_code" : "420107"
          },
          {
            "id" : "2065",
            "name" : "洪山区",
            "zip_code" : "420111"
          },
          {
            "id" : "2066",
            "name" : "东西湖区",
            "zip_code" : "420112"
          },
          {
            "id" : "2067",
            "name" : "汉南区",
            "zip_code" : "420113"
          },
          {
            "id" : "2068",
            "name" : "蔡甸区",
            "zip_code" : "420114"
          },
          {
            "id" : "2069",
            "name" : "江夏区",
            "zip_code" : "420115"
          },
          {
            "id" : "2070",
            "name" : "黄陂区",
            "zip_code" : "420116"
          },
          {
            "id" : "2071",
            "name" : "新洲区",
            "zip_code" : "420117"
          }
        ],
        "name" : "武汉",
        "zip_code" : "420100"
      },
      {
        "id" : "205",
        "areas" : [
          {
            "id" : "2072",
            "name" : "市辖区",
            "zip_code" : "420201"
          },
          {
            "id" : "2073",
            "name" : "黄石港区",
            "zip_code" : "420202"
          },
          {
            "id" : "2074",
            "name" : "西塞山区",
            "zip_code" : "420203"
          },
          {
            "id" : "2075",
            "name" : "下陆区",
            "zip_code" : "420204"
          },
          {
            "id" : "2076",
            "name" : "铁山区",
            "zip_code" : "420205"
          },
          {
            "id" : "2077",
            "name" : "阳新县",
            "zip_code" : "420222"
          },
          {
            "id" : "2078",
            "name" : "大冶市",
            "zip_code" : "420281"
          }
        ],
        "name" : "黄石",
        "zip_code" : "420200"
      },
      {
        "id" : "206",
        "areas" : [
          {
            "id" : "2079",
            "name" : "市辖区",
            "zip_code" : "420301"
          },
          {
            "id" : "2080",
            "name" : "茅箭区",
            "zip_code" : "420302"
          },
          {
            "id" : "2081",
            "name" : "张湾区",
            "zip_code" : "420303"
          },
          {
            "id" : "2082",
            "name" : "郧县",
            "zip_code" : "420321"
          },
          {
            "id" : "2083",
            "name" : "郧西县",
            "zip_code" : "420322"
          },
          {
            "id" : "2084",
            "name" : "竹山县",
            "zip_code" : "420323"
          },
          {
            "id" : "2085",
            "name" : "竹溪县",
            "zip_code" : "420324"
          },
          {
            "id" : "2086",
            "name" : "房县",
            "zip_code" : "420325"
          },
          {
            "id" : "2087",
            "name" : "丹江口市",
            "zip_code" : "420381"
          }
        ],
        "name" : "十堰",
        "zip_code" : "420300"
      },
      {
        "id" : "207",
        "areas" : [
          {
            "id" : "2088",
            "name" : "市辖区",
            "zip_code" : "420501"
          },
          {
            "id" : "2089",
            "name" : "西陵区",
            "zip_code" : "420502"
          },
          {
            "id" : "2090",
            "name" : "伍家岗区",
            "zip_code" : "420503"
          },
          {
            "id" : "2091",
            "name" : "点军区",
            "zip_code" : "420504"
          },
          {
            "id" : "2092",
            "name" : "猇亭区",
            "zip_code" : "420505"
          },
          {
            "id" : "2093",
            "name" : "夷陵区",
            "zip_code" : "420506"
          },
          {
            "id" : "2094",
            "name" : "远安县",
            "zip_code" : "420525"
          },
          {
            "id" : "2095",
            "name" : "兴山县",
            "zip_code" : "420526"
          },
          {
            "id" : "2096",
            "name" : "秭归县",
            "zip_code" : "420527"
          },
          {
            "id" : "2097",
            "name" : "长阳土家族自治县",
            "zip_code" : "420528"
          },
          {
            "id" : "2098",
            "name" : "五峰土家族自治县",
            "zip_code" : "420529"
          },
          {
            "id" : "2099",
            "name" : "宜都市",
            "zip_code" : "420581"
          },
          {
            "id" : "2100",
            "name" : "当阳市",
            "zip_code" : "420582"
          },
          {
            "id" : "2101",
            "name" : "枝江市",
            "zip_code" : "420583"
          }
        ],
        "name" : "宜昌",
        "zip_code" : "420500"
      },
      {
        "id" : "208",
        "areas" : [
          {
            "id" : "2102",
            "name" : "市辖区",
            "zip_code" : "420601"
          },
          {
            "id" : "2103",
            "name" : "襄城区",
            "zip_code" : "420602"
          },
          {
            "id" : "2104",
            "name" : "樊城区",
            "zip_code" : "420606"
          },
          {
            "id" : "2105",
            "name" : "襄阳区",
            "zip_code" : "420607"
          },
          {
            "id" : "2106",
            "name" : "南漳县",
            "zip_code" : "420624"
          },
          {
            "id" : "2107",
            "name" : "谷城县",
            "zip_code" : "420625"
          },
          {
            "id" : "2108",
            "name" : "保康县",
            "zip_code" : "420626"
          },
          {
            "id" : "2109",
            "name" : "老河口市",
            "zip_code" : "420682"
          },
          {
            "id" : "2110",
            "name" : "枣阳市",
            "zip_code" : "420683"
          },
          {
            "id" : "2111",
            "name" : "宜城市",
            "zip_code" : "420684"
          }
        ],
        "name" : "襄樊",
        "zip_code" : "420600"
      },
      {
        "id" : "209",
        "areas" : [
          {
            "id" : "2112",
            "name" : "市辖区",
            "zip_code" : "420701"
          },
          {
            "id" : "2113",
            "name" : "梁子湖区",
            "zip_code" : "420702"
          },
          {
            "id" : "2114",
            "name" : "华容区",
            "zip_code" : "420703"
          },
          {
            "id" : "2115",
            "name" : "鄂城区",
            "zip_code" : "420704"
          }
        ],
        "name" : "鄂州",
        "zip_code" : "420700"
      },
      {
        "id" : "210",
        "areas" : [
          {
            "id" : "2116",
            "name" : "市辖区",
            "zip_code" : "420801"
          },
          {
            "id" : "2117",
            "name" : "东宝区",
            "zip_code" : "420802"
          },
          {
            "id" : "2118",
            "name" : "掇刀区",
            "zip_code" : "420804"
          },
          {
            "id" : "2119",
            "name" : "京山县",
            "zip_code" : "420821"
          },
          {
            "id" : "2120",
            "name" : "沙洋县",
            "zip_code" : "420822"
          },
          {
            "id" : "2121",
            "name" : "钟祥市",
            "zip_code" : "420881"
          }
        ],
        "name" : "荆门",
        "zip_code" : "420800"
      },
      {
        "id" : "211",
        "areas" : [
          {
            "id" : "2122",
            "name" : "市辖区",
            "zip_code" : "420901"
          },
          {
            "id" : "2123",
            "name" : "孝南区",
            "zip_code" : "420902"
          },
          {
            "id" : "2124",
            "name" : "孝昌县",
            "zip_code" : "420921"
          },
          {
            "id" : "2125",
            "name" : "大悟县",
            "zip_code" : "420922"
          },
          {
            "id" : "2126",
            "name" : "云梦县",
            "zip_code" : "420923"
          },
          {
            "id" : "2127",
            "name" : "应城市",
            "zip_code" : "420981"
          },
          {
            "id" : "2128",
            "name" : "安陆市",
            "zip_code" : "420982"
          },
          {
            "id" : "2129",
            "name" : "汉川市",
            "zip_code" : "420984"
          }
        ],
        "name" : "孝感",
        "zip_code" : "420900"
      },
      {
        "id" : "212",
        "areas" : [
          {
            "id" : "2130",
            "name" : "市辖区",
            "zip_code" : "421001"
          },
          {
            "id" : "2131",
            "name" : "沙市区",
            "zip_code" : "421002"
          },
          {
            "id" : "2132",
            "name" : "荆州区",
            "zip_code" : "421003"
          },
          {
            "id" : "2133",
            "name" : "公安县",
            "zip_code" : "421022"
          },
          {
            "id" : "2134",
            "name" : "监利县",
            "zip_code" : "421023"
          },
          {
            "id" : "2135",
            "name" : "江陵县",
            "zip_code" : "421024"
          },
          {
            "id" : "2136",
            "name" : "石首市",
            "zip_code" : "421081"
          },
          {
            "id" : "2137",
            "name" : "洪湖市",
            "zip_code" : "421083"
          },
          {
            "id" : "2138",
            "name" : "松滋市",
            "zip_code" : "421087"
          }
        ],
        "name" : "荆州",
        "zip_code" : "421000"
      },
      {
        "id" : "213",
        "areas" : [
          {
            "id" : "2139",
            "name" : "市辖区",
            "zip_code" : "421101"
          },
          {
            "id" : "2140",
            "name" : "黄州区",
            "zip_code" : "421102"
          },
          {
            "id" : "2141",
            "name" : "团风县",
            "zip_code" : "421121"
          },
          {
            "id" : "2142",
            "name" : "红安县",
            "zip_code" : "421122"
          },
          {
            "id" : "2143",
            "name" : "罗田县",
            "zip_code" : "421123"
          },
          {
            "id" : "2144",
            "name" : "英山县",
            "zip_code" : "421124"
          },
          {
            "id" : "2145",
            "name" : "浠水县",
            "zip_code" : "421125"
          },
          {
            "id" : "2146",
            "name" : "蕲春县",
            "zip_code" : "421126"
          },
          {
            "id" : "2147",
            "name" : "黄梅县",
            "zip_code" : "421127"
          },
          {
            "id" : "2148",
            "name" : "麻城市",
            "zip_code" : "421181"
          },
          {
            "id" : "2149",
            "name" : "武穴市",
            "zip_code" : "421182"
          }
        ],
        "name" : "黄冈",
        "zip_code" : "421100"
      },
      {
        "id" : "214",
        "areas" : [
          {
            "id" : "2150",
            "name" : "市辖区",
            "zip_code" : "421201"
          },
          {
            "id" : "2151",
            "name" : "咸安区",
            "zip_code" : "421202"
          },
          {
            "id" : "2152",
            "name" : "嘉鱼县",
            "zip_code" : "421221"
          },
          {
            "id" : "2153",
            "name" : "通城县",
            "zip_code" : "421222"
          },
          {
            "id" : "2154",
            "name" : "崇阳县",
            "zip_code" : "421223"
          },
          {
            "id" : "2155",
            "name" : "通山县",
            "zip_code" : "421224"
          },
          {
            "id" : "2156",
            "name" : "赤壁市",
            "zip_code" : "421281"
          }
        ],
        "name" : "咸宁",
        "zip_code" : "421200"
      },
      {
        "id" : "215",
        "areas" : [
          {
            "id" : "2157",
            "name" : "市辖区",
            "zip_code" : "421301"
          },
          {
            "id" : "2158",
            "name" : "曾都区",
            "zip_code" : "421303"
          },
          {
            "id" : "2159",
            "name" : "广水市",
            "zip_code" : "421381"
          },
          {
            "id" : "4600",
            "name" : "随县",
            "zip_code" : "421321"
          }
        ],
        "name" : "随州",
        "zip_code" : "421300"
      },
      {
        "id" : "216",
        "areas" : [
          {
            "id" : "2160",
            "name" : "恩施市",
            "zip_code" : "422801"
          },
          {
            "id" : "2161",
            "name" : "利川市",
            "zip_code" : "422802"
          },
          {
            "id" : "2162",
            "name" : "建始县",
            "zip_code" : "422822"
          },
          {
            "id" : "2163",
            "name" : "巴东县",
            "zip_code" : "422823"
          },
          {
            "id" : "2164",
            "name" : "宣恩县",
            "zip_code" : "422825"
          },
          {
            "id" : "2165",
            "name" : "咸丰县",
            "zip_code" : "422826"
          },
          {
            "id" : "2166",
            "name" : "来凤县",
            "zip_code" : "422827"
          },
          {
            "id" : "2167",
            "name" : "鹤峰县",
            "zip_code" : "422828"
          }
        ],
        "name" : "恩施土家族苗族自治州",
        "zip_code" : "422800"
      },
      {
        "id" : "217",
        "areas" : [
          {
            "id" : "2168",
            "name" : "仙桃市",
            "zip_code" : "429004"
          },
          {
            "id" : "2169",
            "name" : "潜江市",
            "zip_code" : "429005"
          },
          {
            "id" : "2170",
            "name" : "天门市",
            "zip_code" : "429006"
          },
          {
            "id" : "2171",
            "name" : "神农架林区",
            "zip_code" : "429021"
          }
        ],
        "name" : "省直辖县级行政区划",
        "zip_code" : "429000"
      }
    ],
    "id" : "18",
    "name" : "湖北",
    "zip_code" : "420000"
  },
  {
    "cities" : [
      {
        "id" : "218",
        "areas" : [
          {
            "id" : "2172",
            "name" : "市辖区",
            "zip_code" : "430101"
          },
          {
            "id" : "2173",
            "name" : "芙蓉区",
            "zip_code" : "430102"
          },
          {
            "id" : "2174",
            "name" : "天心区",
            "zip_code" : "430103"
          },
          {
            "id" : "2175",
            "name" : "岳麓区",
            "zip_code" : "430104"
          },
          {
            "id" : "2176",
            "name" : "开福区",
            "zip_code" : "430105"
          },
          {
            "id" : "2177",
            "name" : "雨花区",
            "zip_code" : "430111"
          },
          {
            "id" : "2178",
            "name" : "长沙县",
            "zip_code" : "430121"
          },
          {
            "id" : "2179",
            "name" : "望城县",
            "zip_code" : "430122"
          },
          {
            "id" : "2180",
            "name" : "宁乡县",
            "zip_code" : "430124"
          },
          {
            "id" : "2181",
            "name" : "浏阳市",
            "zip_code" : "430181"
          }
        ],
        "name" : "长沙",
        "zip_code" : "430100"
      },
      {
        "id" : "219",
        "areas" : [
          {
            "id" : "2182",
            "name" : "市辖区",
            "zip_code" : "430201"
          },
          {
            "id" : "2183",
            "name" : "荷塘区",
            "zip_code" : "430202"
          },
          {
            "id" : "2184",
            "name" : "芦淞区",
            "zip_code" : "430203"
          },
          {
            "id" : "2185",
            "name" : "石峰区",
            "zip_code" : "430204"
          },
          {
            "id" : "2186",
            "name" : "天元区",
            "zip_code" : "430211"
          },
          {
            "id" : "2187",
            "name" : "株洲县",
            "zip_code" : "430221"
          },
          {
            "id" : "2188",
            "name" : "攸县",
            "zip_code" : "430223"
          },
          {
            "id" : "2189",
            "name" : "茶陵县",
            "zip_code" : "430224"
          },
          {
            "id" : "2190",
            "name" : "炎陵县",
            "zip_code" : "430225"
          },
          {
            "id" : "2191",
            "name" : "醴陵市",
            "zip_code" : "430281"
          }
        ],
        "name" : "株洲",
        "zip_code" : "430200"
      },
      {
        "id" : "220",
        "areas" : [
          {
            "id" : "2192",
            "name" : "市辖区",
            "zip_code" : "430301"
          },
          {
            "id" : "2193",
            "name" : "雨湖区",
            "zip_code" : "430302"
          },
          {
            "id" : "2194",
            "name" : "岳塘区",
            "zip_code" : "430304"
          },
          {
            "id" : "2195",
            "name" : "湘潭县",
            "zip_code" : "430321"
          },
          {
            "id" : "2196",
            "name" : "湘乡市",
            "zip_code" : "430381"
          },
          {
            "id" : "2197",
            "name" : "韶山市",
            "zip_code" : "430382"
          }
        ],
        "name" : "湘潭",
        "zip_code" : "430300"
      },
      {
        "id" : "221",
        "areas" : [
          {
            "id" : "2198",
            "name" : "市辖区",
            "zip_code" : "430401"
          },
          {
            "id" : "2199",
            "name" : "珠晖区",
            "zip_code" : "430405"
          },
          {
            "id" : "2200",
            "name" : "雁峰区",
            "zip_code" : "430406"
          },
          {
            "id" : "2201",
            "name" : "石鼓区",
            "zip_code" : "430407"
          },
          {
            "id" : "2202",
            "name" : "蒸湘区",
            "zip_code" : "430408"
          },
          {
            "id" : "2203",
            "name" : "南岳区",
            "zip_code" : "430412"
          },
          {
            "id" : "2204",
            "name" : "衡阳县",
            "zip_code" : "430421"
          },
          {
            "id" : "2205",
            "name" : "衡南县",
            "zip_code" : "430422"
          },
          {
            "id" : "2206",
            "name" : "衡山县",
            "zip_code" : "430423"
          },
          {
            "id" : "2207",
            "name" : "衡东县",
            "zip_code" : "430424"
          },
          {
            "id" : "2208",
            "name" : "祁东县",
            "zip_code" : "430426"
          },
          {
            "id" : "2209",
            "name" : "耒阳市",
            "zip_code" : "430481"
          },
          {
            "id" : "2210",
            "name" : "常宁市",
            "zip_code" : "430482"
          }
        ],
        "name" : "衡阳",
        "zip_code" : "430400"
      },
      {
        "id" : "222",
        "areas" : [
          {
            "id" : "2211",
            "name" : "市辖区",
            "zip_code" : "430501"
          },
          {
            "id" : "2212",
            "name" : "双清区",
            "zip_code" : "430502"
          },
          {
            "id" : "2213",
            "name" : "大祥区",
            "zip_code" : "430503"
          },
          {
            "id" : "2214",
            "name" : "北塔区",
            "zip_code" : "430511"
          },
          {
            "id" : "2215",
            "name" : "邵东县",
            "zip_code" : "430521"
          },
          {
            "id" : "2216",
            "name" : "新邵县",
            "zip_code" : "430522"
          },
          {
            "id" : "2217",
            "name" : "邵阳县",
            "zip_code" : "430523"
          },
          {
            "id" : "2218",
            "name" : "隆回县",
            "zip_code" : "430524"
          },
          {
            "id" : "2219",
            "name" : "洞口县",
            "zip_code" : "430525"
          },
          {
            "id" : "2220",
            "name" : "绥宁县",
            "zip_code" : "430527"
          },
          {
            "id" : "2221",
            "name" : "新宁县",
            "zip_code" : "430528"
          },
          {
            "id" : "2222",
            "name" : "城步苗族自治县",
            "zip_code" : "430529"
          },
          {
            "id" : "2223",
            "name" : "武冈市",
            "zip_code" : "430581"
          }
        ],
        "name" : "邵阳",
        "zip_code" : "430500"
      },
      {
        "id" : "223",
        "areas" : [
          {
            "id" : "2224",
            "name" : "市辖区",
            "zip_code" : "430601"
          },
          {
            "id" : "2225",
            "name" : "岳阳楼区",
            "zip_code" : "430602"
          },
          {
            "id" : "2226",
            "name" : "云溪区",
            "zip_code" : "430603"
          },
          {
            "id" : "2227",
            "name" : "君山区",
            "zip_code" : "430611"
          },
          {
            "id" : "2228",
            "name" : "岳阳县",
            "zip_code" : "430621"
          },
          {
            "id" : "2229",
            "name" : "华容县",
            "zip_code" : "430623"
          },
          {
            "id" : "2230",
            "name" : "湘阴县",
            "zip_code" : "430624"
          },
          {
            "id" : "2231",
            "name" : "平江县",
            "zip_code" : "430626"
          },
          {
            "id" : "2232",
            "name" : "汨罗市",
            "zip_code" : "430681"
          },
          {
            "id" : "2233",
            "name" : "临湘市",
            "zip_code" : "430682"
          }
        ],
        "name" : "岳阳",
        "zip_code" : "430600"
      },
      {
        "id" : "224",
        "areas" : [
          {
            "id" : "2234",
            "name" : "市辖区",
            "zip_code" : "430701"
          },
          {
            "id" : "2235",
            "name" : "武陵区",
            "zip_code" : "430702"
          },
          {
            "id" : "2236",
            "name" : "鼎城区",
            "zip_code" : "430703"
          },
          {
            "id" : "2237",
            "name" : "安乡县",
            "zip_code" : "430721"
          },
          {
            "id" : "2238",
            "name" : "汉寿县",
            "zip_code" : "430722"
          },
          {
            "id" : "2239",
            "name" : "澧县",
            "zip_code" : "430723"
          },
          {
            "id" : "2240",
            "name" : "临澧县",
            "zip_code" : "430724"
          },
          {
            "id" : "2241",
            "name" : "桃源县",
            "zip_code" : "430725"
          },
          {
            "id" : "2242",
            "name" : "石门县",
            "zip_code" : "430726"
          },
          {
            "id" : "2243",
            "name" : "津市市",
            "zip_code" : "430781"
          }
        ],
        "name" : "常德",
        "zip_code" : "430700"
      },
      {
        "id" : "225",
        "areas" : [
          {
            "id" : "2244",
            "name" : "市辖区",
            "zip_code" : "430801"
          },
          {
            "id" : "2245",
            "name" : "永定区",
            "zip_code" : "430802"
          },
          {
            "id" : "2246",
            "name" : "武陵源区",
            "zip_code" : "430811"
          },
          {
            "id" : "2247",
            "name" : "慈利县",
            "zip_code" : "430821"
          },
          {
            "id" : "2248",
            "name" : "桑植县",
            "zip_code" : "430822"
          }
        ],
        "name" : "张家界",
        "zip_code" : "430800"
      },
      {
        "id" : "226",
        "areas" : [
          {
            "id" : "2249",
            "name" : "市辖区",
            "zip_code" : "430901"
          },
          {
            "id" : "2250",
            "name" : "资阳区",
            "zip_code" : "430902"
          },
          {
            "id" : "2251",
            "name" : "赫山区",
            "zip_code" : "430903"
          },
          {
            "id" : "2252",
            "name" : "南县",
            "zip_code" : "430921"
          },
          {
            "id" : "2253",
            "name" : "桃江县",
            "zip_code" : "430922"
          },
          {
            "id" : "2254",
            "name" : "安化县",
            "zip_code" : "430923"
          },
          {
            "id" : "2255",
            "name" : "沅江市",
            "zip_code" : "430981"
          }
        ],
        "name" : "益阳",
        "zip_code" : "430900"
      },
      {
        "id" : "227",
        "areas" : [
          {
            "id" : "2256",
            "name" : "市辖区",
            "zip_code" : "431001"
          },
          {
            "id" : "2257",
            "name" : "北湖区",
            "zip_code" : "431002"
          },
          {
            "id" : "2258",
            "name" : "苏仙区",
            "zip_code" : "431003"
          },
          {
            "id" : "2259",
            "name" : "桂阳县",
            "zip_code" : "431021"
          },
          {
            "id" : "2260",
            "name" : "宜章县",
            "zip_code" : "431022"
          },
          {
            "id" : "2261",
            "name" : "永兴县",
            "zip_code" : "431023"
          },
          {
            "id" : "2262",
            "name" : "嘉禾县",
            "zip_code" : "431024"
          },
          {
            "id" : "2263",
            "name" : "临武县",
            "zip_code" : "431025"
          },
          {
            "id" : "2264",
            "name" : "汝城县",
            "zip_code" : "431026"
          },
          {
            "id" : "2265",
            "name" : "桂东县",
            "zip_code" : "431027"
          },
          {
            "id" : "2266",
            "name" : "安仁县",
            "zip_code" : "431028"
          },
          {
            "id" : "2267",
            "name" : "资兴市",
            "zip_code" : "431081"
          }
        ],
        "name" : "郴州",
        "zip_code" : "431000"
      },
      {
        "id" : "228",
        "areas" : [
          {
            "id" : "2268",
            "name" : "市辖区",
            "zip_code" : "431101"
          },
          {
            "id" : "2270",
            "name" : "冷水滩区",
            "zip_code" : "431103"
          },
          {
            "id" : "2271",
            "name" : "祁阳县",
            "zip_code" : "431121"
          },
          {
            "id" : "2272",
            "name" : "东安县",
            "zip_code" : "431122"
          },
          {
            "id" : "2273",
            "name" : "双牌县",
            "zip_code" : "431123"
          },
          {
            "id" : "2274",
            "name" : "道县",
            "zip_code" : "431124"
          },
          {
            "id" : "2275",
            "name" : "江永县",
            "zip_code" : "431125"
          },
          {
            "id" : "2276",
            "name" : "宁远县",
            "zip_code" : "431126"
          },
          {
            "id" : "2277",
            "name" : "蓝山县",
            "zip_code" : "431127"
          },
          {
            "id" : "2278",
            "name" : "新田县",
            "zip_code" : "431128"
          },
          {
            "id" : "2279",
            "name" : "江华瑶族自治县",
            "zip_code" : "431129"
          },
          {
            "id" : "4700",
            "name" : "零陵区",
            "zip_code" : "431102"
          }
        ],
        "name" : "永州",
        "zip_code" : "431100"
      },
      {
        "id" : "229",
        "areas" : [
          {
            "id" : "2280",
            "name" : "市辖区",
            "zip_code" : "431201"
          },
          {
            "id" : "2281",
            "name" : "鹤城区",
            "zip_code" : "431202"
          },
          {
            "id" : "2282",
            "name" : "中方县",
            "zip_code" : "431221"
          },
          {
            "id" : "2283",
            "name" : "沅陵县",
            "zip_code" : "431222"
          },
          {
            "id" : "2284",
            "name" : "辰溪县",
            "zip_code" : "431223"
          },
          {
            "id" : "2285",
            "name" : "溆浦县",
            "zip_code" : "431224"
          },
          {
            "id" : "2286",
            "name" : "会同县",
            "zip_code" : "431225"
          },
          {
            "id" : "2287",
            "name" : "麻阳苗族自治县",
            "zip_code" : "431226"
          },
          {
            "id" : "2288",
            "name" : "新晃侗族自治县",
            "zip_code" : "431227"
          },
          {
            "id" : "2289",
            "name" : "芷江侗族自治县",
            "zip_code" : "431228"
          },
          {
            "id" : "2290",
            "name" : "靖州苗族侗族自治县",
            "zip_code" : "431229"
          },
          {
            "id" : "2291",
            "name" : "通道侗族自治县",
            "zip_code" : "431230"
          },
          {
            "id" : "2292",
            "name" : "洪江市",
            "zip_code" : "431281"
          }
        ],
        "name" : "怀化",
        "zip_code" : "431200"
      },
      {
        "id" : "230",
        "areas" : [
          {
            "id" : "2293",
            "name" : "市辖区",
            "zip_code" : "431301"
          },
          {
            "id" : "2294",
            "name" : "娄星区",
            "zip_code" : "431302"
          },
          {
            "id" : "2295",
            "name" : "双峰县",
            "zip_code" : "431321"
          },
          {
            "id" : "2296",
            "name" : "新化县",
            "zip_code" : "431322"
          },
          {
            "id" : "2297",
            "name" : "冷水江市",
            "zip_code" : "431381"
          },
          {
            "id" : "2298",
            "name" : "涟源市",
            "zip_code" : "431382"
          }
        ],
        "name" : "娄底",
        "zip_code" : "431300"
      },
      {
        "id" : "231",
        "areas" : [
          {
            "id" : "2299",
            "name" : "吉首市",
            "zip_code" : "433101"
          },
          {
            "id" : "2300",
            "name" : "泸溪县",
            "zip_code" : "433122"
          },
          {
            "id" : "2301",
            "name" : "凤凰县",
            "zip_code" : "433123"
          },
          {
            "id" : "2302",
            "name" : "花垣县",
            "zip_code" : "433124"
          },
          {
            "id" : "2303",
            "name" : "保靖县",
            "zip_code" : "433125"
          },
          {
            "id" : "2304",
            "name" : "古丈县",
            "zip_code" : "433126"
          },
          {
            "id" : "2305",
            "name" : "永顺县",
            "zip_code" : "433127"
          },
          {
            "id" : "2306",
            "name" : "龙山县",
            "zip_code" : "433130"
          }
        ],
        "name" : "湘西土家族苗族自治州",
        "zip_code" : "433100"
      }
    ],
    "id" : "19",
    "name" : "湖南",
    "zip_code" : "430000"
  },
  {
    "cities" : [
      {
        "id" : "232",
        "areas" : [
          {
            "id" : "2307",
            "name" : "市辖区",
            "zip_code" : "440101"
          },
          {
            "id" : "2308",
            "name" : "南沙区",
            "zip_code" : "440115"
          },
          {
            "id" : "2309",
            "name" : "荔湾区",
            "zip_code" : "440103"
          },
          {
            "id" : "2310",
            "name" : "越秀区",
            "zip_code" : "440104"
          },
          {
            "id" : "2311",
            "name" : "海珠区",
            "zip_code" : "440105"
          },
          {
            "id" : "2312",
            "name" : "天河区",
            "zip_code" : "440106"
          },
          {
            "id" : "2313",
            "name" : "萝岗区",
            "zip_code" : "440116"
          },
          {
            "id" : "2314",
            "name" : "白云区",
            "zip_code" : "440111"
          },
          {
            "id" : "2315",
            "name" : "黄埔区",
            "zip_code" : "440112"
          },
          {
            "id" : "2316",
            "name" : "番禺区",
            "zip_code" : "440113"
          },
          {
            "id" : "2317",
            "name" : "花都区",
            "zip_code" : "440114"
          },
          {
            "id" : "2318",
            "name" : "增城市",
            "zip_code" : "440183"
          },
          {
            "id" : "2319",
            "name" : "从化市",
            "zip_code" : "440184"
          }
        ],
        "name" : "广州",
        "zip_code" : "440100"
      },
      {
        "id" : "233",
        "areas" : [
          {
            "id" : "2320",
            "name" : "市辖区",
            "zip_code" : "440201"
          },
          {
            "id" : "2321",
            "name" : "武江区",
            "zip_code" : "440203"
          },
          {
            "id" : "2322",
            "name" : "浈江区",
            "zip_code" : "440204"
          },
          {
            "id" : "2323",
            "name" : "曲江区",
            "zip_code" : "440205"
          },
          {
            "id" : "2324",
            "name" : "始兴县",
            "zip_code" : "440222"
          },
          {
            "id" : "2325",
            "name" : "仁化县",
            "zip_code" : "440224"
          },
          {
            "id" : "2326",
            "name" : "翁源县",
            "zip_code" : "440229"
          },
          {
            "id" : "2327",
            "name" : "乳源瑶族自治县",
            "zip_code" : "440232"
          },
          {
            "id" : "2328",
            "name" : "新丰县",
            "zip_code" : "440233"
          },
          {
            "id" : "2329",
            "name" : "乐昌市",
            "zip_code" : "440281"
          },
          {
            "id" : "2330",
            "name" : "南雄市",
            "zip_code" : "440282"
          }
        ],
        "name" : "韶关",
        "zip_code" : "440200"
      },
      {
        "id" : "234",
        "areas" : [
          {
            "id" : "2331",
            "name" : "市辖区",
            "zip_code" : "440301"
          },
          {
            "id" : "2332",
            "name" : "罗湖区",
            "zip_code" : "440303"
          },
          {
            "id" : "2333",
            "name" : "福田区",
            "zip_code" : "440304"
          },
          {
            "id" : "2334",
            "name" : "南山区",
            "zip_code" : "440305"
          },
          {
            "id" : "2335",
            "name" : "宝安区",
            "zip_code" : "440306"
          },
          {
            "id" : "2336",
            "name" : "龙岗区",
            "zip_code" : "440307"
          },
          {
            "id" : "2337",
            "name" : "盐田区",
            "zip_code" : "440308"
          }
        ],
        "name" : "深圳",
        "zip_code" : "440300"
      },
      {
        "id" : "235",
        "areas" : [
          {
            "id" : "2338",
            "name" : "市辖区",
            "zip_code" : "440401"
          },
          {
            "id" : "2339",
            "name" : "香洲区",
            "zip_code" : "440402"
          },
          {
            "id" : "2340",
            "name" : "斗门区",
            "zip_code" : "440403"
          },
          {
            "id" : "2341",
            "name" : "金湾区",
            "zip_code" : "440404"
          }
        ],
        "name" : "珠海",
        "zip_code" : "440400"
      },
      {
        "id" : "236",
        "areas" : [
          {
            "id" : "2342",
            "name" : "市辖区",
            "zip_code" : "440501"
          },
          {
            "id" : "2343",
            "name" : "龙湖区",
            "zip_code" : "440507"
          },
          {
            "id" : "2344",
            "name" : "金平区",
            "zip_code" : "440511"
          },
          {
            "id" : "2345",
            "name" : "濠江区",
            "zip_code" : "440512"
          },
          {
            "id" : "2346",
            "name" : "潮阳区",
            "zip_code" : "440513"
          },
          {
            "id" : "2347",
            "name" : "潮南区",
            "zip_code" : "440514"
          },
          {
            "id" : "2348",
            "name" : "澄海区",
            "zip_code" : "440515"
          },
          {
            "id" : "2349",
            "name" : "南澳县",
            "zip_code" : "440523"
          }
        ],
        "name" : "汕头",
        "zip_code" : "440500"
      },
      {
        "id" : "237",
        "areas" : [
          {
            "id" : "2350",
            "name" : "市辖区",
            "zip_code" : "440601"
          },
          {
            "id" : "2351",
            "name" : "禅城区",
            "zip_code" : "440604"
          },
          {
            "id" : "2352",
            "name" : "南海区",
            "zip_code" : "440605"
          },
          {
            "id" : "2353",
            "name" : "顺德区",
            "zip_code" : "440606"
          },
          {
            "id" : "2354",
            "name" : "三水区",
            "zip_code" : "440607"
          },
          {
            "id" : "2355",
            "name" : "高明区",
            "zip_code" : "440608"
          }
        ],
        "name" : "佛山",
        "zip_code" : "440600"
      },
      {
        "id" : "238",
        "areas" : [
          {
            "id" : "2356",
            "name" : "市辖区",
            "zip_code" : "440701"
          },
          {
            "id" : "2357",
            "name" : "蓬江区",
            "zip_code" : "440703"
          },
          {
            "id" : "2358",
            "name" : "江海区",
            "zip_code" : "440704"
          },
          {
            "id" : "2359",
            "name" : "新会区",
            "zip_code" : "440705"
          },
          {
            "id" : "2360",
            "name" : "台山市",
            "zip_code" : "440781"
          },
          {
            "id" : "2361",
            "name" : "开平市",
            "zip_code" : "440783"
          },
          {
            "id" : "2362",
            "name" : "鹤山市",
            "zip_code" : "440784"
          },
          {
            "id" : "2363",
            "name" : "恩平市",
            "zip_code" : "440785"
          }
        ],
        "name" : "江门",
        "zip_code" : "440700"
      },
      {
        "id" : "239",
        "areas" : [
          {
            "id" : "2364",
            "name" : "市辖区",
            "zip_code" : "440801"
          },
          {
            "id" : "2365",
            "name" : "赤坎区",
            "zip_code" : "440802"
          },
          {
            "id" : "2366",
            "name" : "霞山区",
            "zip_code" : "440803"
          },
          {
            "id" : "2367",
            "name" : "坡头区",
            "zip_code" : "440804"
          },
          {
            "id" : "2368",
            "name" : "麻章区",
            "zip_code" : "440811"
          },
          {
            "id" : "2369",
            "name" : "遂溪县",
            "zip_code" : "440823"
          },
          {
            "id" : "2370",
            "name" : "徐闻县",
            "zip_code" : "440825"
          },
          {
            "id" : "2371",
            "name" : "廉江市",
            "zip_code" : "440881"
          },
          {
            "id" : "2372",
            "name" : "雷州市",
            "zip_code" : "440882"
          },
          {
            "id" : "2373",
            "name" : "吴川市",
            "zip_code" : "440883"
          }
        ],
        "name" : "湛江",
        "zip_code" : "440800"
      },
      {
        "id" : "240",
        "areas" : [
          {
            "id" : "2374",
            "name" : "市辖区",
            "zip_code" : "440901"
          },
          {
            "id" : "2375",
            "name" : "茂南区",
            "zip_code" : "440902"
          },
          {
            "id" : "2376",
            "name" : "茂港区",
            "zip_code" : "440903"
          },
          {
            "id" : "2377",
            "name" : "电白县",
            "zip_code" : "440923"
          },
          {
            "id" : "2378",
            "name" : "高州市",
            "zip_code" : "440981"
          },
          {
            "id" : "2379",
            "name" : "化州市",
            "zip_code" : "440982"
          },
          {
            "id" : "2380",
            "name" : "信宜市",
            "zip_code" : "440983"
          }
        ],
        "name" : "茂名",
        "zip_code" : "440900"
      },
      {
        "id" : "241",
        "areas" : [
          {
            "id" : "2381",
            "name" : "市辖区",
            "zip_code" : "441201"
          },
          {
            "id" : "2382",
            "name" : "端州区",
            "zip_code" : "441202"
          },
          {
            "id" : "2383",
            "name" : "鼎湖区",
            "zip_code" : "441203"
          },
          {
            "id" : "2384",
            "name" : "广宁县",
            "zip_code" : "441223"
          },
          {
            "id" : "2385",
            "name" : "怀集县",
            "zip_code" : "441224"
          },
          {
            "id" : "2386",
            "name" : "封开县",
            "zip_code" : "441225"
          },
          {
            "id" : "2387",
            "name" : "德庆县",
            "zip_code" : "441226"
          },
          {
            "id" : "2388",
            "name" : "高要市",
            "zip_code" : "441283"
          },
          {
            "id" : "2389",
            "name" : "四会市",
            "zip_code" : "441284"
          }
        ],
        "name" : "肇庆",
        "zip_code" : "441200"
      },
      {
        "id" : "242",
        "areas" : [
          {
            "id" : "2390",
            "name" : "市辖区",
            "zip_code" : "441301"
          },
          {
            "id" : "2391",
            "name" : "惠城区",
            "zip_code" : "441302"
          },
          {
            "id" : "2392",
            "name" : "惠阳区",
            "zip_code" : "441303"
          },
          {
            "id" : "2393",
            "name" : "博罗县",
            "zip_code" : "441322"
          },
          {
            "id" : "2394",
            "name" : "惠东县",
            "zip_code" : "441323"
          },
          {
            "id" : "2395",
            "name" : "龙门县",
            "zip_code" : "441324"
          }
        ],
        "name" : "惠州",
        "zip_code" : "441300"
      },
      {
        "id" : "243",
        "areas" : [
          {
            "id" : "2396",
            "name" : "市辖区",
            "zip_code" : "441401"
          },
          {
            "id" : "2397",
            "name" : "梅江区",
            "zip_code" : "441402"
          },
          {
            "id" : "2398",
            "name" : "梅县",
            "zip_code" : "441421"
          },
          {
            "id" : "2399",
            "name" : "大埔县",
            "zip_code" : "441422"
          },
          {
            "id" : "2400",
            "name" : "丰顺县",
            "zip_code" : "441423"
          },
          {
            "id" : "2401",
            "name" : "五华县",
            "zip_code" : "441424"
          },
          {
            "id" : "2402",
            "name" : "平远县",
            "zip_code" : "441426"
          },
          {
            "id" : "2403",
            "name" : "蕉岭县",
            "zip_code" : "441427"
          },
          {
            "id" : "2404",
            "name" : "兴宁市",
            "zip_code" : "441481"
          }
        ],
        "name" : "梅州",
        "zip_code" : "441400"
      },
      {
        "id" : "244",
        "areas" : [
          {
            "id" : "2405",
            "name" : "市辖区",
            "zip_code" : "441501"
          },
          {
            "id" : "2406",
            "name" : "城区",
            "zip_code" : "441502"
          },
          {
            "id" : "2407",
            "name" : "海丰县",
            "zip_code" : "441521"
          },
          {
            "id" : "2408",
            "name" : "陆河县",
            "zip_code" : "441523"
          },
          {
            "id" : "2409",
            "name" : "陆丰市",
            "zip_code" : "441581"
          }
        ],
        "name" : "汕尾",
        "zip_code" : "441500"
      },
      {
        "id" : "245",
        "areas" : [
          {
            "id" : "2410",
            "name" : "市辖区",
            "zip_code" : "441601"
          },
          {
            "id" : "2411",
            "name" : "源城区",
            "zip_code" : "441602"
          },
          {
            "id" : "2412",
            "name" : "紫金县",
            "zip_code" : "441621"
          },
          {
            "id" : "2413",
            "name" : "龙川县",
            "zip_code" : "441622"
          },
          {
            "id" : "2414",
            "name" : "连平县",
            "zip_code" : "441623"
          },
          {
            "id" : "2415",
            "name" : "和平县",
            "zip_code" : "441624"
          },
          {
            "id" : "2416",
            "name" : "东源县",
            "zip_code" : "441625"
          }
        ],
        "name" : "河源",
        "zip_code" : "441600"
      },
      {
        "id" : "246",
        "areas" : [
          {
            "id" : "2417",
            "name" : "市辖区",
            "zip_code" : "441701"
          },
          {
            "id" : "2418",
            "name" : "江城区",
            "zip_code" : "441702"
          },
          {
            "id" : "2419",
            "name" : "阳西县",
            "zip_code" : "441721"
          },
          {
            "id" : "2420",
            "name" : "阳东县",
            "zip_code" : "441723"
          },
          {
            "id" : "2421",
            "name" : "阳春市",
            "zip_code" : "441781"
          }
        ],
        "name" : "阳江",
        "zip_code" : "441700"
      },
      {
        "id" : "247",
        "areas" : [
          {
            "id" : "2422",
            "name" : "市辖区",
            "zip_code" : "441801"
          },
          {
            "id" : "2423",
            "name" : "清城区",
            "zip_code" : "441802"
          },
          {
            "id" : "2424",
            "name" : "佛冈县",
            "zip_code" : "441821"
          },
          {
            "id" : "2425",
            "name" : "阳山县",
            "zip_code" : "441823"
          },
          {
            "id" : "2426",
            "name" : "连山壮族瑶族自治县",
            "zip_code" : "441825"
          },
          {
            "id" : "2427",
            "name" : "连南瑶族自治县",
            "zip_code" : "441826"
          },
          {
            "id" : "2428",
            "name" : "清新县",
            "zip_code" : "441827"
          },
          {
            "id" : "2429",
            "name" : "英德市",
            "zip_code" : "441881"
          },
          {
            "id" : "2430",
            "name" : "连州市",
            "zip_code" : "441882"
          }
        ],
        "name" : "清远",
        "zip_code" : "441800"
      },
      {
        "id" : "248",
        "areas" : [
          {
            "id" : "5004",
            "name" : "东莞",
            "zip_code" : "441900"
          }
        ],
        "name" : "东莞",
        "zip_code" : "441900"
      },
      {
        "id" : "249",
        "areas" : [
          {
            "id" : "5005",
            "name" : "中山",
            "zip_code" : "442000"
          }
        ],
        "name" : "中山",
        "zip_code" : "442000"
      },
      {
        "id" : "250",
        "areas" : [
          {
            "id" : "2431",
            "name" : "市辖区",
            "zip_code" : "445101"
          },
          {
            "id" : "2432",
            "name" : "湘桥区",
            "zip_code" : "445102"
          },
          {
            "id" : "2433",
            "name" : "潮安县",
            "zip_code" : "445121"
          },
          {
            "id" : "2434",
            "name" : "饶平县",
            "zip_code" : "445122"
          }
        ],
        "name" : "潮州",
        "zip_code" : "445100"
      },
      {
        "id" : "251",
        "areas" : [
          {
            "id" : "2435",
            "name" : "市辖区",
            "zip_code" : "445201"
          },
          {
            "id" : "2436",
            "name" : "榕城区",
            "zip_code" : "445202"
          },
          {
            "id" : "2437",
            "name" : "揭东县",
            "zip_code" : "445221"
          },
          {
            "id" : "2438",
            "name" : "揭西县",
            "zip_code" : "445222"
          },
          {
            "id" : "2439",
            "name" : "惠来县",
            "zip_code" : "445224"
          },
          {
            "id" : "2440",
            "name" : "普宁市",
            "zip_code" : "445281"
          }
        ],
        "name" : "揭阳",
        "zip_code" : "445200"
      },
      {
        "id" : "252",
        "areas" : [
          {
            "id" : "2441",
            "name" : "市辖区",
            "zip_code" : "445301"
          },
          {
            "id" : "2442",
            "name" : "云城区",
            "zip_code" : "445302"
          },
          {
            "id" : "2443",
            "name" : "新兴县",
            "zip_code" : "445321"
          },
          {
            "id" : "2444",
            "name" : "郁南县",
            "zip_code" : "445322"
          },
          {
            "id" : "2445",
            "name" : "云安县",
            "zip_code" : "445323"
          },
          {
            "id" : "2446",
            "name" : "罗定市",
            "zip_code" : "445381"
          }
        ],
        "name" : "云浮",
        "zip_code" : "445300"
      }
    ],
    "id" : "20",
    "name" : "广东",
    "zip_code" : "440000"
  },
  {
    "cities" : [
      {
        "id" : "253",
        "areas" : [
          {
            "id" : "2447",
            "name" : "市辖区",
            "zip_code" : "450101"
          },
          {
            "id" : "2448",
            "name" : "兴宁区",
            "zip_code" : "450102"
          },
          {
            "id" : "2449",
            "name" : "青秀区",
            "zip_code" : "450103"
          },
          {
            "id" : "2450",
            "name" : "江南区",
            "zip_code" : "450105"
          },
          {
            "id" : "2451",
            "name" : "西乡塘区",
            "zip_code" : "450107"
          },
          {
            "id" : "2452",
            "name" : "良庆区",
            "zip_code" : "450108"
          },
          {
            "id" : "2453",
            "name" : "邕宁区",
            "zip_code" : "450109"
          },
          {
            "id" : "2454",
            "name" : "武鸣县",
            "zip_code" : "450122"
          },
          {
            "id" : "2455",
            "name" : "隆安县",
            "zip_code" : "450123"
          },
          {
            "id" : "2456",
            "name" : "马山县",
            "zip_code" : "450124"
          },
          {
            "id" : "2457",
            "name" : "上林县",
            "zip_code" : "450125"
          },
          {
            "id" : "2458",
            "name" : "宾阳县",
            "zip_code" : "450126"
          },
          {
            "id" : "2459",
            "name" : "横县",
            "zip_code" : "450127"
          }
        ],
        "name" : "南宁",
        "zip_code" : "450100"
      },
      {
        "id" : "254",
        "areas" : [
          {
            "id" : "2460",
            "name" : "市辖区",
            "zip_code" : "450201"
          },
          {
            "id" : "2461",
            "name" : "城中区",
            "zip_code" : "450202"
          },
          {
            "id" : "2462",
            "name" : "鱼峰区",
            "zip_code" : "450203"
          },
          {
            "id" : "2463",
            "name" : "柳南区",
            "zip_code" : "450204"
          },
          {
            "id" : "2464",
            "name" : "柳北区",
            "zip_code" : "450205"
          },
          {
            "id" : "2465",
            "name" : "柳江县",
            "zip_code" : "450221"
          },
          {
            "id" : "2466",
            "name" : "柳城县",
            "zip_code" : "450222"
          },
          {
            "id" : "2467",
            "name" : "鹿寨县",
            "zip_code" : "450223"
          },
          {
            "id" : "2468",
            "name" : "融安县",
            "zip_code" : "450224"
          },
          {
            "id" : "2469",
            "name" : "融水苗族自治县",
            "zip_code" : "450225"
          },
          {
            "id" : "2470",
            "name" : "三江侗族自治县",
            "zip_code" : "450226"
          }
        ],
        "name" : "柳州",
        "zip_code" : "450200"
      },
      {
        "id" : "255",
        "areas" : [
          {
            "id" : "2471",
            "name" : "市辖区",
            "zip_code" : "450301"
          },
          {
            "id" : "2472",
            "name" : "秀峰区",
            "zip_code" : "450302"
          },
          {
            "id" : "2473",
            "name" : "叠彩区",
            "zip_code" : "450303"
          },
          {
            "id" : "2474",
            "name" : "象山区",
            "zip_code" : "450304"
          },
          {
            "id" : "2475",
            "name" : "七星区",
            "zip_code" : "450305"
          },
          {
            "id" : "2476",
            "name" : "雁山区",
            "zip_code" : "450311"
          },
          {
            "id" : "2477",
            "name" : "阳朔县",
            "zip_code" : "450321"
          },
          {
            "id" : "2478",
            "name" : "临桂县",
            "zip_code" : "450322"
          },
          {
            "id" : "2479",
            "name" : "灵川县",
            "zip_code" : "450323"
          },
          {
            "id" : "2480",
            "name" : "全州县",
            "zip_code" : "450324"
          },
          {
            "id" : "2481",
            "name" : "兴安县",
            "zip_code" : "450325"
          },
          {
            "id" : "2482",
            "name" : "永福县",
            "zip_code" : "450326"
          },
          {
            "id" : "2483",
            "name" : "灌阳县",
            "zip_code" : "450327"
          },
          {
            "id" : "2484",
            "name" : "龙胜各族自治县",
            "zip_code" : "450328"
          },
          {
            "id" : "2485",
            "name" : "资源县",
            "zip_code" : "450329"
          },
          {
            "id" : "2486",
            "name" : "平乐县",
            "zip_code" : "450330"
          },
          {
            "id" : "2487",
            "name" : "荔蒲县",
            "zip_code" : "450331"
          },
          {
            "id" : "2488",
            "name" : "恭城瑶族自治县",
            "zip_code" : "450332"
          }
        ],
        "name" : "桂林",
        "zip_code" : "450300"
      },
      {
        "id" : "256",
        "areas" : [
          {
            "id" : "2489",
            "name" : "市辖区",
            "zip_code" : "450401"
          },
          {
            "id" : "2490",
            "name" : "万秀区",
            "zip_code" : "450403"
          },
          {
            "id" : "2491",
            "name" : "蝶山区",
            "zip_code" : "450404"
          },
          {
            "id" : "2492",
            "name" : "长洲区",
            "zip_code" : "450405"
          },
          {
            "id" : "2493",
            "name" : "苍梧县",
            "zip_code" : "450421"
          },
          {
            "id" : "2494",
            "name" : "藤县",
            "zip_code" : "450422"
          },
          {
            "id" : "2495",
            "name" : "蒙山县",
            "zip_code" : "450423"
          },
          {
            "id" : "2496",
            "name" : "岑溪市",
            "zip_code" : "450481"
          }
        ],
        "name" : "梧州",
        "zip_code" : "450400"
      },
      {
        "id" : "257",
        "areas" : [
          {
            "id" : "2497",
            "name" : "市辖区",
            "zip_code" : "450501"
          },
          {
            "id" : "2498",
            "name" : "海城区",
            "zip_code" : "450502"
          },
          {
            "id" : "2499",
            "name" : "银海区",
            "zip_code" : "450503"
          },
          {
            "id" : "2500",
            "name" : "铁山港区",
            "zip_code" : "450512"
          },
          {
            "id" : "2501",
            "name" : "合浦县",
            "zip_code" : "450521"
          }
        ],
        "name" : "北海",
        "zip_code" : "450500"
      },
      {
        "id" : "258",
        "areas" : [
          {
            "id" : "2502",
            "name" : "市辖区",
            "zip_code" : "450601"
          },
          {
            "id" : "2503",
            "name" : "港口区",
            "zip_code" : "450602"
          },
          {
            "id" : "2504",
            "name" : "防城区",
            "zip_code" : "450603"
          },
          {
            "id" : "2505",
            "name" : "上思县",
            "zip_code" : "450621"
          },
          {
            "id" : "2506",
            "name" : "东兴市",
            "zip_code" : "450681"
          }
        ],
        "name" : "防城港",
        "zip_code" : "450600"
      },
      {
        "id" : "259",
        "areas" : [
          {
            "id" : "2507",
            "name" : "市辖区",
            "zip_code" : "450701"
          },
          {
            "id" : "2508",
            "name" : "钦南区",
            "zip_code" : "450702"
          },
          {
            "id" : "2509",
            "name" : "钦北区",
            "zip_code" : "450703"
          },
          {
            "id" : "2510",
            "name" : "灵山县",
            "zip_code" : "450721"
          },
          {
            "id" : "2511",
            "name" : "浦北县",
            "zip_code" : "450722"
          }
        ],
        "name" : "钦州",
        "zip_code" : "450700"
      },
      {
        "id" : "260",
        "areas" : [
          {
            "id" : "2512",
            "name" : "市辖区",
            "zip_code" : "450801"
          },
          {
            "id" : "2513",
            "name" : "港北区",
            "zip_code" : "450802"
          },
          {
            "id" : "2514",
            "name" : "港南区",
            "zip_code" : "450803"
          },
          {
            "id" : "2515",
            "name" : "覃塘区",
            "zip_code" : "450804"
          },
          {
            "id" : "2516",
            "name" : "平南县",
            "zip_code" : "450821"
          },
          {
            "id" : "2517",
            "name" : "桂平市",
            "zip_code" : "450881"
          }
        ],
        "name" : "贵港",
        "zip_code" : "450800"
      },
      {
        "id" : "261",
        "areas" : [
          {
            "id" : "2518",
            "name" : "市辖区",
            "zip_code" : "450901"
          },
          {
            "id" : "2519",
            "name" : "玉州区",
            "zip_code" : "450902"
          },
          {
            "id" : "2520",
            "name" : "容县",
            "zip_code" : "450921"
          },
          {
            "id" : "2521",
            "name" : "陆川县",
            "zip_code" : "450922"
          },
          {
            "id" : "2522",
            "name" : "博白县",
            "zip_code" : "450923"
          },
          {
            "id" : "2523",
            "name" : "兴业县",
            "zip_code" : "450924"
          },
          {
            "id" : "2524",
            "name" : "北流市",
            "zip_code" : "450981"
          }
        ],
        "name" : "玉林",
        "zip_code" : "450900"
      },
      {
        "id" : "262",
        "areas" : [
          {
            "id" : "2525",
            "name" : "市辖区",
            "zip_code" : "451001"
          },
          {
            "id" : "2526",
            "name" : "右江区",
            "zip_code" : "451002"
          },
          {
            "id" : "2527",
            "name" : "田阳县",
            "zip_code" : "451021"
          },
          {
            "id" : "2528",
            "name" : "田东县",
            "zip_code" : "451022"
          },
          {
            "id" : "2529",
            "name" : "平果县",
            "zip_code" : "451023"
          },
          {
            "id" : "2530",
            "name" : "德保县",
            "zip_code" : "451024"
          },
          {
            "id" : "2531",
            "name" : "靖西县",
            "zip_code" : "451025"
          },
          {
            "id" : "2532",
            "name" : "那坡县",
            "zip_code" : "451026"
          },
          {
            "id" : "2533",
            "name" : "凌云县",
            "zip_code" : "451027"
          },
          {
            "id" : "2534",
            "name" : "乐业县",
            "zip_code" : "451028"
          },
          {
            "id" : "2535",
            "name" : "田林县",
            "zip_code" : "451029"
          },
          {
            "id" : "2536",
            "name" : "西林县",
            "zip_code" : "451030"
          },
          {
            "id" : "2537",
            "name" : "隆林各族自治县",
            "zip_code" : "451031"
          }
        ],
        "name" : "百色",
        "zip_code" : "451000"
      },
      {
        "id" : "263",
        "areas" : [
          {
            "id" : "2538",
            "name" : "市辖区",
            "zip_code" : "451101"
          },
          {
            "id" : "2539",
            "name" : "八步区",
            "zip_code" : "451102"
          },
          {
            "id" : "2540",
            "name" : "昭平县",
            "zip_code" : "451121"
          },
          {
            "id" : "2541",
            "name" : "钟山县",
            "zip_code" : "451122"
          },
          {
            "id" : "2542",
            "name" : "富川瑶族自治县",
            "zip_code" : "451123"
          },
          {
            "id" : "4800",
            "name" : "平桂管理区",
            "zip_code" : "451119"
          }
        ],
        "name" : "贺州",
        "zip_code" : "451100"
      },
      {
        "id" : "264",
        "areas" : [
          {
            "id" : "2543",
            "name" : "市辖区",
            "zip_code" : "451201"
          },
          {
            "id" : "2544",
            "name" : "金城江区",
            "zip_code" : "451202"
          },
          {
            "id" : "2545",
            "name" : "南丹县",
            "zip_code" : "451221"
          },
          {
            "id" : "2546",
            "name" : "天峨县",
            "zip_code" : "451222"
          },
          {
            "id" : "2547",
            "name" : "凤山县",
            "zip_code" : "451223"
          },
          {
            "id" : "2548",
            "name" : "东兰县",
            "zip_code" : "451224"
          },
          {
            "id" : "2549",
            "name" : "罗城仫佬族自治县",
            "zip_code" : "451225"
          },
          {
            "id" : "2550",
            "name" : "环江毛南族自治县",
            "zip_code" : "451226"
          },
          {
            "id" : "2551",
            "name" : "巴马瑶族自治县",
            "zip_code" : "451227"
          },
          {
            "id" : "2552",
            "name" : "都安瑶族自治县",
            "zip_code" : "451228"
          },
          {
            "id" : "2553",
            "name" : "大化瑶族自治县",
            "zip_code" : "451229"
          },
          {
            "id" : "2554",
            "name" : "宜州市",
            "zip_code" : "451281"
          }
        ],
        "name" : "河池",
        "zip_code" : "451200"
      },
      {
        "id" : "265",
        "areas" : [
          {
            "id" : "2555",
            "name" : "市辖区",
            "zip_code" : "451301"
          },
          {
            "id" : "2556",
            "name" : "兴宾区",
            "zip_code" : "451302"
          },
          {
            "id" : "2557",
            "name" : "忻城县",
            "zip_code" : "451321"
          },
          {
            "id" : "2558",
            "name" : "象州县",
            "zip_code" : "451322"
          },
          {
            "id" : "2559",
            "name" : "武宣县",
            "zip_code" : "451323"
          },
          {
            "id" : "2560",
            "name" : "金秀瑶族自治县",
            "zip_code" : "451324"
          },
          {
            "id" : "2561",
            "name" : "合山市",
            "zip_code" : "451381"
          }
        ],
        "name" : "来宾",
        "zip_code" : "451300"
      },
      {
        "id" : "266",
        "areas" : [
          {
            "id" : "2562",
            "name" : "市辖区",
            "zip_code" : "451401"
          },
          {
            "id" : "2563",
            "name" : "江洲区",
            "zip_code" : "451402"
          },
          {
            "id" : "2564",
            "name" : "扶绥县",
            "zip_code" : "451421"
          },
          {
            "id" : "2565",
            "name" : "宁明县",
            "zip_code" : "451422"
          },
          {
            "id" : "2566",
            "name" : "龙州县",
            "zip_code" : "451423"
          },
          {
            "id" : "2567",
            "name" : "大新县",
            "zip_code" : "451424"
          },
          {
            "id" : "2568",
            "name" : "天等县",
            "zip_code" : "451425"
          },
          {
            "id" : "2569",
            "name" : "凭祥市",
            "zip_code" : "451481"
          }
        ],
        "name" : "崇左",
        "zip_code" : "451400"
      }
    ],
    "id" : "21",
    "name" : "广西壮族自治区",
    "zip_code" : "450000"
  },
  {
    "cities" : [
      {
        "id" : "267",
        "areas" : [
          {
            "id" : "2570",
            "name" : "市辖区",
            "zip_code" : "460101"
          },
          {
            "id" : "2571",
            "name" : "秀英区",
            "zip_code" : "460105"
          },
          {
            "id" : "2572",
            "name" : "龙华区",
            "zip_code" : "460106"
          },
          {
            "id" : "2573",
            "name" : "琼山区",
            "zip_code" : "460107"
          },
          {
            "id" : "2574",
            "name" : "美兰区",
            "zip_code" : "460108"
          }
        ],
        "name" : "海口",
        "zip_code" : "460100"
      },
      {
        "id" : "268",
        "areas" : [
          {
            "id" : "2575",
            "name" : "市辖区",
            "zip_code" : "460201"
          }
        ],
        "name" : "三亚",
        "zip_code" : "460200"
      },
      {
        "id" : "269",
        "areas" : [
          {
            "id" : "2576",
            "name" : "五指山市",
            "zip_code" : "469001"
          },
          {
            "id" : "2577",
            "name" : "琼海市",
            "zip_code" : "469002"
          },
          {
            "id" : "2578",
            "name" : "儋州市",
            "zip_code" : "469003"
          },
          {
            "id" : "2579",
            "name" : "文昌市",
            "zip_code" : "469005"
          },
          {
            "id" : "2580",
            "name" : "万宁市",
            "zip_code" : "469006"
          },
          {
            "id" : "2581",
            "name" : "东方市",
            "zip_code" : "469007"
          },
          {
            "id" : "2582",
            "name" : "定安县",
            "zip_code" : "469021"
          },
          {
            "id" : "2583",
            "name" : "屯昌县",
            "zip_code" : "469022"
          },
          {
            "id" : "2584",
            "name" : "澄迈县",
            "zip_code" : "469023"
          },
          {
            "id" : "2585",
            "name" : "临高县",
            "zip_code" : "469024"
          },
          {
            "id" : "2586",
            "name" : "白沙黎族自治县",
            "zip_code" : "469025"
          },
          {
            "id" : "2587",
            "name" : "昌江黎族自治县",
            "zip_code" : "469026"
          },
          {
            "id" : "2588",
            "name" : "乐东黎族自治县",
            "zip_code" : "469027"
          },
          {
            "id" : "2589",
            "name" : "陵水黎族自治县",
            "zip_code" : "469028"
          },
          {
            "id" : "2590",
            "name" : "保亭黎族苗族自治县",
            "zip_code" : "469029"
          },
          {
            "id" : "2591",
            "name" : "琼中黎族苗族自治县",
            "zip_code" : "469030"
          },
          {
            "id" : "2592",
            "name" : "西沙群岛",
            "zip_code" : "469031"
          },
          {
            "id" : "2593",
            "name" : "南沙群岛",
            "zip_code" : "469032"
          },
          {
            "id" : "2594",
            "name" : "中沙群岛的岛礁及其海域",
            "zip_code" : "469033"
          }
        ],
        "name" : "省直辖县级行政区划",
        "zip_code" : "469000"
      }
    ],
    "id" : "22",
    "name" : "海南",
    "zip_code" : "460000"
  },
  {
    "cities" : [
      {
        "id" : "270",
        "areas" : [
          {
            "id" : "2595",
            "name" : "万州区",
            "zip_code" : "500101"
          },
          {
            "id" : "2596",
            "name" : "涪陵区",
            "zip_code" : "500102"
          },
          {
            "id" : "2597",
            "name" : "渝中区",
            "zip_code" : "500103"
          },
          {
            "id" : "2598",
            "name" : "大渡口区",
            "zip_code" : "500104"
          },
          {
            "id" : "2599",
            "name" : "江北区",
            "zip_code" : "500105"
          },
          {
            "id" : "2600",
            "name" : "沙坪坝区",
            "zip_code" : "500106"
          },
          {
            "id" : "2601",
            "name" : "九龙坡区",
            "zip_code" : "500107"
          },
          {
            "id" : "2602",
            "name" : "南岸区",
            "zip_code" : "500108"
          },
          {
            "id" : "2603",
            "name" : "北碚区",
            "zip_code" : "500109"
          },
          {
            "id" : "2604",
            "name" : "万盛区",
            "zip_code" : "500110"
          },
          {
            "id" : "2605",
            "name" : "双桥区",
            "zip_code" : "500111"
          },
          {
            "id" : "2606",
            "name" : "渝北区",
            "zip_code" : "500112"
          },
          {
            "id" : "2607",
            "name" : "巴南区",
            "zip_code" : "500113"
          },
          {
            "id" : "2608",
            "name" : "黔江区",
            "zip_code" : "500114"
          },
          {
            "id" : "2609",
            "name" : "长寿区",
            "zip_code" : "500115"
          },
          {
            "id" : "2610",
            "name" : "綦江县",
            "zip_code" : "500222"
          },
          {
            "id" : "2611",
            "name" : "潼南县",
            "zip_code" : "500223"
          },
          {
            "id" : "2612",
            "name" : "铜梁县",
            "zip_code" : "500224"
          },
          {
            "id" : "2613",
            "name" : "大足县",
            "zip_code" : "500225"
          },
          {
            "id" : "2614",
            "name" : "荣昌县",
            "zip_code" : "500226"
          },
          {
            "id" : "2615",
            "name" : "璧山县",
            "zip_code" : "500227"
          },
          {
            "id" : "2616",
            "name" : "梁平县",
            "zip_code" : "500228"
          },
          {
            "id" : "2617",
            "name" : "城口县",
            "zip_code" : "500229"
          },
          {
            "id" : "2618",
            "name" : "丰都县",
            "zip_code" : "500230"
          },
          {
            "id" : "2619",
            "name" : "垫江县",
            "zip_code" : "500231"
          },
          {
            "id" : "2620",
            "name" : "武隆县",
            "zip_code" : "500232"
          },
          {
            "id" : "2621",
            "name" : "忠县",
            "zip_code" : "500233"
          },
          {
            "id" : "2622",
            "name" : "开县",
            "zip_code" : "500234"
          },
          {
            "id" : "2623",
            "name" : "云阳县",
            "zip_code" : "500235"
          },
          {
            "id" : "2624",
            "name" : "奉节县",
            "zip_code" : "500236"
          },
          {
            "id" : "2625",
            "name" : "巫山县",
            "zip_code" : "500237"
          },
          {
            "id" : "2626",
            "name" : "巫溪县",
            "zip_code" : "500238"
          },
          {
            "id" : "2627",
            "name" : "石柱土家族自治县",
            "zip_code" : "500240"
          },
          {
            "id" : "2628",
            "name" : "秀山土家族苗族自治县",
            "zip_code" : "500241"
          },
          {
            "id" : "2629",
            "name" : "酉阳土家族苗族自治县",
            "zip_code" : "500242"
          },
          {
            "id" : "2630",
            "name" : "彭水苗族土家族自治县",
            "zip_code" : "500243"
          },
          {
            "id" : "4001",
            "name" : "江津区",
            "zip_code" : "500116"
          },
          {
            "id" : "4002",
            "name" : "合川区",
            "zip_code" : "500117"
          },
          {
            "id" : "4003",
            "name" : "永川区",
            "zip_code" : "500118"
          },
          {
            "id" : "4004",
            "name" : "南川区",
            "zip_code" : "500119"
          }
        ],
        "name" : "重庆",
        "zip_code" : "500100"
      }
    ],
    "id" : "23",
    "name" : "重庆",
    "zip_code" : "500000"
  },
  {
    "cities" : [
      {
        "id" : "273",
        "areas" : [
          {
            "id" : "2635",
            "name" : "市辖区",
            "zip_code" : "510101"
          },
          {
            "id" : "2636",
            "name" : "锦江区",
            "zip_code" : "510104"
          },
          {
            "id" : "2637",
            "name" : "青羊区",
            "zip_code" : "510105"
          },
          {
            "id" : "2638",
            "name" : "金牛区",
            "zip_code" : "510106"
          },
          {
            "id" : "2639",
            "name" : "武侯区",
            "zip_code" : "510107"
          },
          {
            "id" : "2640",
            "name" : "成华区",
            "zip_code" : "510108"
          },
          {
            "id" : "2641",
            "name" : "龙泉驿区",
            "zip_code" : "510112"
          },
          {
            "id" : "2642",
            "name" : "青白江区",
            "zip_code" : "510113"
          },
          {
            "id" : "2643",
            "name" : "新都区",
            "zip_code" : "510114"
          },
          {
            "id" : "2644",
            "name" : "温江区",
            "zip_code" : "510115"
          },
          {
            "id" : "2645",
            "name" : "金堂县",
            "zip_code" : "510121"
          },
          {
            "id" : "2646",
            "name" : "双流县",
            "zip_code" : "510122"
          },
          {
            "id" : "2647",
            "name" : "郫县",
            "zip_code" : "510124"
          },
          {
            "id" : "2648",
            "name" : "大邑县",
            "zip_code" : "510129"
          },
          {
            "id" : "2649",
            "name" : "蒲江县",
            "zip_code" : "510131"
          },
          {
            "id" : "2650",
            "name" : "新津县",
            "zip_code" : "510132"
          },
          {
            "id" : "2651",
            "name" : "都江堰市",
            "zip_code" : "510181"
          },
          {
            "id" : "2652",
            "name" : "彭州市",
            "zip_code" : "510182"
          },
          {
            "id" : "2653",
            "name" : "邛崃市",
            "zip_code" : "510183"
          },
          {
            "id" : "2654",
            "name" : "崇州市",
            "zip_code" : "510184"
          }
        ],
        "name" : "成都",
        "zip_code" : "510100"
      },
      {
        "id" : "274",
        "areas" : [
          {
            "id" : "2655",
            "name" : "市辖区",
            "zip_code" : "510301"
          },
          {
            "id" : "2656",
            "name" : "自流井区",
            "zip_code" : "510302"
          },
          {
            "id" : "2657",
            "name" : "贡井区",
            "zip_code" : "510303"
          },
          {
            "id" : "2658",
            "name" : "大安区",
            "zip_code" : "510304"
          },
          {
            "id" : "2659",
            "name" : "沿滩区",
            "zip_code" : "510311"
          },
          {
            "id" : "2660",
            "name" : "荣县",
            "zip_code" : "510321"
          },
          {
            "id" : "2661",
            "name" : "富顺县",
            "zip_code" : "510322"
          }
        ],
        "name" : "自贡",
        "zip_code" : "510300"
      },
      {
        "id" : "275",
        "areas" : [
          {
            "id" : "2662",
            "name" : "市辖区",
            "zip_code" : "510401"
          },
          {
            "id" : "2663",
            "name" : "东区",
            "zip_code" : "510402"
          },
          {
            "id" : "2664",
            "name" : "西区",
            "zip_code" : "510403"
          },
          {
            "id" : "2665",
            "name" : "仁和区",
            "zip_code" : "510411"
          },
          {
            "id" : "2666",
            "name" : "米易县",
            "zip_code" : "510421"
          },
          {
            "id" : "2667",
            "name" : "盐边县",
            "zip_code" : "510422"
          }
        ],
        "name" : "攀枝花",
        "zip_code" : "510400"
      },
      {
        "id" : "276",
        "areas" : [
          {
            "id" : "2668",
            "name" : "市辖区",
            "zip_code" : "510501"
          },
          {
            "id" : "2669",
            "name" : "江阳区",
            "zip_code" : "510502"
          },
          {
            "id" : "2670",
            "name" : "纳溪区",
            "zip_code" : "510503"
          },
          {
            "id" : "2671",
            "name" : "龙马潭区",
            "zip_code" : "510504"
          },
          {
            "id" : "2672",
            "name" : "泸县",
            "zip_code" : "510521"
          },
          {
            "id" : "2673",
            "name" : "合江县",
            "zip_code" : "510522"
          },
          {
            "id" : "2674",
            "name" : "叙永县",
            "zip_code" : "510524"
          },
          {
            "id" : "2675",
            "name" : "古蔺县",
            "zip_code" : "510525"
          }
        ],
        "name" : "泸州",
        "zip_code" : "510500"
      },
      {
        "id" : "277",
        "areas" : [
          {
            "id" : "2676",
            "name" : "市辖区",
            "zip_code" : "510601"
          },
          {
            "id" : "2677",
            "name" : "旌阳区",
            "zip_code" : "510603"
          },
          {
            "id" : "2678",
            "name" : "中江县",
            "zip_code" : "510623"
          },
          {
            "id" : "2679",
            "name" : "罗江县",
            "zip_code" : "510626"
          },
          {
            "id" : "2680",
            "name" : "广汉市",
            "zip_code" : "510681"
          },
          {
            "id" : "2681",
            "name" : "什邡市",
            "zip_code" : "510682"
          },
          {
            "id" : "2682",
            "name" : "绵竹市",
            "zip_code" : "510683"
          }
        ],
        "name" : "德阳",
        "zip_code" : "510600"
      },
      {
        "id" : "278",
        "areas" : [
          {
            "id" : "2683",
            "name" : "市辖区",
            "zip_code" : "510701"
          },
          {
            "id" : "2684",
            "name" : "涪城区",
            "zip_code" : "510703"
          },
          {
            "id" : "2685",
            "name" : "游仙区",
            "zip_code" : "510704"
          },
          {
            "id" : "2686",
            "name" : "三台县",
            "zip_code" : "510722"
          },
          {
            "id" : "2687",
            "name" : "盐亭县",
            "zip_code" : "510723"
          },
          {
            "id" : "2688",
            "name" : "安县",
            "zip_code" : "510724"
          },
          {
            "id" : "2689",
            "name" : "梓潼县",
            "zip_code" : "510725"
          },
          {
            "id" : "2690",
            "name" : "北川羌族自治县",
            "zip_code" : "510726"
          },
          {
            "id" : "2691",
            "name" : "平武县",
            "zip_code" : "510727"
          },
          {
            "id" : "2692",
            "name" : "江油市",
            "zip_code" : "510781"
          }
        ],
        "name" : "绵阳",
        "zip_code" : "510700"
      },
      {
        "id" : "279",
        "areas" : [
          {
            "id" : "2693",
            "name" : "市辖区",
            "zip_code" : "510801"
          },
          {
            "id" : "2694",
            "name" : "市中区",
            "zip_code" : "511002"
          },
          {
            "id" : "2695",
            "name" : "元坝区",
            "zip_code" : "510811"
          },
          {
            "id" : "2696",
            "name" : "朝天区",
            "zip_code" : "510812"
          },
          {
            "id" : "2697",
            "name" : "旺苍县",
            "zip_code" : "510821"
          },
          {
            "id" : "2698",
            "name" : "青川县",
            "zip_code" : "510822"
          },
          {
            "id" : "2699",
            "name" : "剑阁县",
            "zip_code" : "510823"
          },
          {
            "id" : "2700",
            "name" : "苍溪县",
            "zip_code" : "510824"
          },
          {
            "id" : "4900",
            "name" : "利州区",
            "zip_code" : "510802"
          }
        ],
        "name" : "广元",
        "zip_code" : "510800"
      },
      {
        "id" : "280",
        "areas" : [
          {
            "id" : "2701",
            "name" : "市辖区",
            "zip_code" : "510901"
          },
          {
            "id" : "2702",
            "name" : "船山区",
            "zip_code" : "510903"
          },
          {
            "id" : "2703",
            "name" : "安居区",
            "zip_code" : "510904"
          },
          {
            "id" : "2704",
            "name" : "蓬溪县",
            "zip_code" : "510921"
          },
          {
            "id" : "2705",
            "name" : "射洪县",
            "zip_code" : "510922"
          },
          {
            "id" : "2706",
            "name" : "大英县",
            "zip_code" : "510923"
          }
        ],
        "name" : "遂宁",
        "zip_code" : "510900"
      },
      {
        "id" : "281",
        "areas" : [
          {
            "id" : "2707",
            "name" : "市辖区",
            "zip_code" : "511001"
          },
          {
            "id" : "2708",
            "name" : "市中区",
            "zip_code" : "511002"
          },
          {
            "id" : "2709",
            "name" : "东兴区",
            "zip_code" : "511011"
          },
          {
            "id" : "2710",
            "name" : "威远县",
            "zip_code" : "511024"
          },
          {
            "id" : "2711",
            "name" : "资中县",
            "zip_code" : "511025"
          },
          {
            "id" : "2712",
            "name" : "隆昌县",
            "zip_code" : "511028"
          }
        ],
        "name" : "内江",
        "zip_code" : "511000"
      },
      {
        "id" : "282",
        "areas" : [
          {
            "id" : "2713",
            "name" : "市辖区",
            "zip_code" : "511101"
          },
          {
            "id" : "2714",
            "name" : "市中区",
            "zip_code" : "511102"
          },
          {
            "id" : "2715",
            "name" : "沙湾区",
            "zip_code" : "511111"
          },
          {
            "id" : "2716",
            "name" : "五通桥区",
            "zip_code" : "511112"
          },
          {
            "id" : "2717",
            "name" : "金口河区",
            "zip_code" : "511113"
          },
          {
            "id" : "2718",
            "name" : "犍为县",
            "zip_code" : "511123"
          },
          {
            "id" : "2719",
            "name" : "井研县",
            "zip_code" : "511124"
          },
          {
            "id" : "2720",
            "name" : "夹江县",
            "zip_code" : "511126"
          },
          {
            "id" : "2721",
            "name" : "沐川县",
            "zip_code" : "511129"
          },
          {
            "id" : "2722",
            "name" : "峨边彝族自治县",
            "zip_code" : "511132"
          },
          {
            "id" : "2723",
            "name" : "马边彝族自治县",
            "zip_code" : "511133"
          },
          {
            "id" : "2724",
            "name" : "峨眉山市",
            "zip_code" : "511181"
          }
        ],
        "name" : "乐山",
        "zip_code" : "511100"
      },
      {
        "id" : "283",
        "areas" : [
          {
            "id" : "2725",
            "name" : "市辖区",
            "zip_code" : "511301"
          },
          {
            "id" : "2726",
            "name" : "顺庆区",
            "zip_code" : "511302"
          },
          {
            "id" : "2727",
            "name" : "高坪区",
            "zip_code" : "511303"
          },
          {
            "id" : "2728",
            "name" : "嘉陵区",
            "zip_code" : "511304"
          },
          {
            "id" : "2729",
            "name" : "南部县",
            "zip_code" : "511321"
          },
          {
            "id" : "2730",
            "name" : "营山县",
            "zip_code" : "511322"
          },
          {
            "id" : "2731",
            "name" : "蓬安县",
            "zip_code" : "511323"
          },
          {
            "id" : "2732",
            "name" : "仪陇县",
            "zip_code" : "511324"
          },
          {
            "id" : "2733",
            "name" : "西充县",
            "zip_code" : "511325"
          },
          {
            "id" : "2734",
            "name" : "阆中市",
            "zip_code" : "511381"
          }
        ],
        "name" : "南充",
        "zip_code" : "511300"
      },
      {
        "id" : "284",
        "areas" : [
          {
            "id" : "2735",
            "name" : "市辖区",
            "zip_code" : "511401"
          },
          {
            "id" : "2736",
            "name" : "东坡区",
            "zip_code" : "511402"
          },
          {
            "id" : "2737",
            "name" : "仁寿县",
            "zip_code" : "511421"
          },
          {
            "id" : "2738",
            "name" : "彭山县",
            "zip_code" : "511422"
          },
          {
            "id" : "2739",
            "name" : "洪雅县",
            "zip_code" : "511423"
          },
          {
            "id" : "2740",
            "name" : "丹棱县",
            "zip_code" : "511424"
          },
          {
            "id" : "2741",
            "name" : "青神县",
            "zip_code" : "511425"
          }
        ],
        "name" : "眉山",
        "zip_code" : "511400"
      },
      {
        "id" : "285",
        "areas" : [
          {
            "id" : "2742",
            "name" : "市辖区",
            "zip_code" : "511501"
          },
          {
            "id" : "2743",
            "name" : "翠屏区",
            "zip_code" : "511502"
          },
          {
            "id" : "2744",
            "name" : "宜宾县",
            "zip_code" : "511521"
          },
          {
            "id" : "2745",
            "name" : "南溪县",
            "zip_code" : "511522"
          },
          {
            "id" : "2746",
            "name" : "江安县",
            "zip_code" : "511523"
          },
          {
            "id" : "2747",
            "name" : "长宁县",
            "zip_code" : "511524"
          },
          {
            "id" : "2748",
            "name" : "高县",
            "zip_code" : "511525"
          },
          {
            "id" : "2749",
            "name" : "珙县",
            "zip_code" : "511526"
          },
          {
            "id" : "2750",
            "name" : "筠连县",
            "zip_code" : "511527"
          },
          {
            "id" : "2751",
            "name" : "兴文县",
            "zip_code" : "511528"
          },
          {
            "id" : "2752",
            "name" : "屏山县",
            "zip_code" : "511529"
          }
        ],
        "name" : "宜宾",
        "zip_code" : "511500"
      },
      {
        "id" : "286",
        "areas" : [
          {
            "id" : "2753",
            "name" : "市辖区",
            "zip_code" : "511601"
          },
          {
            "id" : "2754",
            "name" : "广安区",
            "zip_code" : "511602"
          },
          {
            "id" : "2755",
            "name" : "岳池县",
            "zip_code" : "511621"
          },
          {
            "id" : "2756",
            "name" : "武胜县",
            "zip_code" : "511622"
          },
          {
            "id" : "2757",
            "name" : "邻水县",
            "zip_code" : "511623"
          },
          {
            "id" : "5000",
            "name" : "华蓥市",
            "zip_code" : "511681"
          }
        ],
        "name" : "广安",
        "zip_code" : "511600"
      },
      {
        "id" : "287",
        "areas" : [
          {
            "id" : "2759",
            "name" : "市辖区",
            "zip_code" : "511701"
          },
          {
            "id" : "2760",
            "name" : "通川区",
            "zip_code" : "511702"
          },
          {
            "id" : "2761",
            "name" : "达县",
            "zip_code" : "511721"
          },
          {
            "id" : "2762",
            "name" : "宣汉县",
            "zip_code" : "511722"
          },
          {
            "id" : "2763",
            "name" : "开江县",
            "zip_code" : "511723"
          },
          {
            "id" : "2764",
            "name" : "大竹县",
            "zip_code" : "511724"
          },
          {
            "id" : "2765",
            "name" : "渠县",
            "zip_code" : "511725"
          },
          {
            "id" : "2766",
            "name" : "万源市",
            "zip_code" : "511781"
          }
        ],
        "name" : "达州",
        "zip_code" : "511700"
      },
      {
        "id" : "288",
        "areas" : [
          {
            "id" : "2767",
            "name" : "市辖区",
            "zip_code" : "511801"
          },
          {
            "id" : "2768",
            "name" : "雨城区",
            "zip_code" : "511802"
          },
          {
            "id" : "2769",
            "name" : "名山县",
            "zip_code" : "511821"
          },
          {
            "id" : "2770",
            "name" : "荥经县",
            "zip_code" : "511822"
          },
          {
            "id" : "2771",
            "name" : "汉源县",
            "zip_code" : "511823"
          },
          {
            "id" : "2772",
            "name" : "石棉县",
            "zip_code" : "511824"
          },
          {
            "id" : "2773",
            "name" : "天全县",
            "zip_code" : "511825"
          },
          {
            "id" : "2774",
            "name" : "芦山县",
            "zip_code" : "511826"
          },
          {
            "id" : "2775",
            "name" : "宝兴县",
            "zip_code" : "511827"
          }
        ],
        "name" : "雅安",
        "zip_code" : "511800"
      },
      {
        "id" : "289",
        "areas" : [
          {
            "id" : "2776",
            "name" : "市辖区",
            "zip_code" : "511901"
          },
          {
            "id" : "2777",
            "name" : "巴州区",
            "zip_code" : "511902"
          },
          {
            "id" : "2778",
            "name" : "通江县",
            "zip_code" : "511921"
          },
          {
            "id" : "2779",
            "name" : "南江县",
            "zip_code" : "511922"
          },
          {
            "id" : "2780",
            "name" : "平昌县",
            "zip_code" : "511923"
          }
        ],
        "name" : "巴中",
        "zip_code" : "511900"
      },
      {
        "id" : "290",
        "areas" : [
          {
            "id" : "2781",
            "name" : "市辖区",
            "zip_code" : "512001"
          },
          {
            "id" : "2782",
            "name" : "雁江区",
            "zip_code" : "512002"
          },
          {
            "id" : "2783",
            "name" : "安岳县",
            "zip_code" : "512021"
          },
          {
            "id" : "2784",
            "name" : "乐至县",
            "zip_code" : "512022"
          },
          {
            "id" : "2785",
            "name" : "简阳市",
            "zip_code" : "512081"
          }
        ],
        "name" : "资阳",
        "zip_code" : "512000"
      },
      {
        "id" : "291",
        "areas" : [
          {
            "id" : "2786",
            "name" : "汶川县",
            "zip_code" : "513221"
          },
          {
            "id" : "2787",
            "name" : "理县",
            "zip_code" : "513222"
          },
          {
            "id" : "2788",
            "name" : "茂县",
            "zip_code" : "513223"
          },
          {
            "id" : "2789",
            "name" : "松潘县",
            "zip_code" : "513224"
          },
          {
            "id" : "2790",
            "name" : "九寨沟县",
            "zip_code" : "513225"
          },
          {
            "id" : "2791",
            "name" : "金川县",
            "zip_code" : "513226"
          },
          {
            "id" : "2792",
            "name" : "小金县",
            "zip_code" : "513227"
          },
          {
            "id" : "2793",
            "name" : "黑水县",
            "zip_code" : "513228"
          },
          {
            "id" : "2794",
            "name" : "马尔康县",
            "zip_code" : "513229"
          },
          {
            "id" : "2795",
            "name" : "壤塘县",
            "zip_code" : "513230"
          },
          {
            "id" : "2796",
            "name" : "阿坝县",
            "zip_code" : "513231"
          },
          {
            "id" : "2797",
            "name" : "若尔盖县",
            "zip_code" : "513232"
          },
          {
            "id" : "2798",
            "name" : "红原县",
            "zip_code" : "513233"
          }
        ],
        "name" : "阿坝藏族羌族自治州",
        "zip_code" : "513200"
      },
      {
        "id" : "292",
        "areas" : [
          {
            "id" : "2799",
            "name" : "康定县",
            "zip_code" : "513321"
          },
          {
            "id" : "2800",
            "name" : "泸定县",
            "zip_code" : "513322"
          },
          {
            "id" : "2801",
            "name" : "丹巴县",
            "zip_code" : "513323"
          },
          {
            "id" : "2802",
            "name" : "九龙县",
            "zip_code" : "513324"
          },
          {
            "id" : "2803",
            "name" : "雅江县",
            "zip_code" : "513325"
          },
          {
            "id" : "2804",
            "name" : "道孚县",
            "zip_code" : "513326"
          },
          {
            "id" : "2805",
            "name" : "炉霍县",
            "zip_code" : "513327"
          },
          {
            "id" : "2806",
            "name" : "甘孜县",
            "zip_code" : "513328"
          },
          {
            "id" : "2807",
            "name" : "新龙县",
            "zip_code" : "513329"
          },
          {
            "id" : "2808",
            "name" : "德格县",
            "zip_code" : "513330"
          },
          {
            "id" : "2809",
            "name" : "白玉县",
            "zip_code" : "513331"
          },
          {
            "id" : "2810",
            "name" : "石渠县",
            "zip_code" : "513332"
          },
          {
            "id" : "2811",
            "name" : "色达县",
            "zip_code" : "513333"
          },
          {
            "id" : "2812",
            "name" : "理塘县",
            "zip_code" : "513334"
          },
          {
            "id" : "2813",
            "name" : "巴塘县",
            "zip_code" : "513335"
          },
          {
            "id" : "2814",
            "name" : "乡城县",
            "zip_code" : "513336"
          },
          {
            "id" : "2815",
            "name" : "稻城县",
            "zip_code" : "513337"
          },
          {
            "id" : "2816",
            "name" : "得荣县",
            "zip_code" : "513338"
          }
        ],
        "name" : "甘孜藏族自治州",
        "zip_code" : "513300"
      },
      {
        "id" : "293",
        "areas" : [
          {
            "id" : "2817",
            "name" : "西昌市",
            "zip_code" : "513401"
          },
          {
            "id" : "2818",
            "name" : "木里藏族自治县",
            "zip_code" : "513422"
          },
          {
            "id" : "2819",
            "name" : "盐源县",
            "zip_code" : "513423"
          },
          {
            "id" : "2820",
            "name" : "德昌县",
            "zip_code" : "513424"
          },
          {
            "id" : "2821",
            "name" : "会理县",
            "zip_code" : "513425"
          },
          {
            "id" : "2822",
            "name" : "会东县",
            "zip_code" : "513426"
          },
          {
            "id" : "2823",
            "name" : "宁南县",
            "zip_code" : "513427"
          },
          {
            "id" : "2824",
            "name" : "普格县",
            "zip_code" : "513428"
          },
          {
            "id" : "2825",
            "name" : "布拖县",
            "zip_code" : "513429"
          },
          {
            "id" : "2826",
            "name" : "金阳县",
            "zip_code" : "513430"
          },
          {
            "id" : "2827",
            "name" : "昭觉县",
            "zip_code" : "513431"
          },
          {
            "id" : "2828",
            "name" : "喜德县",
            "zip_code" : "513432"
          },
          {
            "id" : "2829",
            "name" : "冕宁县",
            "zip_code" : "513433"
          },
          {
            "id" : "2830",
            "name" : "越西县",
            "zip_code" : "513434"
          },
          {
            "id" : "2831",
            "name" : "甘洛县",
            "zip_code" : "513435"
          },
          {
            "id" : "2832",
            "name" : "美姑县",
            "zip_code" : "513436"
          },
          {
            "id" : "2833",
            "name" : "雷波县",
            "zip_code" : "513437"
          }
        ],
        "name" : "凉山彝族自治州",
        "zip_code" : "513400"
      }
    ],
    "id" : "24",
    "name" : "四川",
    "zip_code" : "510000"
  },
  {
    "cities" : [
      {
        "id" : "294",
        "areas" : [
          {
            "id" : "2834",
            "name" : "市辖区",
            "zip_code" : "520101"
          },
          {
            "id" : "2835",
            "name" : "南明区",
            "zip_code" : "520102"
          },
          {
            "id" : "2836",
            "name" : "云岩区",
            "zip_code" : "520103"
          },
          {
            "id" : "2837",
            "name" : "花溪区",
            "zip_code" : "520111"
          },
          {
            "id" : "2838",
            "name" : "乌当区",
            "zip_code" : "520112"
          },
          {
            "id" : "2839",
            "name" : "白云区",
            "zip_code" : "520113"
          },
          {
            "id" : "2840",
            "name" : "小河区",
            "zip_code" : "520114"
          },
          {
            "id" : "2841",
            "name" : "开阳县",
            "zip_code" : "520121"
          },
          {
            "id" : "2842",
            "name" : "息烽县",
            "zip_code" : "520122"
          },
          {
            "id" : "2843",
            "name" : "修文县",
            "zip_code" : "520123"
          },
          {
            "id" : "2844",
            "name" : "清镇市",
            "zip_code" : "520181"
          }
        ],
        "name" : "贵阳",
        "zip_code" : "520100"
      },
      {
        "id" : "295",
        "areas" : [
          {
            "id" : "2845",
            "name" : "钟山区",
            "zip_code" : "520201"
          },
          {
            "id" : "2846",
            "name" : "六枝特区",
            "zip_code" : "520203"
          },
          {
            "id" : "2847",
            "name" : "水城县",
            "zip_code" : "520221"
          },
          {
            "id" : "2848",
            "name" : "盘县",
            "zip_code" : "520222"
          }
        ],
        "name" : "六盘水",
        "zip_code" : "520200"
      },
      {
        "id" : "296",
        "areas" : [
          {
            "id" : "2849",
            "name" : "市辖区",
            "zip_code" : "520301"
          },
          {
            "id" : "2850",
            "name" : "红花岗区",
            "zip_code" : "520302"
          },
          {
            "id" : "2851",
            "name" : "汇川区",
            "zip_code" : "520303"
          },
          {
            "id" : "2852",
            "name" : "遵义县",
            "zip_code" : "520321"
          },
          {
            "id" : "2853",
            "name" : "桐梓县",
            "zip_code" : "520322"
          },
          {
            "id" : "2854",
            "name" : "绥阳县",
            "zip_code" : "520323"
          },
          {
            "id" : "2855",
            "name" : "正安县",
            "zip_code" : "520324"
          },
          {
            "id" : "2856",
            "name" : "道真仡佬族苗族自治县",
            "zip_code" : "520325"
          },
          {
            "id" : "2857",
            "name" : "务川仡佬族苗族自治县",
            "zip_code" : "520326"
          },
          {
            "id" : "2858",
            "name" : "凤冈县",
            "zip_code" : "520327"
          },
          {
            "id" : "2859",
            "name" : "湄潭县",
            "zip_code" : "520328"
          },
          {
            "id" : "2860",
            "name" : "余庆县",
            "zip_code" : "520329"
          },
          {
            "id" : "2861",
            "name" : "习水县",
            "zip_code" : "520330"
          },
          {
            "id" : "2862",
            "name" : "赤水市",
            "zip_code" : "520381"
          },
          {
            "id" : "2863",
            "name" : "仁怀市",
            "zip_code" : "520382"
          }
        ],
        "name" : "遵义",
        "zip_code" : "520300"
      },
      {
        "id" : "297",
        "areas" : [
          {
            "id" : "2864",
            "name" : "市辖区",
            "zip_code" : "520401"
          },
          {
            "id" : "2865",
            "name" : "西秀区",
            "zip_code" : "520402"
          },
          {
            "id" : "2866",
            "name" : "平坝县",
            "zip_code" : "520421"
          },
          {
            "id" : "2867",
            "name" : "普定县",
            "zip_code" : "520422"
          },
          {
            "id" : "2868",
            "name" : "镇宁布依族苗族自治县",
            "zip_code" : "520423"
          },
          {
            "id" : "2869",
            "name" : "关岭布依族苗族自治县",
            "zip_code" : "520424"
          },
          {
            "id" : "2870",
            "name" : "紫云苗族布依族自治县",
            "zip_code" : "520425"
          }
        ],
        "name" : "安顺",
        "zip_code" : "520400"
      },
      {
        "id" : "298",
        "areas" : [
          {
            "id" : "2871",
            "name" : "铜仁市",
            "zip_code" : "522201"
          },
          {
            "id" : "2872",
            "name" : "江口县",
            "zip_code" : "522222"
          },
          {
            "id" : "2873",
            "name" : "玉屏侗族自治县",
            "zip_code" : "522223"
          },
          {
            "id" : "2874",
            "name" : "石阡县",
            "zip_code" : "522224"
          },
          {
            "id" : "2875",
            "name" : "思南县",
            "zip_code" : "522225"
          },
          {
            "id" : "2876",
            "name" : "印江土家族苗族自治县",
            "zip_code" : "522226"
          },
          {
            "id" : "2877",
            "name" : "德江县",
            "zip_code" : "522227"
          },
          {
            "id" : "2878",
            "name" : "沿河土家族自治县",
            "zip_code" : "522228"
          },
          {
            "id" : "2879",
            "name" : "松桃苗族自治县",
            "zip_code" : "522229"
          },
          {
            "id" : "2880",
            "name" : "万山特区",
            "zip_code" : "522230"
          }
        ],
        "name" : "铜仁地区",
        "zip_code" : "522200"
      },
      {
        "id" : "299",
        "areas" : [
          {
            "id" : "2881",
            "name" : "兴义市",
            "zip_code" : "522301"
          },
          {
            "id" : "2882",
            "name" : "兴仁县",
            "zip_code" : "522322"
          },
          {
            "id" : "2883",
            "name" : "普安县",
            "zip_code" : "522323"
          },
          {
            "id" : "2884",
            "name" : "晴隆县",
            "zip_code" : "522324"
          },
          {
            "id" : "2885",
            "name" : "贞丰县",
            "zip_code" : "522325"
          },
          {
            "id" : "2886",
            "name" : "望谟县",
            "zip_code" : "522326"
          },
          {
            "id" : "2887",
            "name" : "册亨县",
            "zip_code" : "522327"
          },
          {
            "id" : "2888",
            "name" : "安龙县",
            "zip_code" : "522328"
          }
        ],
        "name" : "黔西南布依族苗族自治州",
        "zip_code" : "522300"
      },
      {
        "id" : "300",
        "areas" : [
          {
            "id" : "2889",
            "name" : "毕节市",
            "zip_code" : "522401"
          },
          {
            "id" : "2890",
            "name" : "大方县",
            "zip_code" : "522422"
          },
          {
            "id" : "2891",
            "name" : "黔西县",
            "zip_code" : "522423"
          },
          {
            "id" : "2892",
            "name" : "金沙县",
            "zip_code" : "522424"
          },
          {
            "id" : "2893",
            "name" : "织金县",
            "zip_code" : "522425"
          },
          {
            "id" : "2894",
            "name" : "纳雍县",
            "zip_code" : "522426"
          },
          {
            "id" : "2895",
            "name" : "威宁彝族回族苗族自治县",
            "zip_code" : "522427"
          },
          {
            "id" : "2896",
            "name" : "赫章县",
            "zip_code" : "522428"
          }
        ],
        "name" : "毕节地区",
        "zip_code" : "522400"
      },
      {
        "id" : "301",
        "areas" : [
          {
            "id" : "2897",
            "name" : "凯里市",
            "zip_code" : "522601"
          },
          {
            "id" : "2898",
            "name" : "黄平县",
            "zip_code" : "522622"
          },
          {
            "id" : "2899",
            "name" : "施秉县",
            "zip_code" : "522623"
          },
          {
            "id" : "2900",
            "name" : "三穗县",
            "zip_code" : "522624"
          },
          {
            "id" : "2901",
            "name" : "镇远县",
            "zip_code" : "522625"
          },
          {
            "id" : "2902",
            "name" : "岑巩县",
            "zip_code" : "522626"
          },
          {
            "id" : "2903",
            "name" : "天柱县",
            "zip_code" : "522627"
          },
          {
            "id" : "2904",
            "name" : "锦屏县",
            "zip_code" : "522628"
          },
          {
            "id" : "2905",
            "name" : "剑河县",
            "zip_code" : "522629"
          },
          {
            "id" : "2906",
            "name" : "台江县",
            "zip_code" : "522630"
          },
          {
            "id" : "2907",
            "name" : "黎平县",
            "zip_code" : "522631"
          },
          {
            "id" : "2908",
            "name" : "榕江县",
            "zip_code" : "522632"
          },
          {
            "id" : "2909",
            "name" : "从江县",
            "zip_code" : "522633"
          },
          {
            "id" : "2910",
            "name" : "雷山县",
            "zip_code" : "522634"
          },
          {
            "id" : "2911",
            "name" : "麻江县",
            "zip_code" : "522635"
          },
          {
            "id" : "2912",
            "name" : "丹寨县",
            "zip_code" : "522636"
          }
        ],
        "name" : "黔东南苗族侗族自治州",
        "zip_code" : "522600"
      },
      {
        "id" : "302",
        "areas" : [
          {
            "id" : "2913",
            "name" : "都匀市",
            "zip_code" : "522701"
          },
          {
            "id" : "2914",
            "name" : "福泉市",
            "zip_code" : "522702"
          },
          {
            "id" : "2915",
            "name" : "荔波县",
            "zip_code" : "522722"
          },
          {
            "id" : "2916",
            "name" : "贵定县",
            "zip_code" : "522723"
          },
          {
            "id" : "2917",
            "name" : "瓮安县",
            "zip_code" : "522725"
          },
          {
            "id" : "2918",
            "name" : "独山县",
            "zip_code" : "522726"
          },
          {
            "id" : "2919",
            "name" : "平塘县",
            "zip_code" : "522727"
          },
          {
            "id" : "2920",
            "name" : "罗甸县",
            "zip_code" : "522728"
          },
          {
            "id" : "2921",
            "name" : "长顺县",
            "zip_code" : "522729"
          },
          {
            "id" : "2922",
            "name" : "龙里县",
            "zip_code" : "522730"
          },
          {
            "id" : "2923",
            "name" : "惠水县",
            "zip_code" : "522731"
          },
          {
            "id" : "2924",
            "name" : "三都水族自治县",
            "zip_code" : "522732"
          }
        ],
        "name" : "黔南布依族苗族自治州",
        "zip_code" : "522700"
      }
    ],
    "id" : "25",
    "name" : "贵州",
    "zip_code" : "520000"
  },
  {
    "cities" : [
      {
        "id" : "303",
        "areas" : [
          {
            "id" : "2925",
            "name" : "市辖区",
            "zip_code" : "530101"
          },
          {
            "id" : "2926",
            "name" : "五华区",
            "zip_code" : "530102"
          },
          {
            "id" : "2927",
            "name" : "盘龙区",
            "zip_code" : "530103"
          },
          {
            "id" : "2928",
            "name" : "官渡区",
            "zip_code" : "530111"
          },
          {
            "id" : "2929",
            "name" : "西山区",
            "zip_code" : "530112"
          },
          {
            "id" : "2930",
            "name" : "东川区",
            "zip_code" : "530113"
          },
          {
            "id" : "2931",
            "name" : "呈贡县",
            "zip_code" : "530121"
          },
          {
            "id" : "2932",
            "name" : "晋宁县",
            "zip_code" : "530122"
          },
          {
            "id" : "2933",
            "name" : "富民县",
            "zip_code" : "530124"
          },
          {
            "id" : "2934",
            "name" : "宜良县",
            "zip_code" : "530125"
          },
          {
            "id" : "2935",
            "name" : "石林彝族自治县",
            "zip_code" : "530126"
          },
          {
            "id" : "2936",
            "name" : "嵩明县",
            "zip_code" : "530127"
          },
          {
            "id" : "2937",
            "name" : "禄劝彝族苗族自治县",
            "zip_code" : "530128"
          },
          {
            "id" : "2938",
            "name" : "寻甸回族彝族自治县",
            "zip_code" : "530129"
          },
          {
            "id" : "2939",
            "name" : "安宁市",
            "zip_code" : "530181"
          }
        ],
        "name" : "昆明",
        "zip_code" : "530100"
      },
      {
        "id" : "304",
        "areas" : [
          {
            "id" : "2940",
            "name" : "市辖区",
            "zip_code" : "530301"
          },
          {
            "id" : "2941",
            "name" : "麒麟区",
            "zip_code" : "530302"
          },
          {
            "id" : "2942",
            "name" : "马龙县",
            "zip_code" : "530321"
          },
          {
            "id" : "2943",
            "name" : "陆良县",
            "zip_code" : "530322"
          },
          {
            "id" : "2944",
            "name" : "师宗县",
            "zip_code" : "530323"
          },
          {
            "id" : "2945",
            "name" : "罗平县",
            "zip_code" : "530324"
          },
          {
            "id" : "2946",
            "name" : "富源县",
            "zip_code" : "530325"
          },
          {
            "id" : "2947",
            "name" : "会泽县",
            "zip_code" : "530326"
          },
          {
            "id" : "2948",
            "name" : "沾益县",
            "zip_code" : "530328"
          },
          {
            "id" : "2949",
            "name" : "宣威市",
            "zip_code" : "530381"
          }
        ],
        "name" : "曲靖",
        "zip_code" : "530300"
      },
      {
        "id" : "305",
        "areas" : [
          {
            "id" : "2950",
            "name" : "市辖区",
            "zip_code" : "530401"
          },
          {
            "id" : "2951",
            "name" : "红塔区",
            "zip_code" : "530402"
          },
          {
            "id" : "2952",
            "name" : "江川县",
            "zip_code" : "530421"
          },
          {
            "id" : "2953",
            "name" : "澄江县",
            "zip_code" : "530422"
          },
          {
            "id" : "2954",
            "name" : "通海县",
            "zip_code" : "530423"
          },
          {
            "id" : "2955",
            "name" : "华宁县",
            "zip_code" : "530424"
          },
          {
            "id" : "2956",
            "name" : "易门县",
            "zip_code" : "530425"
          },
          {
            "id" : "2957",
            "name" : "峨山彝族自治县",
            "zip_code" : "530426"
          },
          {
            "id" : "2958",
            "name" : "新平彝族傣族自治县",
            "zip_code" : "530427"
          },
          {
            "id" : "2959",
            "name" : "元江哈尼族彝族傣族自治县",
            "zip_code" : "530428"
          }
        ],
        "name" : "玉溪",
        "zip_code" : "530400"
      },
      {
        "id" : "306",
        "areas" : [
          {
            "id" : "2960",
            "name" : "市辖区",
            "zip_code" : "530501"
          },
          {
            "id" : "2961",
            "name" : "隆阳区",
            "zip_code" : "530502"
          },
          {
            "id" : "2962",
            "name" : "施甸县",
            "zip_code" : "530521"
          },
          {
            "id" : "2963",
            "name" : "腾冲县",
            "zip_code" : "530522"
          },
          {
            "id" : "2964",
            "name" : "龙陵县",
            "zip_code" : "530523"
          },
          {
            "id" : "2965",
            "name" : "昌宁县",
            "zip_code" : "530524"
          }
        ],
        "name" : "保山",
        "zip_code" : "530500"
      },
      {
        "id" : "307",
        "areas" : [
          {
            "id" : "2966",
            "name" : "市辖区",
            "zip_code" : "530601"
          },
          {
            "id" : "2967",
            "name" : "昭阳区",
            "zip_code" : "530602"
          },
          {
            "id" : "2968",
            "name" : "鲁甸县",
            "zip_code" : "530621"
          },
          {
            "id" : "2969",
            "name" : "巧家县",
            "zip_code" : "530622"
          },
          {
            "id" : "2970",
            "name" : "盐津县",
            "zip_code" : "530623"
          },
          {
            "id" : "2971",
            "name" : "大关县",
            "zip_code" : "530624"
          },
          {
            "id" : "2972",
            "name" : "永善县",
            "zip_code" : "530625"
          },
          {
            "id" : "2973",
            "name" : "绥江县",
            "zip_code" : "530626"
          },
          {
            "id" : "2974",
            "name" : "镇雄县",
            "zip_code" : "530627"
          },
          {
            "id" : "2975",
            "name" : "彝良县",
            "zip_code" : "530628"
          },
          {
            "id" : "2976",
            "name" : "威信县",
            "zip_code" : "530629"
          },
          {
            "id" : "2977",
            "name" : "水富县",
            "zip_code" : "530630"
          }
        ],
        "name" : "昭通",
        "zip_code" : "530600"
      },
      {
        "id" : "308",
        "areas" : [
          {
            "id" : "2978",
            "name" : "市辖区",
            "zip_code" : "530701"
          },
          {
            "id" : "2979",
            "name" : "古城区",
            "zip_code" : "530702"
          },
          {
            "id" : "2980",
            "name" : "玉龙纳西族自治县",
            "zip_code" : "530721"
          },
          {
            "id" : "2981",
            "name" : "永胜县",
            "zip_code" : "530722"
          },
          {
            "id" : "2982",
            "name" : "华坪县",
            "zip_code" : "530723"
          },
          {
            "id" : "2983",
            "name" : "宁蒗彝族自治县",
            "zip_code" : "530724"
          }
        ],
        "name" : "丽江",
        "zip_code" : "530700"
      },
      {
        "id" : "309",
        "areas" : [
          {
            "id" : "2984",
            "name" : "市辖区",
            "zip_code" : "530801"
          },
          {
            "id" : "2985",
            "name" : "思茅区",
            "zip_code" : "530802"
          },
          {
            "id" : "2986",
            "name" : "宁洱哈尼族彝族自治县",
            "zip_code" : "530821"
          },
          {
            "id" : "2987",
            "name" : "墨江哈尼族自治县",
            "zip_code" : "530822"
          },
          {
            "id" : "2988",
            "name" : "景东彝族自治县",
            "zip_code" : "530823"
          },
          {
            "id" : "2989",
            "name" : "景谷傣族彝族自治县",
            "zip_code" : "530824"
          },
          {
            "id" : "2990",
            "name" : "镇沅彝族哈尼族拉祜族自治县",
            "zip_code" : "530825"
          },
          {
            "id" : "2991",
            "name" : "江城哈尼族彝族自治县",
            "zip_code" : "530826"
          },
          {
            "id" : "2992",
            "name" : "孟连傣族拉祜族佤族自治县",
            "zip_code" : "530827"
          },
          {
            "id" : "2993",
            "name" : "澜沧拉祜族自治县",
            "zip_code" : "530828"
          },
          {
            "id" : "2994",
            "name" : "西盟佤族自治县",
            "zip_code" : "530829"
          }
        ],
        "name" : "普洱",
        "zip_code" : "530800"
      },
      {
        "id" : "310",
        "areas" : [
          {
            "id" : "2995",
            "name" : "市辖区",
            "zip_code" : "530901"
          },
          {
            "id" : "2996",
            "name" : "临翔区",
            "zip_code" : "530902"
          },
          {
            "id" : "2997",
            "name" : "凤庆县",
            "zip_code" : "530921"
          },
          {
            "id" : "2998",
            "name" : "云县",
            "zip_code" : "530922"
          },
          {
            "id" : "2999",
            "name" : "永德县",
            "zip_code" : "530923"
          },
          {
            "id" : "3000",
            "name" : "镇康县",
            "zip_code" : "530924"
          },
          {
            "id" : "3001",
            "name" : "双江拉祜族佤族布朗族傣族自治县",
            "zip_code" : "530925"
          },
          {
            "id" : "3002",
            "name" : "耿马傣族佤族自治县",
            "zip_code" : "530926"
          },
          {
            "id" : "3003",
            "name" : "沧源佤族自治县",
            "zip_code" : "530927"
          }
        ],
        "name" : "临沧",
        "zip_code" : "530900"
      },
      {
        "id" : "311",
        "areas" : [
          {
            "id" : "3004",
            "name" : "楚雄市",
            "zip_code" : "532301"
          },
          {
            "id" : "3005",
            "name" : "双柏县",
            "zip_code" : "532322"
          },
          {
            "id" : "3006",
            "name" : "牟定县",
            "zip_code" : "532323"
          },
          {
            "id" : "3007",
            "name" : "南华县",
            "zip_code" : "532324"
          },
          {
            "id" : "3008",
            "name" : "姚安县",
            "zip_code" : "532325"
          },
          {
            "id" : "3009",
            "name" : "大姚县",
            "zip_code" : "532326"
          },
          {
            "id" : "3010",
            "name" : "永仁县",
            "zip_code" : "532327"
          },
          {
            "id" : "3011",
            "name" : "元谋县",
            "zip_code" : "532328"
          },
          {
            "id" : "3012",
            "name" : "武定县",
            "zip_code" : "532329"
          },
          {
            "id" : "3013",
            "name" : "禄丰县",
            "zip_code" : "532331"
          }
        ],
        "name" : "楚雄彝族自治州",
        "zip_code" : "532300"
      },
      {
        "id" : "312",
        "areas" : [
          {
            "id" : "3014",
            "name" : "个旧市",
            "zip_code" : "532501"
          },
          {
            "id" : "3015",
            "name" : "开远市",
            "zip_code" : "532502"
          },
          {
            "id" : "3016",
            "name" : "蒙自市",
            "zip_code" : "532503"
          },
          {
            "id" : "3017",
            "name" : "屏边苗族自治县",
            "zip_code" : "532523"
          },
          {
            "id" : "3018",
            "name" : "建水县",
            "zip_code" : "532524"
          },
          {
            "id" : "3019",
            "name" : "石屏县",
            "zip_code" : "532525"
          },
          {
            "id" : "3020",
            "name" : "弥勒县",
            "zip_code" : "532526"
          },
          {
            "id" : "3021",
            "name" : "泸西县",
            "zip_code" : "532527"
          },
          {
            "id" : "3022",
            "name" : "元阳县",
            "zip_code" : "532528"
          },
          {
            "id" : "3023",
            "name" : "红河县",
            "zip_code" : "532529"
          },
          {
            "id" : "3024",
            "name" : "金平苗族瑶族傣族自治县",
            "zip_code" : "532530"
          },
          {
            "id" : "3025",
            "name" : "绿春县",
            "zip_code" : "532531"
          },
          {
            "id" : "3026",
            "name" : "河口瑶族自治县",
            "zip_code" : "532532"
          }
        ],
        "name" : "红河哈尼族彝族自治州",
        "zip_code" : "532500"
      },
      {
        "id" : "313",
        "areas" : [
          {
            "id" : "3027",
            "name" : "文山县",
            "zip_code" : "532621"
          },
          {
            "id" : "3028",
            "name" : "砚山县",
            "zip_code" : "532622"
          },
          {
            "id" : "3029",
            "name" : "西畴县",
            "zip_code" : "532623"
          },
          {
            "id" : "3030",
            "name" : "麻栗坡县",
            "zip_code" : "532624"
          },
          {
            "id" : "3031",
            "name" : "马关县",
            "zip_code" : "532625"
          },
          {
            "id" : "3032",
            "name" : "丘北县",
            "zip_code" : "532626"
          },
          {
            "id" : "3033",
            "name" : "广南县",
            "zip_code" : "532627"
          },
          {
            "id" : "3034",
            "name" : "富宁县",
            "zip_code" : "532628"
          }
        ],
        "name" : "文山壮族苗族自治州",
        "zip_code" : "532600"
      },
      {
        "id" : "314",
        "areas" : [
          {
            "id" : "3035",
            "name" : "景洪市",
            "zip_code" : "532801"
          },
          {
            "id" : "3036",
            "name" : "勐海县",
            "zip_code" : "532822"
          },
          {
            "id" : "3037",
            "name" : "勐腊县",
            "zip_code" : "532823"
          }
        ],
        "name" : "西双版纳傣族自治州",
        "zip_code" : "532800"
      },
      {
        "id" : "315",
        "areas" : [
          {
            "id" : "3038",
            "name" : "大理市",
            "zip_code" : "532901"
          },
          {
            "id" : "3039",
            "name" : "漾濞彝族自治县",
            "zip_code" : "532922"
          },
          {
            "id" : "3040",
            "name" : "祥云县",
            "zip_code" : "532923"
          },
          {
            "id" : "3041",
            "name" : "宾川县",
            "zip_code" : "532924"
          },
          {
            "id" : "3042",
            "name" : "弥渡县",
            "zip_code" : "532925"
          },
          {
            "id" : "3043",
            "name" : "南涧彝族自治县",
            "zip_code" : "532926"
          },
          {
            "id" : "3044",
            "name" : "巍山彝族回族自治县",
            "zip_code" : "532927"
          },
          {
            "id" : "3045",
            "name" : "永平县",
            "zip_code" : "532928"
          },
          {
            "id" : "3046",
            "name" : "云龙县",
            "zip_code" : "532929"
          },
          {
            "id" : "3047",
            "name" : "洱源县",
            "zip_code" : "532930"
          },
          {
            "id" : "3048",
            "name" : "剑川县",
            "zip_code" : "532931"
          },
          {
            "id" : "3049",
            "name" : "鹤庆县",
            "zip_code" : "532932"
          }
        ],
        "name" : "大理白族自治州",
        "zip_code" : "532900"
      },
      {
        "id" : "316",
        "areas" : [
          {
            "id" : "3050",
            "name" : "瑞丽市",
            "zip_code" : "533102"
          },
          {
            "id" : "3051",
            "name" : "芒市",
            "zip_code" : "533103"
          },
          {
            "id" : "3052",
            "name" : "梁河县",
            "zip_code" : "533122"
          },
          {
            "id" : "3053",
            "name" : "盈江县",
            "zip_code" : "533123"
          },
          {
            "id" : "3054",
            "name" : "陇川县",
            "zip_code" : "533124"
          }
        ],
        "name" : "德宏傣族景颇族自治州",
        "zip_code" : "533100"
      },
      {
        "id" : "317",
        "areas" : [
          {
            "id" : "3055",
            "name" : "泸水县",
            "zip_code" : "533321"
          },
          {
            "id" : "3056",
            "name" : "福贡县",
            "zip_code" : "533323"
          },
          {
            "id" : "3057",
            "name" : "贡山独龙族怒族自治县",
            "zip_code" : "533324"
          },
          {
            "id" : "3058",
            "name" : "兰坪白族普米族自治县",
            "zip_code" : "533325"
          }
        ],
        "name" : "怒江傈僳族自治州",
        "zip_code" : "533300"
      },
      {
        "id" : "318",
        "areas" : [
          {
            "id" : "3059",
            "name" : "香格里拉县",
            "zip_code" : "533421"
          },
          {
            "id" : "3060",
            "name" : "德钦县",
            "zip_code" : "533422"
          },
          {
            "id" : "3061",
            "name" : "维西傈僳族自治县",
            "zip_code" : "533423"
          }
        ],
        "name" : "迪庆藏族自治州",
        "zip_code" : "533400"
      }
    ],
    "id" : "26",
    "name" : "云南",
    "zip_code" : "530000"
  },
  {
    "cities" : [
      {
        "id" : "319",
        "areas" : [
          {
            "id" : "3062",
            "name" : "市辖区",
            "zip_code" : "540101"
          },
          {
            "id" : "3063",
            "name" : "城关区",
            "zip_code" : "540102"
          },
          {
            "id" : "3064",
            "name" : "林周县",
            "zip_code" : "540121"
          },
          {
            "id" : "3065",
            "name" : "当雄县",
            "zip_code" : "540122"
          },
          {
            "id" : "3066",
            "name" : "尼木县",
            "zip_code" : "540123"
          },
          {
            "id" : "3067",
            "name" : "曲水县",
            "zip_code" : "540124"
          },
          {
            "id" : "3068",
            "name" : "堆龙德庆县",
            "zip_code" : "540125"
          },
          {
            "id" : "3069",
            "name" : "达孜县",
            "zip_code" : "540126"
          },
          {
            "id" : "3070",
            "name" : "墨竹工卡县",
            "zip_code" : "540127"
          }
        ],
        "name" : "拉萨",
        "zip_code" : "540100"
      },
      {
        "id" : "320",
        "areas" : [
          {
            "id" : "3071",
            "name" : "昌都县",
            "zip_code" : "542121"
          },
          {
            "id" : "3072",
            "name" : "江达县",
            "zip_code" : "542122"
          },
          {
            "id" : "3073",
            "name" : "贡觉县",
            "zip_code" : "542123"
          },
          {
            "id" : "3074",
            "name" : "类乌齐县",
            "zip_code" : "542124"
          },
          {
            "id" : "3075",
            "name" : "丁青县",
            "zip_code" : "542125"
          },
          {
            "id" : "3076",
            "name" : "察雅县",
            "zip_code" : "542126"
          },
          {
            "id" : "3077",
            "name" : "八宿县",
            "zip_code" : "542127"
          },
          {
            "id" : "3078",
            "name" : "左贡县",
            "zip_code" : "542128"
          },
          {
            "id" : "3079",
            "name" : "芒康县",
            "zip_code" : "542129"
          },
          {
            "id" : "3080",
            "name" : "洛隆县",
            "zip_code" : "542132"
          },
          {
            "id" : "3081",
            "name" : "边坝县",
            "zip_code" : "542133"
          }
        ],
        "name" : "昌都地区",
        "zip_code" : "542100"
      },
      {
        "id" : "321",
        "areas" : [
          {
            "id" : "3082",
            "name" : "乃东县",
            "zip_code" : "542221"
          },
          {
            "id" : "3083",
            "name" : "扎囊县",
            "zip_code" : "542222"
          },
          {
            "id" : "3084",
            "name" : "贡嘎县",
            "zip_code" : "542223"
          },
          {
            "id" : "3085",
            "name" : "桑日县",
            "zip_code" : "542224"
          },
          {
            "id" : "3086",
            "name" : "琼结县",
            "zip_code" : "542225"
          },
          {
            "id" : "3087",
            "name" : "曲松县",
            "zip_code" : "542226"
          },
          {
            "id" : "3088",
            "name" : "措美县",
            "zip_code" : "542227"
          },
          {
            "id" : "3089",
            "name" : "洛扎县",
            "zip_code" : "542228"
          },
          {
            "id" : "3090",
            "name" : "加查县",
            "zip_code" : "542229"
          },
          {
            "id" : "3091",
            "name" : "隆子县",
            "zip_code" : "542231"
          },
          {
            "id" : "3092",
            "name" : "错那县",
            "zip_code" : "542232"
          },
          {
            "id" : "3093",
            "name" : "浪卡子县",
            "zip_code" : "542233"
          }
        ],
        "name" : "山南地区",
        "zip_code" : "542200"
      },
      {
        "id" : "322",
        "areas" : [
          {
            "id" : "3094",
            "name" : "日喀则市",
            "zip_code" : "542301"
          },
          {
            "id" : "3095",
            "name" : "南木林县",
            "zip_code" : "542322"
          },
          {
            "id" : "3096",
            "name" : "江孜县",
            "zip_code" : "542323"
          },
          {
            "id" : "3097",
            "name" : "定日县",
            "zip_code" : "542324"
          },
          {
            "id" : "3098",
            "name" : "萨迦县",
            "zip_code" : "542325"
          },
          {
            "id" : "3099",
            "name" : "拉孜县",
            "zip_code" : "542326"
          },
          {
            "id" : "3100",
            "name" : "昂仁县",
            "zip_code" : "542327"
          },
          {
            "id" : "3101",
            "name" : "谢通门县",
            "zip_code" : "542328"
          },
          {
            "id" : "3102",
            "name" : "白朗县",
            "zip_code" : "542329"
          },
          {
            "id" : "3103",
            "name" : "仁布县",
            "zip_code" : "542330"
          },
          {
            "id" : "3104",
            "name" : "康马县",
            "zip_code" : "542331"
          },
          {
            "id" : "3105",
            "name" : "定结县",
            "zip_code" : "542332"
          },
          {
            "id" : "3106",
            "name" : "仲巴县",
            "zip_code" : "542333"
          },
          {
            "id" : "3107",
            "name" : "亚东县",
            "zip_code" : "542334"
          },
          {
            "id" : "3108",
            "name" : "吉隆县",
            "zip_code" : "542335"
          },
          {
            "id" : "3109",
            "name" : "聂拉木县",
            "zip_code" : "542336"
          },
          {
            "id" : "3110",
            "name" : "萨嘎县",
            "zip_code" : "542337"
          },
          {
            "id" : "3111",
            "name" : "岗巴县",
            "zip_code" : "542338"
          }
        ],
        "name" : "日喀则地区",
        "zip_code" : "542300"
      },
      {
        "id" : "323",
        "areas" : [
          {
            "id" : "3112",
            "name" : "那曲县",
            "zip_code" : "542421"
          },
          {
            "id" : "3113",
            "name" : "嘉黎县",
            "zip_code" : "542422"
          },
          {
            "id" : "3114",
            "name" : "比如县",
            "zip_code" : "542423"
          },
          {
            "id" : "3115",
            "name" : "聂荣县",
            "zip_code" : "542424"
          },
          {
            "id" : "3116",
            "name" : "安多县",
            "zip_code" : "542425"
          },
          {
            "id" : "3117",
            "name" : "申扎县",
            "zip_code" : "542426"
          },
          {
            "id" : "3118",
            "name" : "索县",
            "zip_code" : "542427"
          },
          {
            "id" : "3119",
            "name" : "班戈县",
            "zip_code" : "542428"
          },
          {
            "id" : "3120",
            "name" : "巴青县",
            "zip_code" : "542429"
          },
          {
            "id" : "3121",
            "name" : "尼玛县",
            "zip_code" : "542430"
          }
        ],
        "name" : "那曲地区",
        "zip_code" : "542400"
      },
      {
        "id" : "324",
        "areas" : [
          {
            "id" : "3122",
            "name" : "普兰县",
            "zip_code" : "542521"
          },
          {
            "id" : "3123",
            "name" : "札达县",
            "zip_code" : "542522"
          },
          {
            "id" : "3124",
            "name" : "噶尔县",
            "zip_code" : "542523"
          },
          {
            "id" : "3125",
            "name" : "日土县",
            "zip_code" : "542524"
          },
          {
            "id" : "3126",
            "name" : "革吉县",
            "zip_code" : "542525"
          },
          {
            "id" : "3127",
            "name" : "改则县",
            "zip_code" : "542526"
          },
          {
            "id" : "3128",
            "name" : "措勤县",
            "zip_code" : "542527"
          }
        ],
        "name" : "阿里地区",
        "zip_code" : "542500"
      },
      {
        "id" : "325",
        "areas" : [
          {
            "id" : "3129",
            "name" : "林芝县",
            "zip_code" : "542621"
          },
          {
            "id" : "3130",
            "name" : "工布江达县",
            "zip_code" : "542622"
          },
          {
            "id" : "3131",
            "name" : "米林县",
            "zip_code" : "542623"
          },
          {
            "id" : "3132",
            "name" : "墨脱县",
            "zip_code" : "542624"
          },
          {
            "id" : "3133",
            "name" : "波密县",
            "zip_code" : "542625"
          },
          {
            "id" : "3134",
            "name" : "察隅县",
            "zip_code" : "542626"
          },
          {
            "id" : "3135",
            "name" : "朗县",
            "zip_code" : "542627"
          }
        ],
        "name" : "林芝地区",
        "zip_code" : "542600"
      }
    ],
    "id" : "27",
    "name" : "西藏自治区",
    "zip_code" : "540000"
  },
  {
    "cities" : [
      {
        "id" : "326",
        "areas" : [
          {
            "id" : "3136",
            "name" : "市辖区",
            "zip_code" : "610101"
          },
          {
            "id" : "3137",
            "name" : "新城区",
            "zip_code" : "610102"
          },
          {
            "id" : "3138",
            "name" : "碑林区",
            "zip_code" : "610103"
          },
          {
            "id" : "3139",
            "name" : "莲湖区",
            "zip_code" : "610104"
          },
          {
            "id" : "3140",
            "name" : "灞桥区",
            "zip_code" : "610111"
          },
          {
            "id" : "3141",
            "name" : "未央区",
            "zip_code" : "610112"
          },
          {
            "id" : "3142",
            "name" : "雁塔区",
            "zip_code" : "610113"
          },
          {
            "id" : "3143",
            "name" : "阎良区",
            "zip_code" : "610114"
          },
          {
            "id" : "3144",
            "name" : "临潼区",
            "zip_code" : "610115"
          },
          {
            "id" : "3145",
            "name" : "长安区",
            "zip_code" : "610116"
          },
          {
            "id" : "3146",
            "name" : "蓝田县",
            "zip_code" : "610122"
          },
          {
            "id" : "3147",
            "name" : "周至县",
            "zip_code" : "610124"
          },
          {
            "id" : "3148",
            "name" : "户县",
            "zip_code" : "610125"
          },
          {
            "id" : "3149",
            "name" : "高陵县",
            "zip_code" : "610126"
          },
          {
            "id" : "5006",
            "name" : "高新区",
            "zip_code" : "710000"
          },
          {
            "id" : "5007",
            "name" : "曲江新区",
            "zip_code" : "710061"
          }
        ],
        "name" : "西安",
        "zip_code" : "610100"
      },
      {
        "id" : "327",
        "areas" : [
          {
            "id" : "3150",
            "name" : "市辖区",
            "zip_code" : "610201"
          },
          {
            "id" : "3151",
            "name" : "王益区",
            "zip_code" : "610202"
          },
          {
            "id" : "3152",
            "name" : "印台区",
            "zip_code" : "610203"
          },
          {
            "id" : "3153",
            "name" : "耀州区",
            "zip_code" : "610204"
          },
          {
            "id" : "3154",
            "name" : "宜君县",
            "zip_code" : "610222"
          }
        ],
        "name" : "铜川",
        "zip_code" : "610200"
      },
      {
        "id" : "328",
        "areas" : [
          {
            "id" : "3155",
            "name" : "市辖区",
            "zip_code" : "610301"
          },
          {
            "id" : "3156",
            "name" : "渭滨区",
            "zip_code" : "610302"
          },
          {
            "id" : "3157",
            "name" : "金台区",
            "zip_code" : "610303"
          },
          {
            "id" : "3158",
            "name" : "陈仓区",
            "zip_code" : "610304"
          },
          {
            "id" : "3159",
            "name" : "凤翔县",
            "zip_code" : "610322"
          },
          {
            "id" : "3160",
            "name" : "岐山县",
            "zip_code" : "610323"
          },
          {
            "id" : "3161",
            "name" : "扶风县",
            "zip_code" : "610324"
          },
          {
            "id" : "3162",
            "name" : "眉县",
            "zip_code" : "610326"
          },
          {
            "id" : "3163",
            "name" : "陇县",
            "zip_code" : "610327"
          },
          {
            "id" : "3164",
            "name" : "千阳县",
            "zip_code" : "610328"
          },
          {
            "id" : "3165",
            "name" : "麟游县",
            "zip_code" : "610329"
          },
          {
            "id" : "3166",
            "name" : "凤县",
            "zip_code" : "610330"
          },
          {
            "id" : "3167",
            "name" : "太白县",
            "zip_code" : "610331"
          }
        ],
        "name" : "宝鸡",
        "zip_code" : "610300"
      },
      {
        "id" : "329",
        "areas" : [
          {
            "id" : "3168",
            "name" : "市辖区",
            "zip_code" : "610401"
          },
          {
            "id" : "3169",
            "name" : "秦都区",
            "zip_code" : "610402"
          },
          {
            "id" : "3170",
            "name" : "杨陵区",
            "zip_code" : "610403"
          },
          {
            "id" : "3171",
            "name" : "渭城区",
            "zip_code" : "610404"
          },
          {
            "id" : "3172",
            "name" : "三原县",
            "zip_code" : "610422"
          },
          {
            "id" : "3173",
            "name" : "泾阳县",
            "zip_code" : "610423"
          },
          {
            "id" : "3174",
            "name" : "乾县",
            "zip_code" : "610424"
          },
          {
            "id" : "3175",
            "name" : "礼泉县",
            "zip_code" : "610425"
          },
          {
            "id" : "3176",
            "name" : "永寿县",
            "zip_code" : "610426"
          },
          {
            "id" : "3177",
            "name" : "彬县",
            "zip_code" : "610427"
          },
          {
            "id" : "3178",
            "name" : "长武县",
            "zip_code" : "610428"
          },
          {
            "id" : "3179",
            "name" : "旬邑县",
            "zip_code" : "610429"
          },
          {
            "id" : "3180",
            "name" : "淳化县",
            "zip_code" : "610430"
          },
          {
            "id" : "3181",
            "name" : "武功县",
            "zip_code" : "610431"
          },
          {
            "id" : "3182",
            "name" : "兴平市",
            "zip_code" : "610481"
          }
        ],
        "name" : "咸阳",
        "zip_code" : "610400"
      },
      {
        "id" : "330",
        "areas" : [
          {
            "id" : "3183",
            "name" : "市辖区",
            "zip_code" : "610501"
          },
          {
            "id" : "3184",
            "name" : "临渭区",
            "zip_code" : "610502"
          },
          {
            "id" : "3185",
            "name" : "华县",
            "zip_code" : "610521"
          },
          {
            "id" : "3186",
            "name" : "潼关县",
            "zip_code" : "610522"
          },
          {
            "id" : "3187",
            "name" : "大荔县",
            "zip_code" : "610523"
          },
          {
            "id" : "3188",
            "name" : "合阳县",
            "zip_code" : "610524"
          },
          {
            "id" : "3189",
            "name" : "澄城县",
            "zip_code" : "610525"
          },
          {
            "id" : "3190",
            "name" : "蒲城县",
            "zip_code" : "610526"
          },
          {
            "id" : "3191",
            "name" : "白水县",
            "zip_code" : "610527"
          },
          {
            "id" : "3192",
            "name" : "富平县",
            "zip_code" : "610528"
          },
          {
            "id" : "3193",
            "name" : "韩城市",
            "zip_code" : "610581"
          },
          {
            "id" : "3194",
            "name" : "华阴市",
            "zip_code" : "610582"
          }
        ],
        "name" : "渭南",
        "zip_code" : "610500"
      },
      {
        "id" : "331",
        "areas" : [
          {
            "id" : "3195",
            "name" : "市辖区",
            "zip_code" : "610601"
          },
          {
            "id" : "3196",
            "name" : "宝塔区",
            "zip_code" : "610602"
          },
          {
            "id" : "3197",
            "name" : "延长县",
            "zip_code" : "610621"
          },
          {
            "id" : "3198",
            "name" : "延川县",
            "zip_code" : "610622"
          },
          {
            "id" : "3199",
            "name" : "子长县",
            "zip_code" : "610623"
          },
          {
            "id" : "3200",
            "name" : "安塞县",
            "zip_code" : "610624"
          },
          {
            "id" : "3201",
            "name" : "志丹县",
            "zip_code" : "610625"
          },
          {
            "id" : "3202",
            "name" : "吴起县",
            "zip_code" : "610626"
          },
          {
            "id" : "3203",
            "name" : "甘泉县",
            "zip_code" : "610627"
          },
          {
            "id" : "3204",
            "name" : "富县",
            "zip_code" : "610628"
          },
          {
            "id" : "3205",
            "name" : "洛川县",
            "zip_code" : "610629"
          },
          {
            "id" : "3206",
            "name" : "宜川县",
            "zip_code" : "610630"
          },
          {
            "id" : "3207",
            "name" : "黄龙县",
            "zip_code" : "610631"
          },
          {
            "id" : "3208",
            "name" : "黄陵县",
            "zip_code" : "610632"
          }
        ],
        "name" : "延安",
        "zip_code" : "610600"
      },
      {
        "id" : "332",
        "areas" : [
          {
            "id" : "3209",
            "name" : "市辖区",
            "zip_code" : "610701"
          },
          {
            "id" : "3210",
            "name" : "汉台区",
            "zip_code" : "610702"
          },
          {
            "id" : "3211",
            "name" : "南郑县",
            "zip_code" : "610721"
          },
          {
            "id" : "3212",
            "name" : "城固县",
            "zip_code" : "610722"
          },
          {
            "id" : "3213",
            "name" : "洋县",
            "zip_code" : "610723"
          },
          {
            "id" : "3214",
            "name" : "西乡县",
            "zip_code" : "610724"
          },
          {
            "id" : "3215",
            "name" : "勉县",
            "zip_code" : "610725"
          },
          {
            "id" : "3216",
            "name" : "宁强县",
            "zip_code" : "610726"
          },
          {
            "id" : "3217",
            "name" : "略阳县",
            "zip_code" : "610727"
          },
          {
            "id" : "3218",
            "name" : "镇巴县",
            "zip_code" : "610728"
          },
          {
            "id" : "3219",
            "name" : "留坝县",
            "zip_code" : "610729"
          },
          {
            "id" : "3220",
            "name" : "佛坪县",
            "zip_code" : "610730"
          }
        ],
        "name" : "汉中",
        "zip_code" : "610700"
      },
      {
        "id" : "333",
        "areas" : [
          {
            "id" : "3221",
            "name" : "市辖区",
            "zip_code" : "610801"
          },
          {
            "id" : "3222",
            "name" : "榆阳区",
            "zip_code" : "610802"
          },
          {
            "id" : "3223",
            "name" : "神木县",
            "zip_code" : "610821"
          },
          {
            "id" : "3224",
            "name" : "府谷县",
            "zip_code" : "610822"
          },
          {
            "id" : "3225",
            "name" : "横山县",
            "zip_code" : "610823"
          },
          {
            "id" : "3226",
            "name" : "靖边县",
            "zip_code" : "610824"
          },
          {
            "id" : "3227",
            "name" : "定边县",
            "zip_code" : "610825"
          },
          {
            "id" : "3228",
            "name" : "绥德县",
            "zip_code" : "610826"
          },
          {
            "id" : "3229",
            "name" : "米脂县",
            "zip_code" : "610827"
          },
          {
            "id" : "3230",
            "name" : "佳县",
            "zip_code" : "610828"
          },
          {
            "id" : "3231",
            "name" : "吴堡县",
            "zip_code" : "610829"
          },
          {
            "id" : "3232",
            "name" : "清涧县",
            "zip_code" : "610830"
          },
          {
            "id" : "3233",
            "name" : "子洲县",
            "zip_code" : "610831"
          }
        ],
        "name" : "榆林",
        "zip_code" : "610800"
      },
      {
        "id" : "334",
        "areas" : [
          {
            "id" : "3234",
            "name" : "市辖区",
            "zip_code" : "610901"
          },
          {
            "id" : "3235",
            "name" : "汉滨区",
            "zip_code" : "610902"
          },
          {
            "id" : "3236",
            "name" : "汉阴县",
            "zip_code" : "610921"
          },
          {
            "id" : "3237",
            "name" : "石泉县",
            "zip_code" : "610922"
          },
          {
            "id" : "3238",
            "name" : "宁陕县",
            "zip_code" : "610923"
          },
          {
            "id" : "3239",
            "name" : "紫阳县",
            "zip_code" : "610924"
          },
          {
            "id" : "3240",
            "name" : "岚皋县",
            "zip_code" : "610925"
          },
          {
            "id" : "3241",
            "name" : "平利县",
            "zip_code" : "610926"
          },
          {
            "id" : "3242",
            "name" : "镇坪县",
            "zip_code" : "610927"
          },
          {
            "id" : "3243",
            "name" : "旬阳县",
            "zip_code" : "610928"
          },
          {
            "id" : "3244",
            "name" : "白河县",
            "zip_code" : "610929"
          }
        ],
        "name" : "安康",
        "zip_code" : "610900"
      },
      {
        "id" : "335",
        "areas" : [
          {
            "id" : "3245",
            "name" : "市辖区",
            "zip_code" : "611001"
          },
          {
            "id" : "3246",
            "name" : "商州区",
            "zip_code" : "611002"
          },
          {
            "id" : "3247",
            "name" : "洛南县",
            "zip_code" : "611021"
          },
          {
            "id" : "3248",
            "name" : "丹凤县",
            "zip_code" : "611022"
          },
          {
            "id" : "3249",
            "name" : "商南县",
            "zip_code" : "611023"
          },
          {
            "id" : "3250",
            "name" : "山阳县",
            "zip_code" : "611024"
          },
          {
            "id" : "3251",
            "name" : "镇安县",
            "zip_code" : "611025"
          },
          {
            "id" : "3252",
            "name" : "柞水县",
            "zip_code" : "611026"
          }
        ],
        "name" : "商洛",
        "zip_code" : "611000"
      }
    ],
    "id" : "28",
    "name" : "陕西",
    "zip_code" : "610000"
  },
  {
    "cities" : [
      {
        "id" : "336",
        "areas" : [
          {
            "id" : "3253",
            "name" : "市辖区",
            "zip_code" : "620101"
          },
          {
            "id" : "3254",
            "name" : "城关区",
            "zip_code" : "620102"
          },
          {
            "id" : "3255",
            "name" : "七里河区",
            "zip_code" : "620103"
          },
          {
            "id" : "3256",
            "name" : "西固区",
            "zip_code" : "620104"
          },
          {
            "id" : "3257",
            "name" : "安宁区",
            "zip_code" : "620105"
          },
          {
            "id" : "3258",
            "name" : "红古区",
            "zip_code" : "620111"
          },
          {
            "id" : "3259",
            "name" : "永登县",
            "zip_code" : "620121"
          },
          {
            "id" : "3260",
            "name" : "皋兰县",
            "zip_code" : "620122"
          },
          {
            "id" : "3261",
            "name" : "榆中县",
            "zip_code" : "620123"
          }
        ],
        "name" : "兰州",
        "zip_code" : "620100"
      },
      {
        "id" : "337",
        "areas" : [
          {
            "id" : "3262",
            "name" : "市辖区",
            "zip_code" : "620201"
          }
        ],
        "name" : "嘉峪关",
        "zip_code" : "620200"
      },
      {
        "id" : "338",
        "areas" : [
          {
            "id" : "3263",
            "name" : "市辖区",
            "zip_code" : "620301"
          },
          {
            "id" : "3264",
            "name" : "金川区",
            "zip_code" : "620302"
          },
          {
            "id" : "3265",
            "name" : "永昌县",
            "zip_code" : "620321"
          }
        ],
        "name" : "金昌",
        "zip_code" : "620300"
      },
      {
        "id" : "339",
        "areas" : [
          {
            "id" : "3266",
            "name" : "市辖区",
            "zip_code" : "620401"
          },
          {
            "id" : "3267",
            "name" : "白银区",
            "zip_code" : "620402"
          },
          {
            "id" : "3268",
            "name" : "平川区",
            "zip_code" : "620403"
          },
          {
            "id" : "3269",
            "name" : "靖远县",
            "zip_code" : "620421"
          },
          {
            "id" : "3270",
            "name" : "会宁县",
            "zip_code" : "620422"
          },
          {
            "id" : "3271",
            "name" : "景泰县",
            "zip_code" : "620423"
          }
        ],
        "name" : "白银",
        "zip_code" : "620400"
      },
      {
        "id" : "340",
        "areas" : [
          {
            "id" : "3272",
            "name" : "市辖区",
            "zip_code" : "620501"
          },
          {
            "id" : "3274",
            "name" : "秦州区",
            "zip_code" : "620502"
          },
          {
            "id" : "3275",
            "name" : "清水县",
            "zip_code" : "620521"
          },
          {
            "id" : "3276",
            "name" : "秦安县",
            "zip_code" : "620522"
          },
          {
            "id" : "3277",
            "name" : "甘谷县",
            "zip_code" : "620523"
          },
          {
            "id" : "3278",
            "name" : "武山县",
            "zip_code" : "620524"
          },
          {
            "id" : "3279",
            "name" : "张家川回族自治县",
            "zip_code" : "620525"
          },
          {
            "id" : "4000",
            "name" : "麦积区",
            "zip_code" : "620503"
          }
        ],
        "name" : "天水",
        "zip_code" : "620500"
      },
      {
        "id" : "341",
        "areas" : [
          {
            "id" : "3280",
            "name" : "市辖区",
            "zip_code" : "620601"
          },
          {
            "id" : "3281",
            "name" : "凉州区",
            "zip_code" : "620602"
          },
          {
            "id" : "3282",
            "name" : "民勤县",
            "zip_code" : "620621"
          },
          {
            "id" : "3283",
            "name" : "古浪县",
            "zip_code" : "620622"
          },
          {
            "id" : "3284",
            "name" : "天祝藏族自治县",
            "zip_code" : "620623"
          }
        ],
        "name" : "武威",
        "zip_code" : "620600"
      },
      {
        "id" : "342",
        "areas" : [
          {
            "id" : "3285",
            "name" : "市辖区",
            "zip_code" : "620701"
          },
          {
            "id" : "3286",
            "name" : "甘州区",
            "zip_code" : "620702"
          },
          {
            "id" : "3287",
            "name" : "肃南裕固族自治县",
            "zip_code" : "620721"
          },
          {
            "id" : "3288",
            "name" : "民乐县",
            "zip_code" : "620722"
          },
          {
            "id" : "3289",
            "name" : "临泽县",
            "zip_code" : "620723"
          },
          {
            "id" : "3290",
            "name" : "高台县",
            "zip_code" : "620724"
          },
          {
            "id" : "3291",
            "name" : "山丹县",
            "zip_code" : "620725"
          }
        ],
        "name" : "张掖",
        "zip_code" : "620700"
      },
      {
        "id" : "343",
        "areas" : [
          {
            "id" : "3292",
            "name" : "市辖区",
            "zip_code" : "620801"
          },
          {
            "id" : "3293",
            "name" : "崆峒区",
            "zip_code" : "620802"
          },
          {
            "id" : "3294",
            "name" : "泾川县",
            "zip_code" : "620821"
          },
          {
            "id" : "3295",
            "name" : "灵台县",
            "zip_code" : "620822"
          },
          {
            "id" : "3296",
            "name" : "崇信县",
            "zip_code" : "620823"
          },
          {
            "id" : "3297",
            "name" : "华亭县",
            "zip_code" : "620824"
          },
          {
            "id" : "3298",
            "name" : "庄浪县",
            "zip_code" : "620825"
          },
          {
            "id" : "3299",
            "name" : "静宁县",
            "zip_code" : "620826"
          }
        ],
        "name" : "平凉",
        "zip_code" : "620800"
      },
      {
        "id" : "344",
        "areas" : [
          {
            "id" : "3300",
            "name" : "市辖区",
            "zip_code" : "620901"
          },
          {
            "id" : "3301",
            "name" : "肃州区",
            "zip_code" : "620902"
          },
          {
            "id" : "3302",
            "name" : "金塔县",
            "zip_code" : "620921"
          },
          {
            "id" : "3304",
            "name" : "肃北蒙古族自治县",
            "zip_code" : "620923"
          },
          {
            "id" : "3305",
            "name" : "阿克塞哈萨克族自治县",
            "zip_code" : "620924"
          },
          {
            "id" : "3306",
            "name" : "玉门市",
            "zip_code" : "620981"
          },
          {
            "id" : "3307",
            "name" : "敦煌市",
            "zip_code" : "620982"
          },
          {
            "id" : "4500",
            "name" : "瓜州县",
            "zip_code" : "620922"
          }
        ],
        "name" : "酒泉",
        "zip_code" : "620900"
      },
      {
        "id" : "345",
        "areas" : [
          {
            "id" : "3308",
            "name" : "市辖区",
            "zip_code" : "621001"
          },
          {
            "id" : "3309",
            "name" : "西峰区",
            "zip_code" : "621002"
          },
          {
            "id" : "3310",
            "name" : "庆城县",
            "zip_code" : "621021"
          },
          {
            "id" : "3311",
            "name" : "环县",
            "zip_code" : "621022"
          },
          {
            "id" : "3312",
            "name" : "华池县",
            "zip_code" : "621023"
          },
          {
            "id" : "3313",
            "name" : "合水县",
            "zip_code" : "621024"
          },
          {
            "id" : "3314",
            "name" : "正宁县",
            "zip_code" : "621025"
          },
          {
            "id" : "3315",
            "name" : "宁县",
            "zip_code" : "621026"
          },
          {
            "id" : "3316",
            "name" : "镇原县",
            "zip_code" : "621027"
          }
        ],
        "name" : "庆阳",
        "zip_code" : "621000"
      },
      {
        "id" : "346",
        "areas" : [
          {
            "id" : "3317",
            "name" : "市辖区",
            "zip_code" : "621101"
          },
          {
            "id" : "3318",
            "name" : "安定区",
            "zip_code" : "621102"
          },
          {
            "id" : "3319",
            "name" : "通渭县",
            "zip_code" : "621121"
          },
          {
            "id" : "3320",
            "name" : "陇西县",
            "zip_code" : "621122"
          },
          {
            "id" : "3321",
            "name" : "渭源县",
            "zip_code" : "621123"
          },
          {
            "id" : "3322",
            "name" : "临洮县",
            "zip_code" : "621124"
          },
          {
            "id" : "3323",
            "name" : "漳县",
            "zip_code" : "621125"
          },
          {
            "id" : "3324",
            "name" : "岷县",
            "zip_code" : "621126"
          }
        ],
        "name" : "定西",
        "zip_code" : "621100"
      },
      {
        "id" : "347",
        "areas" : [
          {
            "id" : "3325",
            "name" : "市辖区",
            "zip_code" : "621201"
          },
          {
            "id" : "3326",
            "name" : "武都区",
            "zip_code" : "621202"
          },
          {
            "id" : "3327",
            "name" : "成县",
            "zip_code" : "621221"
          },
          {
            "id" : "3328",
            "name" : "文县",
            "zip_code" : "621222"
          },
          {
            "id" : "3329",
            "name" : "宕昌县",
            "zip_code" : "621223"
          },
          {
            "id" : "3330",
            "name" : "康县",
            "zip_code" : "621224"
          },
          {
            "id" : "3331",
            "name" : "西和县",
            "zip_code" : "621225"
          },
          {
            "id" : "3332",
            "name" : "礼县",
            "zip_code" : "621226"
          },
          {
            "id" : "3333",
            "name" : "徽县",
            "zip_code" : "621227"
          },
          {
            "id" : "3334",
            "name" : "两当县",
            "zip_code" : "621228"
          }
        ],
        "name" : "陇南",
        "zip_code" : "621200"
      },
      {
        "id" : "348",
        "areas" : [
          {
            "id" : "3335",
            "name" : "临夏市",
            "zip_code" : "622901"
          },
          {
            "id" : "3336",
            "name" : "临夏县",
            "zip_code" : "622921"
          },
          {
            "id" : "3337",
            "name" : "康乐县",
            "zip_code" : "622922"
          },
          {
            "id" : "3338",
            "name" : "永靖县",
            "zip_code" : "622923"
          },
          {
            "id" : "3339",
            "name" : "广河县",
            "zip_code" : "622924"
          },
          {
            "id" : "3340",
            "name" : "和政县",
            "zip_code" : "622925"
          },
          {
            "id" : "3341",
            "name" : "东乡族自治县",
            "zip_code" : "622926"
          },
          {
            "id" : "3342",
            "name" : "积石山保安族东乡族撒拉族自治县",
            "zip_code" : "622927"
          }
        ],
        "name" : "临夏回族自治州",
        "zip_code" : "622900"
      },
      {
        "id" : "349",
        "areas" : [
          {
            "id" : "3343",
            "name" : "合作市",
            "zip_code" : "623001"
          },
          {
            "id" : "3344",
            "name" : "临潭县",
            "zip_code" : "623021"
          },
          {
            "id" : "3345",
            "name" : "卓尼县",
            "zip_code" : "623022"
          },
          {
            "id" : "3346",
            "name" : "舟曲县",
            "zip_code" : "623023"
          },
          {
            "id" : "3347",
            "name" : "迭部县",
            "zip_code" : "623024"
          },
          {
            "id" : "3348",
            "name" : "玛曲县",
            "zip_code" : "623025"
          },
          {
            "id" : "3349",
            "name" : "碌曲县",
            "zip_code" : "623026"
          },
          {
            "id" : "3350",
            "name" : "夏河县",
            "zip_code" : "623027"
          }
        ],
        "name" : "甘南藏族自治州",
        "zip_code" : "623000"
      }
    ],
    "id" : "29",
    "name" : "甘肃",
    "zip_code" : "620000"
  },
  {
    "cities" : [
      {
        "id" : "350",
        "areas" : [
          {
            "id" : "3351",
            "name" : "市辖区",
            "zip_code" : "630101"
          },
          {
            "id" : "3352",
            "name" : "城东区",
            "zip_code" : "630102"
          },
          {
            "id" : "3353",
            "name" : "城中区",
            "zip_code" : "630103"
          },
          {
            "id" : "3354",
            "name" : "城西区",
            "zip_code" : "630104"
          },
          {
            "id" : "3355",
            "name" : "城北区",
            "zip_code" : "630105"
          },
          {
            "id" : "3356",
            "name" : "大通回族土族自治县",
            "zip_code" : "630121"
          },
          {
            "id" : "3357",
            "name" : "湟中县",
            "zip_code" : "630122"
          },
          {
            "id" : "3358",
            "name" : "湟源县",
            "zip_code" : "630123"
          }
        ],
        "name" : "西宁",
        "zip_code" : "630100"
      },
      {
        "id" : "351",
        "areas" : [
          {
            "id" : "3359",
            "name" : "平安县",
            "zip_code" : "632121"
          },
          {
            "id" : "3360",
            "name" : "民和回族土族自治县",
            "zip_code" : "632122"
          },
          {
            "id" : "3361",
            "name" : "乐都县",
            "zip_code" : "632123"
          },
          {
            "id" : "3362",
            "name" : "互助土族自治县",
            "zip_code" : "632126"
          },
          {
            "id" : "3363",
            "name" : "化隆回族自治县",
            "zip_code" : "632127"
          },
          {
            "id" : "3364",
            "name" : "循化撒拉族自治县",
            "zip_code" : "632128"
          }
        ],
        "name" : "海东地区",
        "zip_code" : "632100"
      },
      {
        "id" : "352",
        "areas" : [
          {
            "id" : "3365",
            "name" : "门源回族自治县",
            "zip_code" : "632221"
          },
          {
            "id" : "3366",
            "name" : "祁连县",
            "zip_code" : "632222"
          },
          {
            "id" : "3367",
            "name" : "海晏县",
            "zip_code" : "632223"
          },
          {
            "id" : "3368",
            "name" : "刚察县",
            "zip_code" : "632224"
          }
        ],
        "name" : "海北藏族自治州",
        "zip_code" : "632200"
      },
      {
        "id" : "353",
        "areas" : [
          {
            "id" : "3369",
            "name" : "同仁县",
            "zip_code" : "632321"
          },
          {
            "id" : "3370",
            "name" : "尖扎县",
            "zip_code" : "632322"
          },
          {
            "id" : "3371",
            "name" : "泽库县",
            "zip_code" : "632323"
          },
          {
            "id" : "3372",
            "name" : "河南蒙古族自治县",
            "zip_code" : "632324"
          }
        ],
        "name" : "黄南藏族自治州",
        "zip_code" : "632300"
      },
      {
        "id" : "354",
        "areas" : [
          {
            "id" : "3373",
            "name" : "共和县",
            "zip_code" : "632521"
          },
          {
            "id" : "3374",
            "name" : "同德县",
            "zip_code" : "632522"
          },
          {
            "id" : "3375",
            "name" : "贵德县",
            "zip_code" : "632523"
          },
          {
            "id" : "3376",
            "name" : "兴海县",
            "zip_code" : "632524"
          },
          {
            "id" : "3377",
            "name" : "贵南县",
            "zip_code" : "632525"
          }
        ],
        "name" : "海南藏族自治州",
        "zip_code" : "632500"
      },
      {
        "id" : "355",
        "areas" : [
          {
            "id" : "3378",
            "name" : "玛沁县",
            "zip_code" : "632621"
          },
          {
            "id" : "3379",
            "name" : "班玛县",
            "zip_code" : "632622"
          },
          {
            "id" : "3380",
            "name" : "甘德县",
            "zip_code" : "632623"
          },
          {
            "id" : "3381",
            "name" : "达日县",
            "zip_code" : "632624"
          },
          {
            "id" : "3382",
            "name" : "久治县",
            "zip_code" : "632625"
          },
          {
            "id" : "3383",
            "name" : "玛多县",
            "zip_code" : "632626"
          }
        ],
        "name" : "果洛藏族自治州",
        "zip_code" : "632600"
      },
      {
        "id" : "356",
        "areas" : [
          {
            "id" : "3384",
            "name" : "玉树县",
            "zip_code" : "632721"
          },
          {
            "id" : "3385",
            "name" : "杂多县",
            "zip_code" : "632722"
          },
          {
            "id" : "3386",
            "name" : "称多县",
            "zip_code" : "632723"
          },
          {
            "id" : "3387",
            "name" : "治多县",
            "zip_code" : "632724"
          },
          {
            "id" : "3388",
            "name" : "囊谦县",
            "zip_code" : "632725"
          },
          {
            "id" : "3389",
            "name" : "曲麻莱县",
            "zip_code" : "632726"
          }
        ],
        "name" : "玉树藏族自治州",
        "zip_code" : "632700"
      },
      {
        "id" : "357",
        "areas" : [
          {
            "id" : "3390",
            "name" : "格尔木市",
            "zip_code" : "632801"
          },
          {
            "id" : "3391",
            "name" : "德令哈市",
            "zip_code" : "632802"
          },
          {
            "id" : "3392",
            "name" : "乌兰县",
            "zip_code" : "632821"
          },
          {
            "id" : "3393",
            "name" : "都兰县",
            "zip_code" : "632822"
          },
          {
            "id" : "3394",
            "name" : "天峻县",
            "zip_code" : "632823"
          }
        ],
        "name" : "海西蒙古族藏族自治州",
        "zip_code" : "632800"
      }
    ],
    "id" : "30",
    "name" : "青海",
    "zip_code" : "630000"
  },
  {
    "cities" : [
      {
        "id" : "358",
        "areas" : [
          {
            "id" : "3395",
            "name" : "市辖区",
            "zip_code" : "640101"
          },
          {
            "id" : "3396",
            "name" : "兴庆区",
            "zip_code" : "640104"
          },
          {
            "id" : "3397",
            "name" : "西夏区",
            "zip_code" : "640105"
          },
          {
            "id" : "3398",
            "name" : "金凤区",
            "zip_code" : "640106"
          },
          {
            "id" : "3399",
            "name" : "永宁县",
            "zip_code" : "640121"
          },
          {
            "id" : "3400",
            "name" : "贺兰县",
            "zip_code" : "640122"
          },
          {
            "id" : "3401",
            "name" : "灵武市",
            "zip_code" : "640181"
          }
        ],
        "name" : "银川",
        "zip_code" : "640100"
      },
      {
        "id" : "359",
        "areas" : [
          {
            "id" : "3402",
            "name" : "市辖区",
            "zip_code" : "640201"
          },
          {
            "id" : "3403",
            "name" : "大武口区",
            "zip_code" : "640202"
          },
          {
            "id" : "3404",
            "name" : "惠农区",
            "zip_code" : "640205"
          },
          {
            "id" : "3405",
            "name" : "平罗县",
            "zip_code" : "640221"
          }
        ],
        "name" : "石嘴山",
        "zip_code" : "640200"
      },
      {
        "id" : "360",
        "areas" : [
          {
            "id" : "3406",
            "name" : "市辖区",
            "zip_code" : "640301"
          },
          {
            "id" : "3407",
            "name" : "利通区",
            "zip_code" : "640302"
          },
          {
            "id" : "3408",
            "name" : "盐池县",
            "zip_code" : "640323"
          },
          {
            "id" : "3409",
            "name" : "同心县",
            "zip_code" : "640324"
          },
          {
            "id" : "3410",
            "name" : "青铜峡市",
            "zip_code" : "640381"
          },
          {
            "id" : "4400",
            "name" : "红寺堡区",
            "zip_code" : "640303"
          }
        ],
        "name" : "吴忠",
        "zip_code" : "640300"
      },
      {
        "id" : "361",
        "areas" : [
          {
            "id" : "3411",
            "name" : "市辖区",
            "zip_code" : "640401"
          },
          {
            "id" : "3412",
            "name" : "原州区",
            "zip_code" : "640402"
          },
          {
            "id" : "3413",
            "name" : "西吉县",
            "zip_code" : "640422"
          },
          {
            "id" : "3414",
            "name" : "隆德县",
            "zip_code" : "640423"
          },
          {
            "id" : "3415",
            "name" : "泾源县",
            "zip_code" : "640424"
          },
          {
            "id" : "3416",
            "name" : "彭阳县",
            "zip_code" : "640425"
          }
        ],
        "name" : "固原",
        "zip_code" : "640400"
      },
      {
        "id" : "362",
        "areas" : [
          {
            "id" : "3417",
            "name" : "市辖区",
            "zip_code" : "640501"
          },
          {
            "id" : "3418",
            "name" : "沙坡头区",
            "zip_code" : "640502"
          },
          {
            "id" : "3419",
            "name" : "中宁县",
            "zip_code" : "640521"
          },
          {
            "id" : "3420",
            "name" : "海原县",
            "zip_code" : "640522"
          }
        ],
        "name" : "中卫",
        "zip_code" : "640500"
      }
    ],
    "id" : "31",
    "name" : "宁夏回族自治区",
    "zip_code" : "640000"
  },
  {
    "cities" : [
      {
        "id" : "363",
        "areas" : [
          {
            "id" : "3421",
            "name" : "市辖区",
            "zip_code" : "650101"
          },
          {
            "id" : "3422",
            "name" : "天山区",
            "zip_code" : "650102"
          },
          {
            "id" : "3423",
            "name" : "沙依巴克区",
            "zip_code" : "650103"
          },
          {
            "id" : "3424",
            "name" : "新市区",
            "zip_code" : "650104"
          },
          {
            "id" : "3425",
            "name" : "水磨沟区",
            "zip_code" : "650105"
          },
          {
            "id" : "3426",
            "name" : "头屯河区",
            "zip_code" : "650106"
          },
          {
            "id" : "3427",
            "name" : "达坂城区",
            "zip_code" : "650107"
          },
          {
            "id" : "3428",
            "name" : "米东区",
            "zip_code" : "650109"
          },
          {
            "id" : "3429",
            "name" : "乌鲁木齐县",
            "zip_code" : "650121"
          }
        ],
        "name" : "乌鲁木齐",
        "zip_code" : "650100"
      },
      {
        "id" : "364",
        "areas" : [
          {
            "id" : "3430",
            "name" : "市辖区",
            "zip_code" : "650201"
          },
          {
            "id" : "3431",
            "name" : "独山子区",
            "zip_code" : "650202"
          },
          {
            "id" : "3432",
            "name" : "克拉玛依区",
            "zip_code" : "650203"
          },
          {
            "id" : "3433",
            "name" : "白碱滩区",
            "zip_code" : "650204"
          },
          {
            "id" : "3434",
            "name" : "乌尔禾区",
            "zip_code" : "650205"
          }
        ],
        "name" : "克拉玛依",
        "zip_code" : "650200"
      },
      {
        "id" : "365",
        "areas" : [
          {
            "id" : "3435",
            "name" : "吐鲁番市",
            "zip_code" : "652101"
          },
          {
            "id" : "3436",
            "name" : "鄯善县",
            "zip_code" : "652122"
          },
          {
            "id" : "3437",
            "name" : "托克逊县",
            "zip_code" : "652123"
          }
        ],
        "name" : "吐鲁番地区",
        "zip_code" : "652100"
      },
      {
        "id" : "366",
        "areas" : [
          {
            "id" : "3438",
            "name" : "哈密市",
            "zip_code" : "652201"
          },
          {
            "id" : "3439",
            "name" : "巴里坤哈萨克自治县",
            "zip_code" : "652222"
          },
          {
            "id" : "3440",
            "name" : "伊吾县",
            "zip_code" : "652223"
          }
        ],
        "name" : "哈密地区",
        "zip_code" : "652200"
      },
      {
        "id" : "367",
        "areas" : [
          {
            "id" : "3441",
            "name" : "昌吉市",
            "zip_code" : "652301"
          },
          {
            "id" : "3442",
            "name" : "阜康市",
            "zip_code" : "652302"
          },
          {
            "id" : "3444",
            "name" : "呼图壁县",
            "zip_code" : "652323"
          },
          {
            "id" : "3445",
            "name" : "玛纳斯县",
            "zip_code" : "652324"
          },
          {
            "id" : "3446",
            "name" : "奇台县",
            "zip_code" : "652325"
          },
          {
            "id" : "3447",
            "name" : "吉木萨尔县",
            "zip_code" : "652327"
          },
          {
            "id" : "3448",
            "name" : "木垒哈萨克自治县",
            "zip_code" : "652328"
          }
        ],
        "name" : "昌吉回族自治州",
        "zip_code" : "652300"
      },
      {
        "id" : "368",
        "areas" : [
          {
            "id" : "3449",
            "name" : "博乐市",
            "zip_code" : "652701"
          },
          {
            "id" : "3450",
            "name" : "精河县",
            "zip_code" : "652722"
          },
          {
            "id" : "3451",
            "name" : "温泉县",
            "zip_code" : "652723"
          }
        ],
        "name" : "博尔塔拉蒙古自治州",
        "zip_code" : "652700"
      },
      {
        "id" : "369",
        "areas" : [
          {
            "id" : "3452",
            "name" : "库尔勒市",
            "zip_code" : "652801"
          },
          {
            "id" : "3453",
            "name" : "轮台县",
            "zip_code" : "652822"
          },
          {
            "id" : "3454",
            "name" : "尉犁县",
            "zip_code" : "652823"
          },
          {
            "id" : "3455",
            "name" : "若羌县",
            "zip_code" : "652824"
          },
          {
            "id" : "3456",
            "name" : "且末县",
            "zip_code" : "652825"
          },
          {
            "id" : "3457",
            "name" : "焉耆回族自治县",
            "zip_code" : "652826"
          },
          {
            "id" : "3458",
            "name" : "和静县",
            "zip_code" : "652827"
          },
          {
            "id" : "3459",
            "name" : "和硕县",
            "zip_code" : "652828"
          },
          {
            "id" : "3460",
            "name" : "博湖县",
            "zip_code" : "652829"
          }
        ],
        "name" : "巴音郭楞蒙古自治州",
        "zip_code" : "652800"
      },
      {
        "id" : "370",
        "areas" : [
          {
            "id" : "3461",
            "name" : "阿克苏市",
            "zip_code" : "652901"
          },
          {
            "id" : "3462",
            "name" : "温宿县",
            "zip_code" : "652922"
          },
          {
            "id" : "3463",
            "name" : "库车县",
            "zip_code" : "652923"
          },
          {
            "id" : "3464",
            "name" : "沙雅县",
            "zip_code" : "652924"
          },
          {
            "id" : "3465",
            "name" : "新和县",
            "zip_code" : "652925"
          },
          {
            "id" : "3466",
            "name" : "拜城县",
            "zip_code" : "652926"
          },
          {
            "id" : "3467",
            "name" : "乌什县",
            "zip_code" : "652927"
          },
          {
            "id" : "3468",
            "name" : "阿瓦提县",
            "zip_code" : "652928"
          },
          {
            "id" : "3469",
            "name" : "柯坪县",
            "zip_code" : "652929"
          }
        ],
        "name" : "阿克苏地区",
        "zip_code" : "652900"
      },
      {
        "id" : "371",
        "areas" : [
          {
            "id" : "3470",
            "name" : "阿图什市",
            "zip_code" : "653001"
          },
          {
            "id" : "3471",
            "name" : "阿克陶县",
            "zip_code" : "653022"
          },
          {
            "id" : "3472",
            "name" : "阿合奇县",
            "zip_code" : "653023"
          },
          {
            "id" : "3473",
            "name" : "乌恰县",
            "zip_code" : "653024"
          }
        ],
        "name" : "克孜勒苏柯尔克孜自治州",
        "zip_code" : "653000"
      },
      {
        "id" : "372",
        "areas" : [
          {
            "id" : "3474",
            "name" : "喀什市",
            "zip_code" : "653101"
          },
          {
            "id" : "3475",
            "name" : "疏附县",
            "zip_code" : "653121"
          },
          {
            "id" : "3476",
            "name" : "疏勒县",
            "zip_code" : "653122"
          },
          {
            "id" : "3477",
            "name" : "英吉沙县",
            "zip_code" : "653123"
          },
          {
            "id" : "3478",
            "name" : "泽普县",
            "zip_code" : "653124"
          },
          {
            "id" : "3479",
            "name" : "莎车县",
            "zip_code" : "653125"
          },
          {
            "id" : "3480",
            "name" : "叶城县",
            "zip_code" : "653126"
          },
          {
            "id" : "3481",
            "name" : "麦盖提县",
            "zip_code" : "653127"
          },
          {
            "id" : "3482",
            "name" : "岳普湖县",
            "zip_code" : "653128"
          },
          {
            "id" : "3483",
            "name" : "伽师县",
            "zip_code" : "653129"
          },
          {
            "id" : "3484",
            "name" : "巴楚县",
            "zip_code" : "653130"
          },
          {
            "id" : "3485",
            "name" : "塔什库尔干塔吉克自治县",
            "zip_code" : "653131"
          }
        ],
        "name" : "喀什地区",
        "zip_code" : "653100"
      },
      {
        "id" : "373",
        "areas" : [
          {
            "id" : "3486",
            "name" : "和田市",
            "zip_code" : "653201"
          },
          {
            "id" : "3487",
            "name" : "和田县",
            "zip_code" : "653221"
          },
          {
            "id" : "3488",
            "name" : "墨玉县",
            "zip_code" : "653222"
          },
          {
            "id" : "3489",
            "name" : "皮山县",
            "zip_code" : "653223"
          },
          {
            "id" : "3490",
            "name" : "洛浦县",
            "zip_code" : "653224"
          },
          {
            "id" : "3491",
            "name" : "策勒县",
            "zip_code" : "653225"
          },
          {
            "id" : "3492",
            "name" : "于田县",
            "zip_code" : "653226"
          },
          {
            "id" : "3493",
            "name" : "民丰县",
            "zip_code" : "653227"
          }
        ],
        "name" : "和田地区",
        "zip_code" : "653200"
      },
      {
        "id" : "374",
        "areas" : [
          {
            "id" : "3494",
            "name" : "伊宁市",
            "zip_code" : "654002"
          },
          {
            "id" : "3495",
            "name" : "奎屯市",
            "zip_code" : "654003"
          },
          {
            "id" : "3496",
            "name" : "伊宁县",
            "zip_code" : "654021"
          },
          {
            "id" : "3497",
            "name" : "察布查尔锡伯自治县",
            "zip_code" : "654022"
          },
          {
            "id" : "3498",
            "name" : "霍城县",
            "zip_code" : "654023"
          },
          {
            "id" : "3499",
            "name" : "巩留县",
            "zip_code" : "654024"
          },
          {
            "id" : "3500",
            "name" : "新源县",
            "zip_code" : "654025"
          },
          {
            "id" : "3501",
            "name" : "昭苏县",
            "zip_code" : "654026"
          },
          {
            "id" : "3502",
            "name" : "特克斯县",
            "zip_code" : "654027"
          },
          {
            "id" : "3503",
            "name" : "尼勒克县",
            "zip_code" : "654028"
          }
        ],
        "name" : "伊犁哈萨克自治州",
        "zip_code" : "654000"
      },
      {
        "id" : "375",
        "areas" : [
          {
            "id" : "3504",
            "name" : "塔城市",
            "zip_code" : "654201"
          },
          {
            "id" : "3505",
            "name" : "乌苏市",
            "zip_code" : "654202"
          },
          {
            "id" : "3506",
            "name" : "额敏县",
            "zip_code" : "654221"
          },
          {
            "id" : "3507",
            "name" : "沙湾县",
            "zip_code" : "654223"
          },
          {
            "id" : "3508",
            "name" : "托里县",
            "zip_code" : "654224"
          },
          {
            "id" : "3509",
            "name" : "裕民县",
            "zip_code" : "654225"
          },
          {
            "id" : "3510",
            "name" : "和布克赛尔蒙古自治县",
            "zip_code" : "654226"
          }
        ],
        "name" : "塔城地区",
        "zip_code" : "654200"
      },
      {
        "id" : "376",
        "areas" : [
          {
            "id" : "3511",
            "name" : "阿勒泰市",
            "zip_code" : "654301"
          },
          {
            "id" : "3512",
            "name" : "布尔津县",
            "zip_code" : "654321"
          },
          {
            "id" : "3513",
            "name" : "富蕴县",
            "zip_code" : "654322"
          },
          {
            "id" : "3514",
            "name" : "福海县",
            "zip_code" : "654323"
          },
          {
            "id" : "3515",
            "name" : "哈巴河县",
            "zip_code" : "654324"
          },
          {
            "id" : "3516",
            "name" : "青河县",
            "zip_code" : "654325"
          },
          {
            "id" : "3517",
            "name" : "吉木乃县",
            "zip_code" : "654326"
          }
        ],
        "name" : "阿勒泰地区",
        "zip_code" : "654300"
      },
      {
        "id" : "377",
        "areas" : [
          {
            "id" : "3518",
            "name" : "石河子市",
            "zip_code" : "659001"
          },
          {
            "id" : "3519",
            "name" : "阿拉尔市",
            "zip_code" : "659002"
          },
          {
            "id" : "3520",
            "name" : "图木舒克市",
            "zip_code" : "659003"
          },
          {
            "id" : "3521",
            "name" : "五家渠市",
            "zip_code" : "659004"
          }
        ],
        "name" : "自治区直辖县级行政区划",
        "zip_code" : "659000"
      }
    ],
    "id" : "32",
    "name" : "新疆维吾尔自治区",
    "zip_code" : "650000"
  },
  {
    "cities" : [

    ],
    "id" : "5001",
    "name" : "香港特别行政区",
    "zip_code" : "810000"
  },
  {
    "cities" : [

    ],
    "id" : "5002",
    "name" : "澳门特别行政区",
    "zip_code" : "820000"
  },
  {
    "cities" : [

    ],
    "id" : "5003",
    "name" : "台湾",
    "zip_code" : "710000"
  }
]

export default regions;